{
    "AUSTRIA-ENGLAND": {
        "F1902M": {
            "mentioned": [
                "germany"
            ],
            "start": {
                "ENGLAND": [
                    "A BEL H",
                    "A LON - DEN VIA",
                    "F NTH C A LON - DEN",
                    "F SKA S A LON - DEN"
                ]
            },
            "end": {
                "ENGLAND": [
                    "A BEL - DEN VIA",
                    "A LON - YOR",
                    "F NTH C A BEL - DEN",
                    "F SKA S A BEL - DEN"
                ]
            },
            "messages": [
                "ENGLAND: Best of luck! I'm worried you're going to die before I do, myself.",
                "ENGLAND: By the way, I'm thinking about intentionally throwing everything I have left at Russia and France, and if you could convince Germany to do likewise, that'd be wonderful."
            ]
        }
    },
    "AUSTRIA-FRANCE": {},
    "AUSTRIA-GERMANY": {},
    "AUSTRIA-ITALY": {
        "S1903M": {
            "mentioned": [
                "tri"
            ],
            "start": {
                "AUSTRIA": [
                    "A TRI - VEN",
                    "F ADR S A TRI - VEN"
                ],
                "ITALY": [
                    "A ROM S A VEN",
                    "A VEN H"
                ]
            },
            "end": {
                "AUSTRIA": [
                    "A TRI H",
                    "F ADR S A TRI"
                ],
                "ITALY": [
                    "A ROM - APU",
                    "A VEN S A TRI"
                ]
            },
            "messages": [
                "ITALY: Any thoughts? I'm guessing we'll both keep fighting while we're both slowly eliminated",
                "AUSTRIA: Correct! That's the intent.",
                "ITALY: Turkey and Russia seem to be working together well, which isn't great for either of us",
                "ITALY: I'm going to use my armies to hold Tri for you, so at least you can free up your fleet. Does that sound good?",
                "ITALY: We'll probably need help from Germany, although I think they're busy with France and England",
                "AUSTRIA: Eh sure, why not",
                "ITALY: Great! Hopefully we can slow down Turkey and Russia a bit",
                "ITALY: I think we're pretty screwed though, with those 3 Turkish fleets",
                "AUSTRIA: Oh absolutely, it's so joever.",
                "ITALY: Well, I'm trying to convince Turkey that the bigger threat is Russia"
            ]
        }
    },
    "AUSTRIA-RUSSIA": {
        "S1902M": {
            "mentioned": [
                "bud"
            ],
            "start": {
                "RUSSIA": [
                    "A BUD S A RUM - SER",
                    "A RUM - SER"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A BUD - VIE",
                    "A RUM - BUD"
                ]
            },
            "messages": [
                "RUSSIA: Are you going to continue to move against Italy?",
                "AUSTRIA: Get out of Budapest.",
                "AUSTRIA: I'm moving on Moscow, go protect it."
            ]
        },
        "F1902M": {
            "mentioned": [
                "ser"
            ],
            "start": {
                "RUSSIA": [
                    "A RUM - BUD"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A RUM S A BUL - SER"
                ]
            },
            "messages": [
                "RUSSIA: Sorry, Germany's moves have forced my hand",
                "AUSTRIA: Support me to Serbia.",
                "AUSTRIA: Shush. Support me to Serbia. Turks. Turks winning. Support me to Serbia.",
                "AUSTRIA: Support me to Serbia.",
                "AUSTRIA: Support me to Serbia.",
                "AUSTRIA: Support me to Serbia.",
                "AUSTRIA: Support me to Serbia."
            ]
        }
    },
    "AUSTRIA-TURKEY": {},
    "ENGLAND-FRANCE": {
        "S1901M": {
            "mentioned": [
                "yor",
                "lvp"
            ],
            "start": {
                "ENGLAND": [
                    "A LVP - EDI"
                ]
            },
            "end": {
                "ENGLAND": [
                    "A LVP - YOR"
                ]
            },
            "messages": [
                "ENGLAND: Hey France! I know our nations tend to fight a lot, but I'm hoping we can work out a way to avoid that. DMZ English Channel to start off our relations?",
                "FRANCE: Hi England, sure I'd love to DMZ the channel",
                "ENGLAND: Great!",
                "FRANCE: How do you plan to open?",
                "ENGLAND: North Sea, Norwegian Sea, Yorkshire. Yourself?",
                "ENGLAND: (And of course, Liverpool to Yorkshire.)",
                "FRANCE: sounds good, I'll move to MAO. Germany wants to bounce in Bur but I'd prefer not to.",
                "ENGLAND: Interesting. I'd say let him, but obviously it's a risky move."
            ]
        },
        "S1902M": {
            "mentioned": [
                "bur"
            ],
            "start": {
                "FRANCE": [
                    "A BUR H",
                    "A SPA - MAR",
                    "F MAR - LYO"
                ]
            },
            "end": {
                "FRANCE": [
                    "A BUR - BEL",
                    "A SPA - GAS",
                    "F MAR - SPA/SC"
                ]
            },
            "messages": [
                "FRANCE: This is looking like an RT with Austria giving so much ground in the balkans, don't you think?",
                "ENGLAND: That's what I'm worried about. Maybe we should move against Germany?",
                "ENGLAND: If that's the case, I'd think A Burgundy - Ruhr, A Paris - Burgundy might be wise.",
                "FRANCE: I doubt I'd be able to walk into Ruh like that",
                "ENGLAND: Agreed, but it would open up some interesting possibilities."
            ]
        },
        "F1903M": {
            "mentioned": [
                "nao",
                "nwg"
            ],
            "start": {
                "ENGLAND": [
                    "F ENG - BEL",
                    "F NAO - IRI",
                    "F NTH S F ENG - BEL"
                ],
                "FRANCE": [
                    "A BEL S A KIE - HOL",
                    "F IRI - LVP"
                ]
            },
            "end": {
                "ENGLAND": [
                    "F ENG - WAL",
                    "F NAO - NWG",
                    "F NTH - NWY"
                ],
                "FRANCE": [
                    "A BEL - HOL",
                    "F IRI - WAL"
                ]
            },
            "messages": [
                "ENGLAND: Good moves! You almost got me there.",
                "ENGLAND: I've got to hand it to you, though.",
                "FRANCE: You out guessed me on that one. ",
                "ENGLAND: It's going to be a lot of guessing from here on out, though.",
                "ENGLAND: I might move NAO back to Norwegian sea.",
                "FRANCE: Okay, that would certainly be fine with me"
            ]
        }
    },
    "ENGLAND-GERMANY": {
        "S1902M": {
            "mentioned": [
                "austria"
            ],
            "start": {
                "GERMANY": [
                    "A TYR - PIE",
                    "F DEN H"
                ]
            },
            "end": {
                "GERMANY": [
                    "A TYR - VIE",
                    "F DEN - NTH"
                ]
            },
            "messages": [
                "ENGLAND: What are your thoughts? I'm a bit worried about the fleet build in St. Petersburg, myself.",
                "ENGLAND: Also, I think Russia's going to take most of Austria. You might want to watch your back.",
                "GERMANY: That does look unfriendly, and I'm reconfiguring to deal with them.",
                "ENGLAND: Agreed. Any concrete ideas?",
                "ENGLAND: What are your plans for A Kiel?"
            ]
        },
        "F1906M": {
            "mentioned": [
                "edi",
                "france"
            ],
            "start": {
                "ENGLAND": [
                    "F EDI H"
                ]
            },
            "end": {
                "ENGLAND": [
                    "F EDI S F NWY - NTH"
                ]
            },
            "messages": [
                "ENGLAND: I'm going to hold in Edi again.",
                "ENGLAND: If France takes me out, they'll probably get a build, which will be bad for you."
            ]
        }
    },
    "FRANCE-GERMANY": {
        "S1902M": {
            "mentioned": [
                "bel",
                "bur"
            ],
            "start": {
                "FRANCE": [
                    "A BUR H",
                    "A SPA - MAR",
                    "F MAR - LYO"
                ],
                "GERMANY": [
                    "A TYR - PIE",
                    "F DEN H"
                ]
            },
            "end": {
                "FRANCE": [
                    "A BUR - BEL",
                    "A SPA - GAS",
                    "F MAR - SPA/SC"
                ],
                "GERMANY": [
                    "A TYR - VIE",
                    "F DEN - NTH"
                ]
            },
            "messages": [
                "FRANCE: Hi Germany, what do you think of what's going on in the east? It seems like a couple more years of this and RT is going to be at our doorstep.",
                "GERMANY: Looks to be trending that way.  I'm not sure my tactical subroutines are up to the task of stopping it unless we get our act together.  ",
                "GERMANY: I don't love you being in Bur, but...maybe instead of me continuing to develop we just pop Belgium now?  ",
                "FRANCE: what are your thoughts?",
                "GERMANY: I'm thinking I support Bur -> Bel, cover Ruh, you cover Pic, and we make some progress against the Replicants, striking a blow for humanity",
                "FRANCE: okay that works for me"
            ]
        },
        "F1902M": {
            "mentioned": [
                "bel",
                "pic"
            ],
            "start": {
                "GERMANY": [
                    "A HOL S A BUR - BEL",
                    "A SIL - GAL"
                ]
            },
            "end": {
                "GERMANY": [
                    "A HOL S A PIC - BEL",
                    "A SIL - MUN"
                ]
            },
            "messages": [
                "GERMANY: Dammit, time hit as I was changing the order.  This time it's in from the start",
                "FRANCE: Do you want to support Bur or Pic?",
                "GERMANY: The current order is to support Bur -> Bel, but I don't really have strong feelings either way.",
                "FRANCE: can you support Pic in? I'd like to keep Bur to shift down to Mar if necessary.",
                "GERMANY: Done"
            ]
        },
        "F1903M": {
            "mentioned": [
                "bel",
                "hol"
            ],
            "start": {
                "FRANCE": [
                    "A BEL S A KIE - HOL",
                    "F IRI - LVP"
                ]
            },
            "end": {
                "FRANCE": [
                    "A BEL - HOL",
                    "F IRI - WAL"
                ]
            },
            "messages": [
                "FRANCE: shifting Bur to Mar",
                "FRANCE: supporting Kie - Hol, unless you want to set up a bounce in Hol with HEL.",
                "GERMANY: Oh, a bounce would be super useful",
                "FRANCE: okay Bel-Hol",
                "GERMANY: Thank you."
            ]
        },
        "S1905M": {
            "mentioned": [
                "ven",
                "tyr",
                "italy"
            ],
            "start": {
                "GERMANY": [
                    "A TYR S A PIE - VEN"
                ]
            },
            "end": {
                "GERMANY": [
                    "A TYR - VEN"
                ]
            },
            "messages": [
                "GERMANY: Hopefully.  Initial placeholder order is Tyr s Pie -> Ven",
                "FRANCE: Italy had a little resurgence here. I doubt we'll be able to advance like that",
                "GERMANY: Agreed - I'm open to suggestion here.  We can only hope the East gets messier.",
                "FRANCE: I can support you to Ven. I'm hesitant to possibly move Pie forward",
                "GERMANY: *shrug*  I'm willing to try.  Order updated.",
                "FRANCE: maybe gains against R will open up scandi for you"
            ]
        },
        "F1905M": {
            "mentioned": [
                "yor",
                "lvp"
            ],
            "start": {
                "FRANCE": [
                    "A PIE H",
                    "F IRI H"
                ]
            },
            "end": {
                "FRANCE": [
                    "A PIE - MAR",
                    "F IRI S A YOR - LVP"
                ]
            },
            "messages": [
                "GERMANY: Ok, that had a high hilarity factor.  I'm ordered Yor -> Lvp",
                "FRANCE: Yeah that was odd",
                "GERMANY: I guess some of the moves _are_ actually connected to the discussion.  Interesting.",
                "GERMANY: I really didn't think the Russian would actually order the convoy, but I am hilariously pleased they did"
            ]
        },
        "S1906M": {
            "mentioned": [
                "nth"
            ],
            "start": {
                "FRANCE": [
                    "F WES - TYS"
                ],
                "GERMANY": [
                    "A KIE S A DEN",
                    "A MUN - BOH",
                    "A TYR S A MUN - BOH",
                    "F HEL S A DEN"
                ]
            },
            "end": {
                "FRANCE": [
                    "F WES H"
                ],
                "GERMANY": [
                    "A KIE - HOL",
                    "A MUN - SIL",
                    "A TYR - BOH",
                    "F HEL S F ENG - NTH"
                ]
            },
            "messages": [
                "FRANCE: Can you support me into NTH?",
                "FRANCE: or do you want support into NTH?",
                "FRANCE: I'd like to get into NTH otherwise I have a bit of a wasted fleet move trying to get down to the med.",
                "GERMANY: Hmm, I was actually thinking Lon -> Yor with support to grab Edi in the fall.  But your way works, too",
                "GERMANY: Ok, let's flesh this out - we bounce in Yor, I support you to Nth, so you can backfill?",
                "FRANCE: I don't think we need to bounce in Yor. If R retreats there it opens Nwy up.",
                "GERMANY: Ya know, that's an excellent point.  OK, let's do it.\n",
                "FRANCE: we need to get our units pushed towards the east.",
                "GERMANY: Updated"
            ]
        },
        "F1906M": {
            "mentioned": [
                "hol",
                "den",
                "lon",
                "ska",
                "yor"
            ],
            "start": {
                "FRANCE": [
                    "A LON H",
                    "F ENG H",
                    "F NTH - EDI"
                ],
                "GERMANY": [
                    "A BOH S A MUN - TYR",
                    "A HOL - DEN VIA",
                    "A KIE S A HOL - DEN",
                    "F HEL C A HOL - DEN"
                ]
            },
            "end": {
                "FRANCE": [
                    "A LON - YOR",
                    "F ENG - BEL",
                    "F NTH - SKA"
                ],
                "GERMANY": [
                    "A BOH - VIE",
                    "A HOL - RUH",
                    "A KIE S F HEL - DEN",
                    "F HEL - DEN"
                ]
            },
            "messages": [
                "FRANCE: indeed",
                "GERMANY: It would be most appreciated if you could cut Ska.  After that, Scandi is totally vulnerable",
                "FRANCE: oh i thought that fleet was in Swe. Yes I'll cut it for you, don't want you going down a build. We can clean up Edi next year. Lon-Yor.",
                "GERMANY: Perfect, thank you.  Yeah, he's flanked to hell as long as he doesn't get a build from Den, so lots of juicy rollup next turn",
                "FRANCE: you might want to retake it with the fleet so that you can keep armies close to the line and possibly push for War",
                "GERMANY: That's a great point - for some dumb reason I was convoying from Hol, but I no longer need a fleet on that side, do I?",
                "FRANCE: no you don't"
            ]
        },
        "S1907M": {
            "mentioned": [
                "edi",
                "bel",
                "nth",
                "ska",
                "yor"
            ],
            "start": {
                "FRANCE": [
                    "A PIE S A TYR - VEN",
                    "F BEL S F NTH",
                    "F NTH S A YOR - EDI"
                ],
                "GERMANY": [
                    "A LVP - EDI"
                ]
            },
            "end": {
                "FRANCE": [
                    "A PIE - TUS",
                    "F BEL - NTH",
                    "F NTH - SKA"
                ],
                "GERMANY": [
                    "A LVP S A YOR - EDI"
                ]
            },
            "messages": [
                "GERMANY: That's a fleet in Bel?  If so, I'm supporting Nth -> Ska, if you want to take it.  ",
                "FRANCE: yes fleet is in Bel. I guess that gives us play on Swe in the fall",
                "GERMANY: It's up to you - there's a ton of good plays here.  Just keep poking until something gets through :)",
                "FRANCE: we're almost done with the game though",
                "GERMANY: True.  And I'll take the decent showing for humanity.",
                "FRANCE: I'll go for ska, maybe we get lucky and pop it and then we have play on Swe.",
                "GERMANY: Oh, I'm sure you already realized Yor has to be the mover on Edi, right?  I'm supporting the move",
                "GERMANY: And, yeah, we're coming right down to the wire on time as well, not just turn count.  ",
                "FRANCE: yup, Yor-Edi. we end when it's spring '08"
            ]
        }
    },
    "FRANCE-ITALY": {
        "F1905M": {
            "mentioned": [
                "turkey"
            ],
            "start": {
                "FRANCE": [
                    "F IRI H"
                ],
                "ITALY": [
                    "A TYR S A VIE",
                    "A VEN - PIE",
                    "F TUN - WES",
                    "F TYS S F TUN - WES"
                ]
            },
            "end": {
                "FRANCE": [
                    "F IRI S A YOR - LVP"
                ],
                "ITALY": [
                    "A TYR - TRI",
                    "A VEN S A TYR - TRI",
                    "F TUN S F ALB - ION",
                    "F TYS - NAP"
                ]
            },
            "messages": [
                "FRANCE: okay lets stop fighting, Turkey is becoming a threat, you need to control the eastern part of the med.",
                "ITALY: Just so you know, Turkey isn't my ally. I needed to force you to make peace, so that I can stab Turkey when I get the chance.",
                "FRANCE: now is your chance. I'm going to pull back.",
                "ITALY: Will you let me do that?",
                "FRANCE: yes absolutely",
                "ITALY: Ok. I'm going to retake Wmed and Pie this turn, and then I will work with you. Is that ok?",
                "FRANCE: No that's not okay",
                "FRANCE: Don't move towards me. Don't take WES, it can't hurt you and keep PIE a DMZ.",
                "ITALY: Why?",
                "FRANCE: Because if you move towards me then that means you're not going to attack turkey, it means you're setting up to attack me.",
                "FRANCE: under no circumstances is it okay for you to move to WES and PIE."
            ]
        }
    },
    "FRANCE-RUSSIA": {
        "S1903M": {
            "mentioned": [
                "england"
            ],
            "start": {
                "RUSSIA": [
                    "F NWY - SWE"
                ]
            },
            "end": {
                "RUSSIA": [
                    "F NWY - SKA"
                ]
            },
            "messages": [
                "RUSSIA: You should try to convoy to Wales",
                "RUSSIA: England has too many fleets to protect their homeland"
            ]
        },
        "S1905M": {
            "mentioned": [
                "nth",
                "england"
            ],
            "start": {
                "FRANCE": [
                    "A BEL H"
                ],
                "RUSSIA": [
                    "A NWY - EDI VIA",
                    "F NTH C A NWY - EDI",
                    "F SWE H"
                ]
            },
            "end": {
                "FRANCE": [
                    "A BEL - BUR"
                ],
                "RUSSIA": [
                    "A NWY - SWE",
                    "F NTH C A HOL - YOR",
                    "F SWE - SKA"
                ]
            },
            "messages": [
                "FRANCE: Hi Russia, I'd love to help you in the med if you help me take English dots to get more fleets down there.",
                "RUSSIA: I need to deal with Turkey",
                "FRANCE: I agree. I can help in the med as long as you help me finish of England. Do we have a deal? I need fleets to help you in the med.",
                "RUSSIA: I can't help in England right now",
                "FRANCE: can you move NTH-Edi?"
            ]
        },
        "F1905M": {
            "mentioned": [
                "germany",
                "england"
            ],
            "start": {
                "FRANCE": [
                    "A PIE H",
                    "F IRI H"
                ],
                "RUSSIA": [
                    "A BUD - VIE",
                    "A GAL S A BUD - VIE",
                    "A SWE S A DEN",
                    "A UKR S F RUM - SEV",
                    "F NTH - EDI",
                    "F RUM - SEV",
                    "F SKA - NTH"
                ]
            },
            "end": {
                "FRANCE": [
                    "A PIE - MAR",
                    "F IRI S A YOR - LVP"
                ],
                "RUSSIA": [
                    "A BUD S F RUM",
                    "A GAL S F RUM",
                    "A SWE - DEN",
                    "A UKR S F RUM",
                    "F NTH S A SWE - DEN",
                    "F RUM H",
                    "F SKA S A SWE - DEN"
                ]
            },
            "messages": [
                "RUSSIA: Sorry, I didn't see this",
                "FRANCE: you said you can't help against England but then you convoyed Germany onto the island?",
                "RUSSIA: I did it because it was hilarious"
            ]
        }
    },
    "FRANCE-TURKEY": {
        "F1903M": {
            "mentioned": [
                "germany"
            ],
            "start": {
                "FRANCE": [
                    "A BEL S A KIE - HOL",
                    "F IRI - LVP"
                ]
            },
            "end": {
                "FRANCE": [
                    "A BEL - HOL",
                    "F IRI - WAL"
                ]
            },
            "messages": [
                "TURKEY: I think we need to start moving against Russia. They are getting too strong and are taking over centers up North.",
                "FRANCE: Yes I agree, how can I help?",
                "TURKEY: Well eventually a fleet in Marseilles would help, but for now just make sure you get as many centers up north as you can.",
                "FRANCE: sounds good",
                "TURKEY: Great. I don't want Russia to get too powerful right now.",
                "FRANCE: me neither",
                "TURKEY: Well you should make peace with England and Germany and then you and I can make a move.",
                "FRANCE: I need centers to make a move and they have to come from E or G really",
                "TURKEY: Well you should probably stop attacking England and take their centers."
            ]
        },
        "F1904M": {
            "mentioned": [
                "wes",
                "tun",
                "italy"
            ],
            "start": {
                "FRANCE": [
                    "F WES H"
                ],
                "TURKEY": [
                    "F ANK S F CON - BLA"
                ]
            },
            "end": {
                "FRANCE": [
                    "F WES - TUN"
                ],
                "TURKEY": [
                    "F ANK - ARM"
                ]
            },
            "messages": [
                "FRANCE: Looks like R beat you to it.",
                "FRANCE: can you support WES - Tun?",
                "TURKEY: No I need to help Italy.",
                "TURKEY: And it looks like you will get England's centers anyway.",
                "FRANCE: okay"
            ]
        },
        "S1905M": {
            "mentioned": [
                "russia"
            ],
            "start": {
                "TURKEY": [
                    "A RUM - SEV",
                    "A SER S A BUL - RUM",
                    "F ARM S A RUM - SEV",
                    "F BLA S A RUM - SEV",
                    "F ION S F NAP - TYS"
                ]
            },
            "end": {
                "TURKEY": [
                    "A RUM - UKR",
                    "A SER - BUD",
                    "F ARM - SEV",
                    "F BLA S F ARM - SEV",
                    "F ION H"
                ]
            },
            "messages": [
                "TURKEY: I'm sorry but I still have to support Italy or Russia will destroy me."
            ]
        }
    },
    "GERMANY-ITALY": {
        "S1902M": {
            "mentioned": [
                "austria",
                "vie"
            ],
            "start": {
                "GERMANY": [
                    "A TYR - PIE",
                    "F DEN H"
                ]
            },
            "end": {
                "GERMANY": [
                    "A TYR - VIE",
                    "F DEN - NTH"
                ]
            },
            "messages": [
                "ITALY: Do you think you're going to get a piece of Austria? I would obviously like Ven back",
                "GERMANY: I can only try and see what happens.",
                "ITALY: Well, if you take Vie, I can probably support you to Tri in the fall"
            ]
        }
    },
    "GERMANY-RUSSIA": {
        "S1902M": {
            "mentioned": [
                "england"
            ],
            "start": {
                "GERMANY": [
                    "A TYR - PIE",
                    "F DEN H"
                ],
                "RUSSIA": [
                    "A BUD S A RUM - SER",
                    "A RUM - SER"
                ]
            },
            "end": {
                "GERMANY": [
                    "A TYR - VIE",
                    "F DEN - NTH"
                ],
                "RUSSIA": [
                    "A BUD - VIE",
                    "A RUM - BUD"
                ]
            },
            "messages": [
                "RUSSIA: Oops, didn't see your message in time. However, I'd like to continue working together, since I think that we're set up for a good long term alliance",
                "RUSSIA: Thoughts?",
                "GERMANY: Quite the turn for you.  How would you like to turn that into momentum for us?",
                "RUSSIA: I'm thinking a continuation against England",
                "GERMANY: I'm there for that."
            ]
        },
        "F1902M": {
            "mentioned": [
                "sil"
            ],
            "start": {
                "GERMANY": [
                    "A SIL - GAL"
                ],
                "RUSSIA": [
                    "A RUM - BUD"
                ]
            },
            "end": {
                "GERMANY": [
                    "A SIL - MUN"
                ],
                "RUSSIA": [
                    "A RUM S A BUL - SER"
                ]
            },
            "messages": [
                "RUSSIA: Germany, don't do this",
                "GERMANY: I was nervous about where Warsaw was going, sorry.  ",
                "GERMANY: I'm going back now that I saw you were heading south",
                "RUSSIA: I still don't see why you'd want to move towards me in a major way",
                "GERMANY: I'm not - I was just covering in case you moved to Silesia.  Like I said, he's backing off now that I saw you aren't going that way."
            ]
        },
        "S1903M": {
            "mentioned": [
                "ska"
            ],
            "start": {
                "GERMANY": [
                    "A MUN - KIE",
                    "A RUH - HOL"
                ],
                "RUSSIA": [
                    "F NWY - SWE"
                ]
            },
            "end": {
                "GERMANY": [
                    "A MUN - SIL",
                    "A RUH - KIE"
                ],
                "RUSSIA": [
                    "F NWY - SKA"
                ]
            },
            "messages": [
                "RUSSIA: Is there anything we can work out? I'd prefer not to fight you",
                "GERMANY: I'm not interested in fighting you.  I'd love it if Sweden could pop Ska",
                "RUSSIA: I'm moving into Baltic Sea to do that this turn",
                "GERMANY: Baltic does not border Ska.  You can move there right now.",
                "GERMANY: Will today be a victory for humanity or skynet?"
            ]
        },
        "F1903M": {
            "mentioned": [
                "bal"
            ],
            "start": {
                "RUSSIA": [
                    "A WAR S A GAL - SIL",
                    "F BAL S F SKA - DEN",
                    "F SKA - DEN"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A WAR - PRU",
                    "F BAL S A WAR - PRU",
                    "F SKA - SWE"
                ]
            },
            "messages": [
                "RUSSIA: You should try to protect Holland from the English",
                "GERMANY: Yeah, thanks.  I'm very concerned about you being in Baltic."
            ]
        },
        "S1905M": {
            "mentioned": [
                "yor",
                "hol",
                "england"
            ],
            "start": {
                "GERMANY": [
                    "A TYR S A PIE - VEN"
                ],
                "RUSSIA": [
                    "A NWY - EDI VIA",
                    "F NTH C A NWY - EDI",
                    "F SWE H"
                ]
            },
            "end": {
                "GERMANY": [
                    "A TYR - VEN"
                ],
                "RUSSIA": [
                    "A NWY - SWE",
                    "F NTH C A HOL - YOR",
                    "F SWE - SKA"
                ]
            },
            "messages": [
                "GERMANY: It would be hilarious if you convoyed Hol -> Yor",
                "RUSSIA: I need your help against Turkey",
                "GERMANY: Sure thing!",
                "RUSSIA: It would",
                "RUSSIA: But France is getting too strong",
                "GERMANY: I put my half of the order in.  Hol -> Yor",
                "GERMANY: Then best not to let them have all of England, yes?",
                "RUSSIA: Thanks"
            ]
        },
        "S1906M": {
            "mentioned": [
                "france"
            ],
            "start": {
                "GERMANY": [
                    "A KIE S A DEN",
                    "A MUN - BOH",
                    "A TYR S A MUN - BOH",
                    "F HEL S A DEN"
                ],
                "RUSSIA": [
                    "A UKR - MOS"
                ]
            },
            "end": {
                "GERMANY": [
                    "A KIE - HOL",
                    "A MUN - SIL",
                    "A TYR - BOH",
                    "F HEL S F ENG - NTH"
                ],
                "RUSSIA": [
                    "A UKR - GAL"
                ]
            },
            "messages": [
                "RUSSIA: I thought you said you were going to help me against Turkey",
                "GERMANY: I'm trying to get there.",
                "RUSSIA: I guess that's not happening",
                "RUSSIA: Sorry",
                "GERMANY: I'm advancing as fast as I can - Italy is in the way",
                "RUSSIA: You should attack France",
                "GERMANY: Agreed",
                "RUSSIA: Good luck"
            ]
        },
        "S1907M": {
            "mentioned": [
                "france"
            ],
            "start": {
                "GERMANY": [
                    "A LVP - EDI"
                ],
                "RUSSIA": [
                    "A BOH - VIE",
                    "F NWY - NTH",
                    "F SKA S F NWY - NTH"
                ]
            },
            "end": {
                "GERMANY": [
                    "A LVP S A YOR - EDI"
                ],
                "RUSSIA": [
                    "F NWY S F SKA - NTH",
                    "F SKA - NTH"
                ]
            },
            "messages": [
                "RUSSIA: We can work together against France",
                "GERMANY: That's a great idea!"
            ]
        }
    },
    "GERMANY-TURKEY": {
        "F1906M": {
            "mentioned": [
                "vie"
            ],
            "start": {
                "GERMANY": [
                    "A BOH S A MUN - TYR",
                    "A HOL - DEN VIA",
                    "A KIE S A HOL - DEN",
                    "F HEL C A HOL - DEN"
                ],
                "TURKEY": [
                    "A BUL - SER",
                    "A RUM S A SER - BUD",
                    "A SER - BUD",
                    "F AEG - GRE",
                    "F SEV S A RUM"
                ]
            },
            "end": {
                "GERMANY": [
                    "A BOH - VIE",
                    "A HOL - RUH",
                    "A KIE S F HEL - DEN",
                    "F HEL - DEN"
                ],
                "TURKEY": [
                    "A BUL - GRE",
                    "A RUM - BUD",
                    "A SER S A RUM - BUD",
                    "F AEG - ION",
                    "F SEV - BLA"
                ]
            },
            "messages": [
                "TURKEY: Why are you not talking to me?",
                "GERMANY: Am I not talking to you?  I have been cutting Italian supports for you :)",
                "TURKEY: Can you attack Vienna this turn?",
                "GERMANY: yes"
            ]
        }
    }
}