{
    "AUSTRIA-RUSSIA": {
        "S1906M": {
            "mentioned": [
                "france",
                "italy"
            ],
            "start": {
                "AUSTRIA": [
                    "A BUD - TRI",
                    "A SER S A BUD - TRI",
                    "A VIE S A BUD - TRI"
                ],
                "RUSSIA": [
                    "A SEV - UKR"
                ]
            },
            "end": {
                "AUSTRIA": [
                    "A BUD S A SER",
                    "A SER H",
                    "A VIE S A BOH - TYR"
                ],
                "RUSSIA": [
                    "A SEV - MOS"
                ]
            },
            "messages": [
                "AUSTRIA: You need to start attacking France now",
                "RUSSIA: I'm working on it",
                "RUSSIA: If you wanted to support War -> Sil I wouldn't complain",
                "AUSTRIA: And Italy",
                "AUSTRIA: I have to move to Rumania"
            ]
        },
        "F1906M": {
            "mentioned": [
                "france"
            ],
            "start": {
                "RUSSIA": [
                    "A LVN S A MOS - STP",
                    "A SIL - MUN"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A LVN - PRU",
                    "A SIL S A LVN - PRU"
                ]
            },
            "messages": [
                "RUSSIA: OK.  Let me know if you need a support or cut somewhere.",
                "AUSTRIA: Just keep attacking France"
            ]
        },
        "F1907M": {
            "mentioned": [
                "france",
                "boh",
                "gal"
            ],
            "start": {
                "AUSTRIA": [
                    "A GAL - RUM"
                ]
            },
            "end": {
                "AUSTRIA": [
                    "A GAL - BOH"
                ]
            },
            "messages": [
                "AUSTRIA: Just keep moving to the Black Sea to keep him in check",
                "RUSSIA: Are you going to put some pressure on France?",
                "AUSTRIA: Yes. What should Galicia do",
                "RUSSIA: Either support War -> Sil or move to Boh, your choice.  \n"
            ]
        }
    },
    "AUSTRIA-TURKEY": {},
    "ENGLAND-RUSSIA": {
        "S1902M": {
            "mentioned": [
                "swe",
                "nwy"
            ],
            "start": {
                "RUSSIA": [
                    "F SWE H"
                ]
            },
            "end": {
                "RUSSIA": [
                    "F SWE S F NWY"
                ]
            },
            "messages": [
                "ENGLAND: Can you support hold Norway? I'll do the same to Sweden.",
                "ENGLAND: Agreed?",
                "RUSSIA: Agreed"
            ]
        },
        "F1903M": {
            "mentioned": [
                "swe"
            ],
            "start": {
                "ENGLAND": [
                    "F LON - ENG",
                    "F NTH S F LON - ENG",
                    "F NWY - NWG"
                ]
            },
            "end": {
                "ENGLAND": [
                    "F LON H",
                    "F NTH S F LON",
                    "F NWY S F SKA - SWE"
                ]
            },
            "messages": [
                "ENGLAND: What do you want to do about Sweden?",
                "RUSSIA: There's nothing I can do about it :)  As long as you leave it alone, I'll use the unit it feeds down south.  ",
                "ENGLAND: It will be difficult for me to stop taking it, though."
            ]
        },
        "S1904M": {
            "mentioned": [
                "swe"
            ],
            "start": {
                "ENGLAND": [
                    "F LON S F NWY - NTH",
                    "F NTH - DEN",
                    "F NWY - NTH",
                    "F SWE S F NTH - DEN"
                ]
            },
            "end": {
                "ENGLAND": [
                    "F LON - ENG",
                    "F NTH S F LON - ENG",
                    "F NWY S F SWE",
                    "F SWE S F NWY"
                ]
            },
            "messages": [
                "ENGLAND: Thoughts on how to stop the solo?",
                "ENGLAND: I'm going to have to hold Sweden for now."
            ]
        }
    },
    "ENGLAND-TURKEY": {},
    "FRANCE-RUSSIA": {},
    "FRANCE-TURKEY": {},
    "GERMANY-RUSSIA": {
        "S1902M": {
            "mentioned": [
                "swe"
            ],
            "start": {
                "RUSSIA": [
                    "A RUM S A WAR - GAL",
                    "F SWE H"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A RUM S A BUL",
                    "F SWE S F NWY"
                ]
            },
            "messages": [
                "RUSSIA: Any requests for Sweden or are you looking to pop it out?",
                "GERMANY: No, I'm not looking to pop it out"
            ]
        },
        "F1902M": {
            "mentioned": [
                "france"
            ],
            "start": {
                "GERMANY": [
                    "A KIE S A RUH - HOL",
                    "A RUH - HOL",
                    "F HEL S A RUH - HOL"
                ]
            },
            "end": {
                "GERMANY": [
                    "A KIE - HOL",
                    "A RUH - BEL",
                    "F HEL S A KIE - HOL"
                ]
            },
            "messages": [
                "GERMANY: I hope you're not going for Munich. That'd be the worst for you as I can throw my centres to France if you do",
                "RUSSIA: Ah, sorry, I should have given you a heads up - no, I'm not at all going for Munich.  Just flanking the Austrian.",
                "GERMANY: Well, if you are you better let him into Galicia so you can take Vienna",
                "RUSSIA: That's the plan :)",
                "GERMANY: Alright. Sounds good. Just please don't take Munich. France would get a big advantage out of that"
            ]
        },
        "S1905M": {
            "mentioned": [
                "stp"
            ],
            "start": {
                "RUSSIA": [
                    "A MOS - SEV",
                    "A WAR - GAL"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A MOS - STP",
                    "A WAR H"
                ]
            },
            "messages": [
                "GERMANY: I'm still willing to work with you against France if you're interested. I have nothing to gain from trying to take your centres and I'm sure you feel the same about my units as I do yours",
                "GERMANY: You should take St Petersburg with your army to show that you're interested",
                "RUSSIA: I very much wish to help you, yes.  That's why I was moving up to silesia",
                "RUSSIA: And, yes, I can move to StP",
                "GERMANY: Excellent. Try to work with Austria against Italy too. He's working with France, who is also a big threat",
                "GERMANY: We may be able to force a draw if we all work together against the other big powers",
                "RUSSIA: I am very much trying to work with Austria, even though they do not respond to me",
                "GERMANY: Well good luck. Hopefully you two are able to communicate better"
            ]
        },
        "F1906M": {
            "mentioned": [
                "france",
                "lvn",
                "pru"
            ],
            "start": {
                "RUSSIA": [
                    "A LVN S A MOS - STP",
                    "A SIL - MUN"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A LVN - PRU",
                    "A SIL S A LVN - PRU"
                ]
            },
            "messages": [
                "GERMANY: Good move. You should be able to take back St Petersburg now",
                "GERMANY: Also please stop attacking Italy. He's the only one of the big powers that we have a chance of stopping France with",
                "RUSSIA: I am not attacking Italy.",
                "GERMANY: Good. That's a start. You should be able to take St Petersburg this turn. You could also move Livonia to Prussia to be in a good position to take Berlin"
            ]
        }
    },
    "GERMANY-TURKEY": {},
    "ITALY-RUSSIA": {
        "F1901M": {
            "mentioned": [
                "gal",
                "war"
            ],
            "start": {
                "RUSSIA": [
                    "A WAR - SIL"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A WAR - GAL"
                ]
            },
            "messages": [
                "ITALY: Was the bounce in Galicia planned?",
                "ITALY: Also, if Austria is willing to support Ukraine into Rumania with Serbia, you can take it this turn and Galicia with Warsaw.",
                "RUSSIA: It was planned, yes.",
                "ITALY: Ok cool. So you and Austria are planning to take down Turkey then?",
                "RUSSIA: Not sure we've fully cemented plans yet, but I'm hoping it trends that way!",
                "ITALY: Ok, sounds good to me!",
                "ITALY: If you can keep Turkey out of Black Sea, it would be great. If not, that's totally fine too."
            ]
        },
        "S1903M": {
            "mentioned": [
                "austria"
            ],
            "start": {
                "ITALY": [
                    "A SMY - CON",
                    "F EAS - AEG",
                    "F ION S F EAS - AEG"
                ],
                "RUSSIA": [
                    "A UKR - MOS"
                ]
            },
            "end": {
                "ITALY": [
                    "A SMY - ANK",
                    "F EAS - SMY",
                    "F ION - GRE"
                ],
                "RUSSIA": [
                    "A UKR - GAL"
                ]
            },
            "messages": [
                "RUSSIA: Well-played.  ",
                "ITALY: Thanks. How do you want to deal with Austria now?",
                "ITALY: Also, are you worried at all about France?",
                "RUSSIA: I would love to deal with Austria.  Probe at will, I'll do my part from my side",
                "RUSSIA: And not really - we're not playing long enough for a solo threat, or for him to get close to either of us"
            ]
        },
        "S1904M": {
            "mentioned": [
                "bla"
            ],
            "start": {
                "RUSSIA": [
                    "A GAL - WAR",
                    "A UKR - MOS",
                    "F SEV H"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A GAL - SIL",
                    "A UKR - WAR",
                    "F SEV - BLA"
                ]
            },
            "messages": [
                "ITALY: You can take back Rumania now",
                "RUSSIA: Thanks, but I'm not that interested given the last turn.",
                "ITALY: Ok. Do you mind if I move to the Black Sea to help?",
                "RUSSIA: I do mind that very much, yes.",
                "ITALY: Ok. Austria thinks I'm still on his side for now, so if I move to the Black Sea, he won't suspect anything.",
                "ITALY: If you don't want that, we can work out another plan."
            ]
        },
        "F1904M": {
            "mentioned": [
                "austria"
            ],
            "start": {
                "ITALY": [
                    "A TYR S A BOH - VIE"
                ]
            },
            "end": {
                "ITALY": [
                    "A TYR S A VEN - TRI"
                ]
            },
            "messages": [
                "ITALY: Will you attack Rumania?",
                "ITALY: ?",
                "RUSSIA: Negative, Ghost Rider.  The pattern is full.",
                "ITALY: I'm trying to take Bulgaria. If you help me by cutting support, I can help you take back your centers next year.",
                "RUSSIA: Understood.  Taking Bulgaria does sound like a great thing to do.",
                "ITALY: So will you cut support?",
                "RUSSIA: Absolutely not.  Last time I tried to work with you you cut Bohemia instead of doing the moves where we both built.  ",
                "ITALY: Austria will fall quickly if we work together."
            ]
        },
        "S1905M": {
            "mentioned": [
                "austria",
                "tri",
                "vie"
            ],
            "start": {
                "ITALY": [
                    "A BOH - VIE",
                    "A TRI - ALB",
                    "A TYR S A VEN - TRI"
                ],
                "RUSSIA": [
                    "A MOS - SEV",
                    "A WAR - GAL"
                ]
            },
            "end": {
                "ITALY": [
                    "A BOH S A TRI - VIE",
                    "A TRI - VIE",
                    "A TYR S A TRI - VIE"
                ],
                "RUSSIA": [
                    "A MOS - STP",
                    "A WAR H"
                ]
            },
            "messages": [
                "ITALY: Why did you move to the Black Sea?",
                "RUSSIA: It is no longer true that Austria would fall quickly by us working together.  That was true when we were set up to take Vienna and Trieste, but you chose not to do that.  ",
                "ITALY: Yes, but it's better for both of us if Austria falls quickly."
            ]
        },
        "F1905M": {
            "mentioned": [
                "con"
            ],
            "start": {
                "ITALY": [
                    "F BUL/SC H"
                ]
            },
            "end": {
                "ITALY": [
                    "F BUL/SC - CON"
                ]
            },
            "messages": [
                "ITALY: You should try for Rumania.",
                "RUSSIA: That is an excellent suggestion!",
                "ITALY: You're not helping anyone by attacking Con.",
                "RUSSIA: Also an excellent point!  I shall not attack Con this turn.",
                "ITALY: Great!",
                "ITALY: You need the extra unit to defend yourself from France."
            ]
        },
        "F1906M": {
            "mentioned": [
                "france"
            ],
            "start": {
                "RUSSIA": [
                    "A LVN S A MOS - STP",
                    "A SIL - MUN"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A LVN - PRU",
                    "A SIL S A LVN - PRU"
                ]
            },
            "messages": [
                "ITALY: You should move Black Sea back to Sev.",
                "ITALY: Is that okay?",
                "RUSSIA: Yes, I'm planning to move to Sev",
                "ITALY: I might lose a center, so I would like to take Ankara.",
                "ITALY: Will you let me?",
                "RUSSIA: As long as you keep focused on France, you are welcome to retake Ank",
                "ITALY: Thank you. I promise I won't take another center from you."
            ]
        },
        "S1907M": {
            "mentioned": [
                "nwy",
                "england"
            ],
            "start": {
                "RUSSIA": [
                    "A STP - LVN"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A STP S F NWY"
                ]
            },
            "messages": [
                "ITALY: Let's bounce in Black Sea.",
                "RUSSIA: So ordered.",
                "ITALY: Can you help England hold Norway?",
                "ITALY: Do you think Austria and France are working together?"
            ]
        }
    },
    "ITALY-TURKEY": {
        "S1902M": {
            "mentioned": [
                "russia"
            ],
            "start": {
                "TURKEY": [
                    "A BUL H"
                ]
            },
            "end": {
                "TURKEY": [
                    "A BUL S A RUM"
                ]
            },
            "messages": [
                "ITALY: Sorry, I didn't mean to be coy about it lol. I'm pretty clearly going for the standard Lepanto.",
                "TURKEY: Yeah that's uh, what I said.",
                "ITALY: I know. I just felt bad that I was so blunt about it that I had to say it again. I wasn't trying to be mean.",
                "TURKEY: Nah it's fine. Just kinda boring and disappointing. Turkey always gets this treatment in the meta these days.",
                "ITALY: Yeah. I feel like Austria and Russia are super high variance and the same with Italy. It's just hard to work the press to get people to work with you.",
                "TURKEY: Yeah, the only constant is that Turkey gets screwed over.",
                "ITALY: Agreed. Are you working with Russia? If so, I might be able to help.",
                "TURKEY: As far as I know Russia's on my side, yeah.",
                "TURKEY: If you'd like to give me a cheeky support to Greece, that'd be rad, but no pressure.",
                "ITALY: Not this turn, but maybe in the fall."
            ]
        },
        "F1902M": {
            "mentioned": [
                "austria"
            ],
            "start": {
                "TURKEY": [
                    "F AEG S F CON - BUL/SC"
                ]
            },
            "end": {
                "TURKEY": [
                    "F AEG S F CON - BUL"
                ]
            },
            "messages": [
                "TURKEY: Well, I'm not surprised but I am disappointed.",
                "ITALY: If I hadn't realized that you and Russia are working together, I probably wouldn't have gone for the Lepanto.",
                "TURKEY: I doubt it.",
                "ITALY: Really? Russia told me he was working with you.",
                "TURKEY: No I mean I doubt that you wouldn't have done it",
                "ITALY: What would I have to do to convince you that I'm not actually trying to kill you?",
                "TURKEY: Go back in time by like, three seasons",
                "ITALY: I was actually planning on stabbing Austria until Russia told me you two were working together.",
                "TURKEY: Did they do that first turn?",
                "ITALY: Russia told me you two had been planning the juggernaut together since the first turn.",
                "TURKEY: Well they lied lol",
                "ITALY: Yeah. It seems like he might have just been trying to get me to stab Austria though.",
                "TURKEY: If he wanted that, he probably wouldn't have told you he was allying with me."
            ]
        },
        "S1903M": {
            "mentioned": [
                "smy",
                "con"
            ],
            "start": {
                "ITALY": [
                    "A SMY - CON",
                    "F EAS - AEG",
                    "F ION S F EAS - AEG"
                ],
                "TURKEY": [
                    "F CON - ANK"
                ]
            },
            "end": {
                "ITALY": [
                    "A SMY - ANK",
                    "F EAS - SMY",
                    "F ION - GRE"
                ],
                "TURKEY": [
                    "F CON - BLA"
                ]
            },
            "messages": [
                "TURKEY: I'm supporting SMY to CON.",
                "ITALY: Ok, I'll leave Smyrna if you move Con->Ank, Aeg->Con. Then I can support you to Bulgaria in the fall.",
                "TURKEY: No. I'm throwing to you, not being your Janissary.",
                "ITALY: What's a Janissary?",
                "TURKEY: Look it up"
            ]
        },
        "F1903M": {
            "mentioned": [
                "ion",
                "gre"
            ],
            "start": {
                "ITALY": [
                    "A TYR - MUN"
                ],
                "TURKEY": [
                    "F AEG S F SMY - CON"
                ]
            },
            "end": {
                "ITALY": [
                    "A TYR - BOH"
                ],
                "TURKEY": [
                    "F AEG S F ION - GRE"
                ]
            },
            "messages": [
                "TURKEY: I'm supporting SMY to CON again.",
                "TURKEY: I'll support ION to GRE too."
            ]
        }
    },
    "RUSSIA-TURKEY": {
        "F1901M": {
            "mentioned": [
                "con"
            ],
            "start": {
                "RUSSIA": [
                    "A WAR - SIL"
                ],
                "TURKEY": [
                    "F ANK - BLA"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A WAR - GAL"
                ],
                "TURKEY": [
                    "F ANK - CON"
                ]
            },
            "messages": [
                "TURKEY: So, would you like to bounce in the Black Sea?",
                "TURKEY: Woops, sent at the last second lol",
                "RUSSIA: No worries, we got there in the end.  I'm not moving back in this turn - taking the support instead",
                "TURKEY: Sounds like a plan, I'll move to CON",
                "TURKEY: With my fleet, I mean",
                "RUSSIA: Roger that.  Let's get some momentum going.",
                "RUSSIA: Also, sidenote, looks like Italy is our wannabe puppetmaster trying to set up schemes on everyone.",
                "TURKEY: Yeah, though he just boldfacedly told me he's gonna Lapanto so I don't know",
                "TURKEY: Regardless, the attack on Austria should probs go well.",
                "RUSSIA: That's funny, and fwiw he told me he was going to Lepanto as well.  Almost seemed like he was trying to pitch an AIR alliance.",
                "TURKEY: Austria and Italy seem to me like they're bots. They've both told me to my face that they're going to take hostile action against me which like, you shouldn't do.",
                "RUSSIA: That kind of behavior _is_ frowned upon in this establishment, yes\n",
                "TURKEY: It's just rude, frankly. Poor show."
            ]
        },
        "S1902M": {
            "mentioned": [
                "rum",
                "bul"
            ],
            "start": {
                "RUSSIA": [
                    "A RUM S A WAR - GAL",
                    "F SEV H",
                    "F SWE H"
                ],
                "TURKEY": [
                    "A BUL H"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A RUM S A BUL",
                    "F SEV S A RUM",
                    "F SWE S F NWY"
                ],
                "TURKEY": [
                    "A BUL S A RUM"
                ]
            },
            "messages": [
                "TURKEY: I think I'm screwed",
                "TURKEY: One problem with the AI that they're making here, it never strays from what the current meta is. Which involves Italy doing a Lapanto *every* time.",
                "RUSSIA: I mean, I can't say I've -never-  told someone to their face I was going to take something from them, but not at this point in the game, anyway.  Ah, well, it does help simplify plans if you're good with some good old-fashioned cylon-hunting",
                "TURKEY: Well, if RUM could support Bulgaria to hold that'd be grand, but otherwise I think I'm in trouble.",
                "RUSSIA: Oh, big screen is better - you have a fleet stuck in Ank.  Honestly, I think he's more likely to push on Rum, but I can spare the support if you think you need it.  Does that mean you're doing a wheel out to get the fleet to Con?",
                "TURKEY: Yes. Also I'm going to support RUM to hold with BUL so a mutual support might be called for.",
                "RUSSIA: Done"
            ]
        },
        "F1902M": {
            "mentioned": [
                "con"
            ],
            "start": {
                "TURKEY": [
                    "F AEG S F CON - BUL/SC"
                ]
            },
            "end": {
                "TURKEY": [
                    "F AEG S F CON - BUL"
                ]
            },
            "messages": [
                "RUSSIA: Supporting Con -> Bul(sc), btw.  ",
                "TURKEY: Excellent, that's the play I'm going for"
            ]
        }
    }
}