{
    "AUSTRIA-FRANCE": {
        "F1903M": {
            "mentioned": [
                "italy"
            ],
            "start": {
                "AUSTRIA": [
                    "A BUD S A RUM",
                    "A SER S A BUL",
                    "F GRE S F ALB - ION"
                ]
            },
            "end": {
                "AUSTRIA": [
                    "A BUD - TRI",
                    "A SER S A RUM",
                    "F GRE - AEG"
                ]
            },
            "messages": [
                "AUSTRIA: Ok nevermind I guess. Good luck",
                "FRANCE: I think I'm going to be moving against Germany.",
                "AUSTRIA: I have heard rumors that Italy will be moving against you after they take turkey. If you wanted to do a preemptive strike against Italy, I would be willing to help you out"
            ]
        },
        "F1904M": {
            "mentioned": [
                "italy"
            ],
            "start": {
                "AUSTRIA": [
                    "A BOH - MUN",
                    "A TRI - VEN",
                    "A TYR S A TRI - VEN",
                    "F ION - NAP"
                ]
            },
            "end": {
                "AUSTRIA": [
                    "A BOH - TYR",
                    "A TRI S A TYR - VEN",
                    "A TYR - VEN",
                    "F ION - TUN"
                ]
            },
            "messages": [
                "AUSTRIA: It looks like Italy is coming after you. If you can spare the army in Spain, we could work together against Italy",
                "FRANCE: That's the plan.",
                "AUSTRIA: I think I might be able to get a center off of Italy, and that will weaken Italy",
                "FRANCE: That'd be good",
                "AUSTRIA: If you build a fleet in Marseille after taking Liverpool, we could really coordinate our attacks on Italy",
                "AUSTRIA: Or if you need your army in Spain to go north, that is fine too, I just need you to build a fleet in Marseille this year"
            ]
        },
        "S1905M": {
            "mentioned": [
                "tun",
                "italy"
            ],
            "start": {
                "AUSTRIA": [
                    "F TUN - ION"
                ]
            },
            "end": {
                "AUSTRIA": [
                    "F TUN - TYS"
                ]
            },
            "messages": [
                "AUSTRIA: It looks like you are going to be moving back towards England. Are you also still planning to attack Italy?",
                "AUSTRIA: If so, I'm trying to figure out what to do with my fleet in Tunis",
                "FRANCE: Hit Rome"
            ]
        },
        "F1905M": {
            "mentioned": [
                "mun",
                "germany"
            ],
            "start": {
                "AUSTRIA": [
                    "A BOH - TYR",
                    "A BUL S F AEG - CON",
                    "A SER S A BUL",
                    "A TRI S A TYR - VEN",
                    "A TYR - VEN",
                    "F AEG - CON",
                    "F TUN - ION"
                ]
            },
            "end": {
                "AUSTRIA": [
                    "A BOH - MUN",
                    "A BUL - CON",
                    "A SER - BUL",
                    "A TRI - VEN",
                    "A TYR S A BOH - MUN",
                    "F AEG - SMY",
                    "F TUN - TYS"
                ]
            },
            "messages": [
                "AUSTRIA: Are you willing to try for Munich?",
                "AUSTRIA: It looks like Germany might be able to take Burgundy this turn, which could be really bad for you"
            ]
        }
    },
    "AUSTRIA-RUSSIA": {
        "S1902M": {
            "mentioned": [
                "gal",
                "sil"
            ],
            "start": {
                "RUSSIA": [
                    "A GAL S A RUM",
                    "A RUM S A GAL"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A GAL - SIL",
                    "A RUM H"
                ]
            },
            "messages": [
                "AUSTRIA: I don't think that was the wisest decision you could have made",
                "RUSSIA: I didn't see you say no need to bounce in Gal until the turn adjudicated.\n\nI'm worried about a triple.\n\nI doubt you believe me, so in a show of good faith, I'm supporting everything to hold except Sweden.",
                "RUSSIA: Germany just said he's taking Sweden, and I think he moved to Skag because I planted seeds in England's head about me moving to Bal instead of bouncing Sweden.\n\nIt's a triple.",
                "AUSTRIA: Also just out of curiosity, why did you choose to side with turkey over me?",
                "RUSSIA: I didn't. I truly moved to Gal thinking you'd bounce me.",
                "RUSSIA: Are you open to moving on Germany with me?",
                "RUSSIA: I suspect a move to Sil.",
                "RUSSIA: I suspect Italy is siding with the West as well.",
                "RUSSIA: I'm debating going to Sil myself."
            ]
        },
        "F1902M": {
            "mentioned": [
                "ukr",
                "turkey",
                "bul"
            ],
            "start": {
                "RUSSIA": [
                    "A RUM S A SER - BUL",
                    "F BLA S A RUM"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A RUM - UKR",
                    "F BLA S A SER - BUL"
                ]
            },
            "messages": [
                "AUSTRIA: I'll still be willing to work with you if you help me take Bulgaria",
                "RUSSIA: I am, but why the unsupported attack on Gal?",
                "AUSTRIA: I'm not too comfortable having the largest player in the east at my back",
                "RUSSIA: I'm about to lose Swe and be back at 5? I was also honest with you about my moves.",
                "AUSTRIA: My offer to work with you remains though. The offer to work with turkey doesn't seem to be that good for you",
                "RUSSIA: I can't let you take my centers or stay in Gal/Ukr.\n\nI am also open to working with you.",
                "AUSTRIA: If you agree to help me take Bulgaria I will agree not to take Warsaw",
                "RUSSIA: Will you move Gal back to Vie or move it to Boh if I support you to Bul and we DMZ Gal?",
                "AUSTRIA: Do we have a deal?",
                "RUSSIA: Yes."
            ]
        },
        "F1904M": {
            "mentioned": [
                "italy",
                "gal",
                "germany",
                "boh",
                "war"
            ],
            "start": {
                "AUSTRIA": [
                    "A BOH - MUN",
                    "A TRI - VEN",
                    "A TYR S A TRI - VEN",
                    "F ION - NAP"
                ],
                "RUSSIA": [
                    "A MOS S A WAR",
                    "A WAR S A BOH - SIL"
                ]
            },
            "end": {
                "AUSTRIA": [
                    "A BOH - TYR",
                    "A TRI S A TYR - VEN",
                    "A TYR - VEN",
                    "F ION - TUN"
                ],
                "RUSSIA": [
                    "A MOS - STP",
                    "A WAR S A GAL - SIL"
                ]
            },
            "messages": [
                "AUSTRIA: Looks like Germany is going after you",
                "RUSSIA: Yep, that's why I moved to Ukraine.\n\nHow do you want to handle our border? I am open to supporting Gal forward.",
                "RUSSIA: Or Boh",
                "AUSTRIA: I think I might be able to get a center off of Italy this turn, which would make it easier for me to send units north next year",
                "RUSSIA: Ok. Do you want any support from War?"
            ]
        },
        "S1905M": {
            "mentioned": [
                "italy"
            ],
            "start": {
                "AUSTRIA": [
                    "F TUN - ION"
                ],
                "RUSSIA": [
                    "A MOS - STP"
                ]
            },
            "end": {
                "AUSTRIA": [
                    "F TUN - TYS"
                ],
                "RUSSIA": [
                    "A MOS H"
                ]
            },
            "messages": [
                "RUSSIA: What's the plan",
                "AUSTRIA: I'm trying to figure out if I need to send my units north to fight Germany",
                "AUSTRIA: I may have to focus on Italy for the next little while though",
                "RUSSIA: Wait, why did you build A Bud?",
                "AUSTRIA: I will be moving Gal-rum and I'm not sure what to do with my armies in the north",
                "AUSTRIA: I could try to support myself into Silesia, but I'm not sure that's going to do a whole lot of good",
                "RUSSIA: Why would you move to Rum other than to attack me?",
                "AUSTRIA: Are you doing anything with Warsaw this turn?",
                "RUSSIA: Nope"
            ]
        },
        "F1905M": {
            "mentioned": [
                "mun",
                "con",
                "germany",
                "italy"
            ],
            "start": {
                "AUSTRIA": [
                    "A BOH - TYR",
                    "A BUL S F AEG - CON",
                    "A SER S A BUL",
                    "A TRI S A TYR - VEN",
                    "A TYR - VEN",
                    "F AEG - CON",
                    "F TUN - ION"
                ]
            },
            "end": {
                "AUSTRIA": [
                    "A BOH - MUN",
                    "A BUL - CON",
                    "A SER - BUL",
                    "A TRI - VEN",
                    "A TYR S A BOH - MUN",
                    "F AEG - SMY",
                    "F TUN - TYS"
                ]
            },
            "messages": [
                "RUSSIA: Bounce?",
                "AUSTRIA: I'm not sure what you mean",
                "AUSTRIA: I'm going to see if I can work with France to take Munich, and I will also try to take Con",
                "RUSSIA: If you give Germany Warsaw by tapping ukraine, you're screwed. You don't have enough armies to hold that stalemate line, even if Italy sneaks Sev.",
                "AUSTRIA: Do you need my army in Rum to do anything?",
                "RUSSIA: bounce in Sev"
            ]
        }
    },
    "AUSTRIA-TURKEY": {
        "F1901M": {
            "mentioned": [
                "arm"
            ],
            "start": {
                "TURKEY": [
                    "A CON - ANK",
                    "F ARM - SEV"
                ]
            },
            "end": {
                "TURKEY": [
                    "A CON S A BUL",
                    "F ARM - ANK"
                ]
            },
            "messages": [
                "AUSTRIA: Nice move to Armenia!",
                "TURKEY: Thanks, I was having a little technical difficulty on my end so sorry about the non response",
                "TURKEY: I am good to move against Russia as it seems like they're pushing south towards me"
            ]
        },
        "S1902M": {
            "mentioned": [
                "bul"
            ],
            "start": {
                "TURKEY": [
                    "A CON - SMY"
                ]
            },
            "end": {
                "TURKEY": [
                    "A CON S A BUL"
                ]
            },
            "messages": [
                "AUSTRIA: I don't think working with Russia is your best move here",
                "TURKEY: What are your plans right now? You're pushed pretty far south so I don't have a lot to work with on that front",
                "AUSTRIA: You'll have a much easier time of it if you work with me",
                "AUSTRIA: I'd say a good split would be Rumania and Sevastopol for me, and Greece and Bulgaria for you",
                "TURKEY: That leaves me pretty boxed in with you breathing all over my neck, I'd rather be pushing north then west"
            ]
        },
        "F1902M": {
            "mentioned": [
                "bul"
            ],
            "start": {
                "TURKEY": [
                    "A BUL S F ANK - CON"
                ]
            },
            "end": {
                "TURKEY": [
                    "A BUL - GRE"
                ]
            },
            "messages": [
                "AUSTRIA: Well so much for the easier deal",
                "TURKEY: Me thinks there was never a deal on the table",
                "AUSTRIA: Do you honestly think you can defend Bulgaria from me and defend from Italy at the same time?",
                "TURKEY: No, but do you think you can defend all of your territories from me and Russia?",
                "TURKEY: You can push on me and then get stabbed by Italy and leave second, or you can back off and survive longer",
                "AUSTRIA: Also I don't really understand why you didn't offer anything in 1901",
                "TURKEY: That would be the technical difficulties"
            ]
        },
        "S1903M": {
            "mentioned": [
                "con"
            ],
            "start": {
                "TURKEY": [
                    "A SMY - GRE VIA",
                    "F AEG C A SMY - GRE",
                    "F CON S F AEG"
                ]
            },
            "end": {
                "TURKEY": [
                    "A SMY H",
                    "F AEG - CON",
                    "F CON - ANK"
                ]
            },
            "messages": [
                "AUSTRIA: I'm willing to hear you out if you have a proposal",
                "TURKEY: You move on italy and I will start moving on russia. when all is said and done I'd like SEV and MOS you can take the rest",
                "AUSTRIA: Also do you know what black sea is doing this turn?",
                "TURKEY: If truthful, supporting me in CON"
            ]
        },
        "F1903M": {
            "mentioned": [
                "arm",
                "italy"
            ],
            "start": {
                "AUSTRIA": [
                    "A BUD S A RUM",
                    "A SER S A BUL",
                    "F GRE S F ALB - ION"
                ],
                "TURKEY": [
                    "F ANK H",
                    "F CON H"
                ]
            },
            "end": {
                "AUSTRIA": [
                    "A BUD - TRI",
                    "A SER S A RUM",
                    "F GRE - AEG"
                ],
                "TURKEY": [
                    "F ANK - ARM",
                    "F CON - BUL/SC"
                ]
            },
            "messages": [
                "AUSTRIA: I'm sorry Italy did that to you. I will be taking the Ionian sea this turn though so I think they will have to defend themselves",
                "TURKEY: that would be wonderful if you would cut them off",
                "AUSTRIA: It might be a good idea for you to cut Armenia in case Italy tries to support Sevastopol to hold",
                "AUSTRIA: I have no interest in giving Italy more centers so I'll tell you the same thing I told them- if I think it is in my interest to help you hold on a little longer I will"
            ]
        },
        "F1904M": {
            "mentioned": [
                "italy"
            ],
            "start": {
                "AUSTRIA": [
                    "A BOH - MUN",
                    "A TRI - VEN",
                    "A TYR S A TRI - VEN",
                    "F ION - NAP"
                ]
            },
            "end": {
                "AUSTRIA": [
                    "A BOH - TYR",
                    "A TRI S A TYR - VEN",
                    "A TYR - VEN",
                    "F ION - TUN"
                ]
            },
            "messages": [
                "AUSTRIA: If you want to stay in the game a little longer, we could coordinate",
                "AUSTRIA: If you cut ankara, I can take Smyrna and that will prevent Italy from building this turn",
                "TURKEY: How about I cut off communications with you since you're a big mean fibber?"
            ]
        }
    },
    "ENGLAND-FRANCE": {
        "S1905M": {
            "mentioned": [
                "eng",
                "mao"
            ],
            "start": {
                "ENGLAND": [
                    "A WAL - BRE VIA",
                    "F ENG C A WAL - BRE"
                ]
            },
            "end": {
                "ENGLAND": [
                    "A WAL - LON",
                    "F ENG - MAO"
                ]
            },
            "messages": [
                "ENGLAND: This is your chance to get my centers before Germany does! Don't worry about defending yourself, though. Your two fleets are enough to stop me from going anywhere.",
                "ENGLAND: For example, MAO - Bre, Pic - Bre guarantees that you can defend everything against me, and leaves Brest open to build a fleet.",
                "ENGLAND: I can help you. I have a fleet in the Channel that you need to use."
            ]
        }
    },
    "ENGLAND-RUSSIA": {
        "S1903M": {
            "mentioned": [
                "turkey",
                "austria"
            ],
            "start": {
                "RUSSIA": [
                    "F BLA S A UKR - RUM"
                ]
            },
            "end": {
                "RUSSIA": [
                    "F BLA S F AEG - BUL/SC"
                ]
            },
            "messages": [
                "ENGLAND: Do you have any idea what you're doing?",
                "ENGLAND: Attacking Germany doesn't make any sense when you're being attacked by Austria.",
                "RUSSIA: Germany was going to take a center from me no matter what. Germany isn't going to have the capacity to do any meaningful damage to me. I figured it was better to take something for a year on the off chance Austria reversed course, which I knew was unlikely.\n\nTurkey has mis-ordered and didn't speak for a turn. I can't fight Austria and Germany on my own with a lame Turkey, so I took a risk I thought I'd lose."
            ]
        },
        "S1904M": {
            "mentioned": [
                "war"
            ],
            "start": {
                "RUSSIA": [
                    "A MOS - LVN",
                    "A WAR - SIL"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A MOS S A WAR",
                    "A WAR H"
                ]
            },
            "messages": [
                "ENGLAND: I'm trying to convince everyone that they should be fighting Austria instead of you. But that's difficult. I'll try to talk to Germany, maybe you can talk to Italy, but there's not much we can do to help each other directly.",
                "ENGLAND: It'd be great if you can convince Germany to convoy that army back to Germany so that he can send it south.",
                "RUSSIA: Yeah, I don't know why Austria is still hitting me. Germany is the bigger threat IMO.",
                "RUSSIA: Yeah, I don't see that happening, as awesome as it would be.",
                "ENGLAND: There's a chance that Austria might support Germany into Warsaw. That would be bad. I don't know why he would, but it's a possibility."
            ]
        },
        "F1905M": {
            "mentioned": [
                "war"
            ],
            "start": {
                "RUSSIA": [
                    "A WAR S A SIL - GAL"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A WAR H"
                ]
            },
            "messages": [
                "ENGLAND: I have a feeling that you're going to lose Warsaw.",
                "RUSSIA: Or Sev.",
                "ENGLAND: In fact, if you try to move out of Warsaw, you're almost certain to lose it."
            ]
        }
    },
    "ENGLAND-TURKEY": {
        "S1902M": {
            "mentioned": [
                "russia"
            ],
            "start": {
                "ENGLAND": [
                    "A NWY H"
                ]
            },
            "end": {
                "ENGLAND": [
                    "A NWY S A DEN - SWE"
                ]
            },
            "messages": [
                "ENGLAND: Any idea if you're up against a Lepanto? I'd love to see you and Austria work together against Russia!",
                "ENGLAND: I have already encouraged Austria to move against Russia; I think you two could take Rumania this year!",
                "TURKEY: I'm hearing different things from both of them so I'm still trying to figure out which is being more truthful"
            ]
        },
        "F1903M": {
            "mentioned": [
                "austria"
            ],
            "start": {
                "TURKEY": [
                    "F ANK H",
                    "F CON H"
                ]
            },
            "end": {
                "TURKEY": [
                    "F ANK - ARM",
                    "F CON - BUL/SC"
                ]
            },
            "messages": [
                "ENGLAND: You should consider making a deal with Russia. Otherwise you're both dead.",
                "TURKEY: Yeah, I'm trying but Russia likes thinking Austria is working with them and then getting double crossed",
                "ENGLAND: I mean, the Austrian player is a pretty good player."
            ]
        },
        "S1904M": {
            "mentioned": [
                "russia"
            ],
            "start": {
                "TURKEY": [
                    "F ANK - CON"
                ]
            },
            "end": {
                "TURKEY": [
                    "F ANK - BLA"
                ]
            },
            "messages": [
                "ENGLAND: Well, it's probably too late for you now. But if you can convince Italy to move west now, it will help all of us. Otherwise Austria is going to run over you and Russia while everyone else fights with each other.",
                "ENGLAND: He should have taken Con with Aegean, so he could have moved his other fleet to Ionian.",
                "TURKEY: I don't think I could convince that pasta pirate to do anything. He's a rat.",
                "ENGLAND: Oh wait. You kept the fleet. This is good news."
            ]
        }
    },
    "FRANCE-GERMANY": {
        "F1902M": {
            "mentioned": [
                "den",
                "kie",
                "nwy"
            ],
            "start": {
                "FRANCE": [
                    "A SPA H"
                ],
                "GERMANY": [
                    "A SWE S F SKA - DEN",
                    "F DEN - BAL",
                    "F SKA - DEN"
                ]
            },
            "end": {
                "FRANCE": [
                    "A SPA - POR"
                ],
                "GERMANY": [
                    "A SWE S F SKA - NWY",
                    "F DEN - KIE",
                    "F SKA - NWY"
                ]
            },
            "messages": [
                "FRANCE: PIC is going to be convoying to Wales now.",
                "GERMANY: Well, that didn't go too poorly. I don't know if you want to convoy Picardy to Wales, or move English Channel to Irish Sea. I'll do my best to take Norway, although it's possible that I'll lose Berlin to Russia.",
                "GERMANY: Also: I'm planning to move Hol -> Kiel, Kiel -> Mun, and Den -> Kiel, which defends against both possible attacks. Can I help you with your moves? If I can offer a support-move, please let me know. For example, if you want to move to North Sea, I can probably offer support with Denmark.",
                "FRANCE: I'm moving to North Sea yes, so your support would be greatly appreciated."
            ]
        },
        "S1903M": {
            "mentioned": [
                "england"
            ],
            "start": {
                "FRANCE": [
                    "A GAS H"
                ],
                "GERMANY": [
                    "F NWY S F DEN - NTH"
                ]
            },
            "end": {
                "FRANCE": [
                    "A GAS - BRE"
                ],
                "GERMANY": [
                    "F NWY - NTH"
                ]
            },
            "messages": [
                "GERMANY: This turn, I'm planning to move to Berlin and North Sea, and to attack Silesia. I will also move Sweden -> Finland, to prepare to attack St. Petersburg.",
                "FRANCE: Sounds like a plan! I'm going to be maneuvering to try and take the Isles. Going to Irish Sea.",
                "FRANCE: England's really desperate to get me to attack you.",
                "GERMANY: After England falls, can we agree to keep Burgundy and Ruhr empty?",
                "FRANCE: Of course"
            ]
        },
        "S1904M": {
            "mentioned": [
                "mun"
            ],
            "start": {
                "FRANCE": [
                    "A POR H"
                ],
                "GERMANY": [
                    "A HOL H",
                    "A MUN H"
                ]
            },
            "end": {
                "FRANCE": [
                    "A POR - SPA"
                ],
                "GERMANY": [
                    "A HOL - RUH",
                    "A MUN - RUH"
                ]
            },
            "messages": [
                "GERMANY: I'm going to take the North Sea this turn.\n\nI'd appreciate it if you moved out of Burgundy, and towards Italy or England.",
                "GERMANY: Do you want me to do something with Munich?",
                "FRANCE: TYR would be useful."
            ]
        },
        "F1904M": {
            "mentioned": [
                "austria"
            ],
            "start": {
                "GERMANY": [
                    "A DEN - EDI VIA",
                    "A HOL H",
                    "A MUN S A SIL",
                    "A PRU - LVN",
                    "A SIL S A MUN",
                    "A STP S A PRU - LVN",
                    "F NTH C A DEN - EDI"
                ]
            },
            "end": {
                "GERMANY": [
                    "A DEN - BEL VIA",
                    "A HOL S A DEN - BEL",
                    "A MUN - BUR",
                    "A PRU - WAR",
                    "A SIL - BOH",
                    "A STP - MOS",
                    "F NTH C A DEN - BEL"
                ]
            },
            "messages": [
                "GERMANY: If you keep attacking me, Austria is going to get most of my centers.",
                "GERMANY: We need to re-establish our border as a DMZ.",
                "GERMANY: Italy is going to attack you, and you need to defend against them.",
                "FRANCE: I don't have a lot of options here."
            ]
        }
    },
    "FRANCE-ITALY": {
        "F1902M": {
            "mentioned": [
                "spa",
                "por"
            ],
            "start": {
                "FRANCE": [
                    "A SPA H"
                ],
                "ITALY": [
                    "A TUN - SMY VIA",
                    "F EAS C A TUN - SMY",
                    "F ION C A TUN - SMY"
                ]
            },
            "end": {
                "FRANCE": [
                    "A SPA - POR"
                ],
                "ITALY": [
                    "A TUN - SYR VIA",
                    "F EAS C A TUN - SYR",
                    "F ION C A TUN - SYR"
                ]
            },
            "messages": [
                "ITALY: Thanks for moving against England. Best of luck!",
                "ITALY: I'm a little nervous about the armies in Marseilles and Spain. I hope we can keep up the DMZ in Piedmont through the end of this year, but I'd also be more comfortable if you could move A Spain out. Do you think that's reasonable?",
                "FRANCE: The DMZ remains on. I'll move Spain to Portugal."
            ]
        },
        "S1904M": {
            "mentioned": [
                "spa",
                "por"
            ],
            "start": {
                "FRANCE": [
                    "A POR H"
                ],
                "ITALY": [
                    "A ROM - TUS",
                    "A SMY - ANK",
                    "F CON S A SMY - ANK"
                ]
            },
            "end": {
                "FRANCE": [
                    "A POR - SPA"
                ],
                "ITALY": [
                    "A ROM - VEN",
                    "A SMY S F CON - ANK",
                    "F CON - ANK"
                ]
            },
            "messages": [
                "FRANCE: The Austrians just sold you out.",
                "ITALY: Yeah, it's not great. Looks like you and Germany are about to fight too.",
                "FRANCE: Yep",
                "ITALY: You may need to move A Por -> Spain this turn. I don't think I can spare F Naples to defend Tunis this year.",
                "FRANCE: Fair"
            ]
        }
    },
    "FRANCE-RUSSIA": {},
    "FRANCE-TURKEY": {},
    "GERMANY-RUSSIA": {
        "F1901M": {
            "mentioned": [
                "swe"
            ],
            "start": {
                "RUSSIA": [
                    "F BOT - BAL"
                ]
            },
            "end": {
                "RUSSIA": [
                    "F BOT - SWE"
                ]
            },
            "messages": [
                "GERMANY: That's an interesting move from Turkey.",
                "RUSSIA: That's one way to put it.",
                "RUSSIA: What are your thoughts on the west? Are we bouncing Swe?",
                "GERMANY: I think we can get along without bouncing Sweden. I'm going to move to Ska this turn, to prevent England from attacking you."
            ]
        },
        "S1902M": {
            "mentioned": [
                "sil"
            ],
            "start": {
                "RUSSIA": [
                    "A GAL S A RUM",
                    "A RUM S A GAL"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A GAL - SIL",
                    "A RUM H"
                ]
            },
            "messages": [
                "GERMANY: Just an FYI: I'm going to attack Sweden. I'd appreciate your moving Sweden to Norway, but I also understand if you don't want to do that.",
                "GERMANY: To be clear, I just want to say that I don't want war with you, and that I hope you don't attack me. If you agree to the Norway attack, I won't attack you after I take Sweden.",
                "RUSSIA: Why partake in the Triple?\n\nYou can force the north sea this year",
                "RUSSIA: England is totally out of position if you and France pivot.\n",
                "GERMANY: The reason I want to take Sweden now is that England thinks we're fighting. If I wait until next year, he won't trust me, and we won't be able to attack Norway together. I also need to make it look like I'm fighting you, to ensure that France doesn't attack me.",
                "RUSSIA: France has been the most honest person on this board. Why would France care if you were at war with me positionally?\n\nYou're making me think I need to cover Sil."
            ]
        },
        "F1902M": {
            "mentioned": [
                "austria",
                "nwy"
            ],
            "start": {
                "GERMANY": [
                    "A SWE S F SKA - DEN",
                    "F DEN - BAL",
                    "F SKA - DEN"
                ],
                "RUSSIA": [
                    "A RUM S A SER - BUL",
                    "F BLA S A RUM"
                ]
            },
            "end": {
                "GERMANY": [
                    "A SWE S F SKA - NWY",
                    "F DEN - KIE",
                    "F SKA - NWY"
                ],
                "RUSSIA": [
                    "A RUM - UKR",
                    "F BLA S A SER - BUL"
                ]
            },
            "messages": [
                "GERMANY: Let me know if you want to discuss strategy. My suggestion: you should move Silesia back to Warsaw, to defend against Austria. Then you can support-hold St. Petersburg with Moscow, and I can attack Norway.",
                "GERMANY: What are you planning to do with the fleet in Baltic Sea?",
                "RUSSIA: I'm supporting you to Norway, but I can't go down a center here. How do we resolve that?"
            ]
        },
        "S1903M": {
            "mentioned": [
                "austria"
            ],
            "start": {
                "GERMANY": [
                    "F NWY S F DEN - NTH"
                ],
                "RUSSIA": [
                    "F BLA S A UKR - RUM"
                ]
            },
            "end": {
                "GERMANY": [
                    "F NWY - NTH"
                ],
                "RUSSIA": [
                    "F BLA S F AEG - BUL/SC"
                ]
            },
            "messages": [
                "GERMANY: Austria is growing really quickly. Do you have a plan for how to deal with that?",
                "RUSSIA: I figure if Austria grows fast enough, you're the next on the Austrian's list so pulling F Ber to get you positioned that direction was the best bet.",
                "RUSSIA: If you move A Swe - Fin you can bounce A War out of StP.",
                "RUSSIA: Well A War retreats to Liv"
            ]
        },
        "F1903M": {
            "mentioned": [
                "gal",
                "austria",
                "ber",
                "war"
            ],
            "start": {
                "GERMANY": [
                    "A BER S A SIL - PRU",
                    "A SIL - PRU"
                ],
                "RUSSIA": [
                    "A WAR H"
                ]
            },
            "end": {
                "GERMANY": [
                    "A BER H",
                    "A SIL S A WAR"
                ],
                "RUSSIA": [
                    "A WAR S A SIL - GAL"
                ]
            },
            "messages": [
                "RUSSIA: I humbly request you don't take StP this year. It'll be there later if you need it. I can't defend it, but I could use the unit.\n\nAlso, if you want support into Gal, you have it.",
                "GERMANY: I'm sorry that I have to do this, but I will support-hold Warsaw this turn. Austria is a larger threat than you are.",
                "RUSSIA: Even without taking StP, you'll get a build from Ber, which if you put in Munich is likely to bounce in Trie next year, meaning A Kie would hit traffic and be useless.",
                "RUSSIA: If you take Gal, you can sneak some momentum",
                "RUSSIA: If you sent something after my message on Gal, I didn't get it.",
                "GERMANY: After this turn, I should be able to attack Austria more directly.",
                "RUSSIA: Ok. I still think it's a mistake to leave StP open. Your build in Kie won't go anywhere.",
                "RUSSIA: Austria is also about to hit italy. look at those fleets."
            ]
        },
        "S1904M": {
            "mentioned": [
                "war",
                "mos"
            ],
            "start": {
                "GERMANY": [
                    "A HOL H",
                    "A MUN H"
                ],
                "RUSSIA": [
                    "A MOS - UKR",
                    "A WAR - SIL"
                ]
            },
            "end": {
                "GERMANY": [
                    "A HOL - RUH",
                    "A MUN - RUH"
                ],
                "RUSSIA": [
                    "A MOS S A WAR",
                    "A WAR H"
                ]
            },
            "messages": [
                "GERMANY: You should support Moscow -> Ukraine, to get into a better position to attack Rumania.",
                "GERMANY: I'm going to move into a position to take Warsaw in the fall.",
                "RUSSIA: You've got an army in StP and are poised to move on either me or Austria. Why would I do that?",
                "GERMANY: You should also convince Italy to help you against Austria."
            ]
        },
        "F1904M": {
            "mentioned": [
                "austria"
            ],
            "start": {
                "GERMANY": [
                    "A DEN - EDI VIA",
                    "A HOL H",
                    "A MUN S A SIL",
                    "A PRU - LVN",
                    "A SIL S A MUN",
                    "A STP S A PRU - LVN",
                    "F NTH C A DEN - EDI"
                ],
                "RUSSIA": [
                    "A MOS S A WAR"
                ]
            },
            "end": {
                "GERMANY": [
                    "A DEN - BEL VIA",
                    "A HOL S A DEN - BEL",
                    "A MUN - BUR",
                    "A PRU - WAR",
                    "A SIL - BOH",
                    "A STP - MOS",
                    "F NTH C A DEN - BEL"
                ],
                "RUSSIA": [
                    "A MOS - STP"
                ]
            },
            "messages": [
                "GERMANY: I am now willing to attack Austria.",
                "GERMANY: You should also do Ukraine -> Sevastopol, to protect against Turkey.",
                "RUSSIA: Turkey is blameless in this game and Turkey knows that if I lose Sev, I lose everything and he eventually dies anyway."
            ]
        },
        "S1905M": {
            "mentioned": [
                "mos"
            ],
            "start": {
                "RUSSIA": [
                    "A MOS S A WAR"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A MOS H"
                ]
            },
            "messages": [
                "GERMANY: Why are you helping Austria?",
                "RUSSIA: Because you're trying to kill me and Austria can't fight that many fronts.",
                "GERMANY: Austria is the largest power, and is going to become even larger if you help them attack me.",
                "RUSSIA: Germany 9\nAustria 8",
                "RUSSIA: Plus Austria has 2 boats that can't hurt me and is at war on the western, northwestern, and southeastern fronts.",
                "RUSSIA: If you vacate StP, I won't take it this year, or maybe ever.",
                "RUSSIA: By vacate, I mean to Fin or Nrwy.\n\nI don't want to fight anyone. I just want to poke my serfs with a stick.",
                "RUSSIA: A Bud has me scared.",
                "RUSSIA: Will you agree to move A StP to Finland?",
                "RUSSIA: In exchange for me leaving it alone this turn and moving south next turn?",
                "RUSSIA: I've got A Mos Hold entered.\n\nPlease enter A StP Fin"
            ]
        },
        "F1905M": {
            "mentioned": [
                "war"
            ],
            "start": {
                "RUSSIA": [
                    "A WAR S A SIL - GAL"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A WAR H"
                ]
            },
            "messages": [
                "RUSSIA: You've got support to Gal if you want it.",
                "GERMANY: I am going to attack Warsaw this turn, to prevent you from using it to help Austria.",
                "RUSSIA: A War S A Sil - Gal\nA Pru - Sil\nA War hold\nA StP - Fin\nI move to Sev with support",
                "RUSSIA: I don't want to fight Austria. I don't trust Austria. I don't trust Italy.",
                "RUSSIA: I am unable to take anything from you that I could actually hold.\n\nWe should work together.",
                "GERMANY: You should move Moscow -> Sevastopol, to protect yourself from Italy.",
                "RUSSIA: You shouldn't work with Austria. That's a losing strategy."
            ]
        }
    },
    "GERMANY-TURKEY": {
        "F1901M": {
            "mentioned": [
                "arm"
            ],
            "start": {
                "TURKEY": [
                    "A CON - ANK",
                    "F ARM - SEV"
                ]
            },
            "end": {
                "TURKEY": [
                    "A CON S A BUL",
                    "F ARM - ANK"
                ]
            },
            "messages": [
                "GERMANY: Nice move to Armenia! That's amazing.",
                "TURKEY: So if russia and austria ally you also want me to ally with austria?\n",
                "GERMANY: Not necessarily. We don't want Austria growing too much, but if we can get him fighting Russia, that's the preferred alliance."
            ]
        },
        "S1903M": {
            "mentioned": [
                "smy",
                "aeg"
            ],
            "start": {
                "GERMANY": [
                    "F NWY S F DEN - NTH"
                ],
                "TURKEY": [
                    "A SMY - GRE VIA",
                    "F AEG C A SMY - GRE",
                    "F CON S F AEG"
                ]
            },
            "end": {
                "GERMANY": [
                    "F NWY - NTH"
                ],
                "TURKEY": [
                    "A SMY H",
                    "F AEG - CON",
                    "F CON - ANK"
                ]
            },
            "messages": [
                "TURKEY: Russia definitely is working austria now, so if there was ever a time to attack them it would be now",
                "GERMANY: I'm going to start putting pressure on Austria soon. You should be able to survive if you can make a deal with Italy.",
                "GERMANY: My suggestion for your moves would be to move Smyrna to Armenia, and Aegean Sea to Smyrna.",
                "TURKEY: Yeah, I'm trying but they're not biting"
            ]
        },
        "F1903M": {
            "mentioned": [
                "arm",
                "con",
                "italy"
            ],
            "start": {
                "GERMANY": [
                    "A BER S A SIL - PRU",
                    "A SIL - PRU"
                ],
                "TURKEY": [
                    "F ANK H",
                    "F CON H"
                ]
            },
            "end": {
                "GERMANY": [
                    "A BER H",
                    "A SIL S A WAR"
                ],
                "TURKEY": [
                    "F ANK - ARM",
                    "F CON - BUL/SC"
                ]
            },
            "messages": [
                "GERMANY: Make sure to move Constantinople -> Smyrna, to bounce Italy, if he attacks Smyrna.",
                "TURKEY: Thanks for the heads up",
                "GERMANY: You could also do Smyrna -> Armenia, Constantinople -> Smyrna."
            ]
        },
        "F1904M": {
            "mentioned": [
                "russia"
            ],
            "start": {
                "GERMANY": [
                    "A DEN - EDI VIA",
                    "A HOL H",
                    "A MUN S A SIL",
                    "A PRU - LVN",
                    "A SIL S A MUN",
                    "A STP S A PRU - LVN",
                    "F NTH C A DEN - EDI"
                ]
            },
            "end": {
                "GERMANY": [
                    "A DEN - BEL VIA",
                    "A HOL S A DEN - BEL",
                    "A MUN - BUR",
                    "A PRU - WAR",
                    "A SIL - BOH",
                    "A STP - MOS",
                    "F NTH C A DEN - BEL"
                ]
            },
            "messages": [
                "GERMANY: You should try to take Rumania or Bulgaria this turn.",
                "TURKEY: I think I'm going for SEV, seems easier",
                "GERMANY: You should try to take Rumania.",
                "GERMANY: You should also ask Russia to do Ukraine -> Sevastopol, to help you."
            ]
        }
    },
    "ITALY-RUSSIA": {
        "S1902M": {
            "mentioned": [
                "gal"
            ],
            "start": {
                "RUSSIA": [
                    "A GAL S A RUM",
                    "A RUM S A GAL"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A GAL - SIL",
                    "A RUM H"
                ]
            },
            "messages": [
                "ITALY: Looks like you and Austria have come to an agreement - do you plan on staying in Galicia?",
                "RUSSIA: I'm supporting it to hold. I'm worried about a western triple.",
                "RUSSIA: Germany just said he's taking Sweden and he moved to Skag because I planted seeds in England's head about me moving to Bal instead of bouncing Sweden.\n\nIt's a triple.",
                "ITALY: I am a little worried about a western triple as well. For what it's worth, I've tried to talk France into attacking England, which I hope will take some pressure off you in the north.",
                "RUSSIA: Can you talk to Austria about it? We need to pressure Mun.",
                "ITALY: Can you confirm that you're staying in Galicia at least through this turn?",
                "RUSSIA: Why?"
            ]
        },
        "F1902M": {
            "mentioned": [
                "rum",
                "austria"
            ],
            "start": {
                "ITALY": [
                    "A TUN - SMY VIA",
                    "F EAS C A TUN - SMY",
                    "F ION C A TUN - SMY"
                ],
                "RUSSIA": [
                    "A RUM S A SER - BUL",
                    "F BLA S A RUM"
                ]
            },
            "end": {
                "ITALY": [
                    "A TUN - SYR VIA",
                    "F EAS C A TUN - SYR",
                    "F ION C A TUN - SYR"
                ],
                "RUSSIA": [
                    "A RUM - UKR",
                    "F BLA S A SER - BUL"
                ]
            },
            "messages": [
                "ITALY: I guess that answers that question. Good luck in the north.",
                "ITALY: Are you going for Munich? I'm a little worried about a France - Germany alliance, which would be bad for both of us.",
                "RUSSIA: That would put me out of position to defend against Austria. I need to cover War.",
                "ITALY: It looks like you're probably losing one of Warsaw or Rumania this turn. Any idea which one?"
            ]
        },
        "S1903M": {
            "mentioned": [
                "turkey",
                "austria"
            ],
            "start": {
                "RUSSIA": [
                    "F BLA S A UKR - RUM"
                ]
            },
            "end": {
                "RUSSIA": [
                    "F BLA S F AEG - BUL/SC"
                ]
            },
            "messages": [
                "ITALY: Why did you destroy A St. Petersburg?",
                "RUSSIA: I suspect you're feeding my moves to other players, and you're really far behind Austria and France.\n\nYou need to move on Austria or you're going to get swallowed up by the French once England dies.\n\nI pulled StP because I either get a Germany fleet up there or a turn to breathe, and I'm not interested in just holding StP.",
                "ITALY: Anyway, I agree that Austria is in danger of becoming very powerful. I'm hoping to get some more builds in Turkey to be able to move against them more effectively.",
                "RUSSIA: I think you should do both."
            ]
        },
        "F1903M": {
            "mentioned": [
                "austria"
            ],
            "start": {
                "ITALY": [
                    "A VEN - PIE"
                ],
                "RUSSIA": [
                    "A WAR H"
                ]
            },
            "end": {
                "ITALY": [
                    "A VEN H"
                ],
                "RUSSIA": [
                    "A WAR S A SIL - GAL"
                ]
            },
            "messages": [
                "RUSSIA: Pssst. Trie is open.",
                "ITALY: I think I might move into Piedmont to defend myself. I'm not going to stab Austria while I'm vulnerable to France.",
                "RUSSIA: There's an army in Mar, he can't build a fleet there. You could get multiple builds here.",
                "RUSSIA: I get it though. Please don't help Austria into Sev. though. That'd push him really far over the edge.",
                "RUSSIA: Austria has two fleets as well. You're going to lose Ion.",
                "ITALY: Alright, Austria is helping me into Con this turn. I'm not going to help Austria get Sev.",
                "RUSSIA: Why is there a fleet in Albania if not to force Ionian?"
            ]
        },
        "S1904M": {
            "mentioned": [
                "ank",
                "turkey",
                "con",
                "austria"
            ],
            "start": {
                "ITALY": [
                    "A ROM - TUS",
                    "A SMY - ANK",
                    "F CON S A SMY - ANK"
                ],
                "RUSSIA": [
                    "A MOS H",
                    "A SEV H"
                ]
            },
            "end": {
                "ITALY": [
                    "A ROM - VEN",
                    "A SMY S F CON - ANK",
                    "F CON - ANK"
                ],
                "RUSSIA": [
                    "A MOS S A WAR",
                    "A SEV - UKR"
                ]
            },
            "messages": [
                "RUSSIA: Any chance you're ready to turn on Austria?",
                "ITALY: Yeah, I think I have to.",
                "RUSSIA: Will you leave Turkey alone so that he can pressure Austria from Black?",
                "ITALY: I'll leave the Black Sea alone, but I'm going to take Ankara from Turkey.",
                "RUSSIA: Why? You're at risk of losing Con and Tun."
            ]
        },
        "F1904M": {
            "mentioned": [
                "austria",
                "germany"
            ],
            "start": {
                "RUSSIA": [
                    "A MOS S A WAR",
                    "A WAR S A BOH - SIL"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A MOS - STP",
                    "A WAR S A GAL - SIL"
                ]
            },
            "messages": [
                "ITALY: Hmm, looks like Austria stabbed me, which means I need to fight Austria more now. I was really hoping Germany would move against Austria.",
                "RUSSIA: Are you open to letting Turkey support A Ank to Con?",
                "ITALY: I'll let Turkey keep Ankara if they take Rumania or Bulgaria this turn.",
                "ITALY: I think the best move for me is:\nA Pie S A Ven H\nA Ven H\nF Tyr -> Nap\nF Eastern Med -> Smyrna\nA Smyrna -> Constantinople\nF Ankara S A Smyrna -> Constantinople"
            ]
        }
    },
    "ITALY-TURKEY": {
        "F1901M": {
            "mentioned": [
                "arm"
            ],
            "start": {
                "TURKEY": [
                    "A CON - ANK",
                    "F ARM - SEV"
                ]
            },
            "end": {
                "TURKEY": [
                    "A CON S A BUL",
                    "F ARM - ANK"
                ]
            },
            "messages": [
                "ITALY: Looks like you're going after Russia. I'd love to help, but there's not a ton I can do to help in 1901 haha",
                "TURKEY: Had some tech difficulties. Russia proposed bouncing in black, but it seems like he's been telling everyone he's going to open south so I don't know how truthful he's being.\n",
                "ITALY: Sorry to hear about the tech difficulties! Glad to see you opened to Armenia though."
            ]
        },
        "F1902M": {
            "mentioned": [
                "eas"
            ],
            "start": {
                "ITALY": [
                    "A TUN - SMY VIA",
                    "F EAS C A TUN - SMY",
                    "F ION C A TUN - SMY"
                ],
                "TURKEY": [
                    "A BUL S F ANK - CON"
                ]
            },
            "end": {
                "ITALY": [
                    "A TUN - SYR VIA",
                    "F EAS C A TUN - SYR",
                    "F ION C A TUN - SYR"
                ],
                "TURKEY": [
                    "A BUL - GRE"
                ]
            },
            "messages": [
                "TURKEY: Interesting attempt to avoid conflict between us",
                "ITALY: Sorry about the move to the Eastern Med. It was not at all what I meant to do.",
                "TURKEY: Meant to move AEG then?",
                "ITALY: Obviously I'm coming for you right now, but I'm open to changing plans if we can find a mutually beneficial way forward."
            ]
        },
        "S1904M": {
            "mentioned": [
                "russia",
                "ank",
                "bla"
            ],
            "start": {
                "ITALY": [
                    "A ROM - TUS",
                    "A SMY - ANK",
                    "F CON S A SMY - ANK"
                ],
                "TURKEY": [
                    "F ANK - CON"
                ]
            },
            "end": {
                "ITALY": [
                    "A ROM - VEN",
                    "A SMY S F CON - ANK",
                    "F CON - ANK"
                ],
                "TURKEY": [
                    "F ANK - BLA"
                ]
            },
            "messages": [
                "TURKEY: Nah, we aint even dating no way I'm putting a ring on it.",
                "ITALY: Sorry, I guess I wasn't actually interested in your proposal.",
                "TURKEY: That may be the first truthful thing that has come out of your mouth. I hope all of your marinara is over salted",
                "ITALY: Although if you move to the Black Sea this turn, I won't take Ankara this year.",
                "TURKEY: Okay I'm moving to Black, but Russia said you were going for ANK"
            ]
        }
    },
    "RUSSIA-TURKEY": {
        "F1901M": {
            "mentioned": [
                "ank",
                "arm"
            ],
            "start": {
                "RUSSIA": [
                    "A UKR S F BLA - RUM",
                    "F BLA - RUM"
                ],
                "TURKEY": [
                    "A CON - ANK",
                    "F ARM - SEV"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A UKR - RUM",
                    "F BLA S A UKR - RUM"
                ],
                "TURKEY": [
                    "A CON S A BUL",
                    "F ARM - ANK"
                ]
            },
            "messages": [
                "TURKEY: Sorry was having some tech difficulties to start so I missed that message",
                "RUSSIA: What' up with the fleet in Arm?",
                "TURKEY: Mobile device moves, didn't want to stall out and was trying to figure everything out",
                "TURKEY: What are your thoughts in the east?",
                "TURKEY: Sorry the west*\n",
                "RUSSIA: I don't know. Maybe a triple.",
                "RUSSIA: We need to tlak about Ank.",
                "TURKEY: Still a bit frazzled from my run to my computer. Germany and Austria seem like they are trying to encourage me to attack you or at least contain you",
                "RUSSIA: Please cover Ank",
                "RUSSIA: You need to get to Smyrna",
                "RUSSIA: England and Austria seem like they hate me?",
                "TURKEY: Yeah, I'm moving back to cover it now"
            ]
        },
        "S1902M": {
            "mentioned": [
                "rum"
            ],
            "start": {
                "RUSSIA": [
                    "A GAL S A RUM",
                    "A RUM S A GAL"
                ],
                "TURKEY": [
                    "A CON - SMY"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A GAL - SIL",
                    "A RUM H"
                ],
                "TURKEY": [
                    "A CON S A BUL"
                ]
            },
            "messages": [
                "TURKEY: What is your plan for your fleet in BLA? I'm trying to move my fleets south to help push into Austria, but I would like to know you're not going to try anything on me while I do that?",
                "RUSSIA: Supporting Rum to hold. I don't need more enemies with England and Austria.",
                "TURKEY: Yeah england was thinking of attacking you if I was, seems they must have made other friends that main them feel confident in that move.",
                "RUSSIA: I'm almost positive it's a triple."
            ]
        },
        "F1902M": {
            "mentioned": [
                "rum",
                "bul",
                "austria"
            ],
            "start": {
                "RUSSIA": [
                    "A RUM S A SER - BUL",
                    "F BLA S A RUM"
                ],
                "TURKEY": [
                    "A BUL S F ANK - CON"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A RUM - UKR",
                    "F BLA S A SER - BUL"
                ],
                "TURKEY": [
                    "A BUL - GRE"
                ]
            },
            "messages": [
                "TURKEY: I'm getting surrounded by these fellows down south, anyway we can punch into austria to try to create some pressure?",
                "TURKEY: I'm trying to secure my seas down here, but I could use BUL to support you in RUM if you would like to make a push?",
                "RUSSIA: I can't push with Rum, Trie will cover it."
            ]
        },
        "S1903M": {
            "mentioned": [
                "bul",
                "austria",
                "aeg"
            ],
            "start": {
                "RUSSIA": [
                    "F BLA S A UKR - RUM"
                ],
                "TURKEY": [
                    "A SMY - GRE VIA",
                    "F AEG C A SMY - GRE",
                    "F CON S F AEG"
                ]
            },
            "end": {
                "RUSSIA": [
                    "F BLA S F AEG - BUL/SC"
                ],
                "TURKEY": [
                    "A SMY H",
                    "F AEG - CON",
                    "F CON - ANK"
                ]
            },
            "messages": [
                "TURKEY: And so the triple becomes a quadruple",
                "RUSSIA: Want me to support F Aeg to Bul?",
                "RUSSIA: Austria is a dirty liar."
            ]
        },
        "F1903M": {
            "mentioned": [
                "austria"
            ],
            "start": {
                "RUSSIA": [
                    "A WAR H"
                ],
                "TURKEY": [
                    "F ANK H",
                    "F CON H"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A WAR S A SIL - GAL"
                ],
                "TURKEY": [
                    "F ANK - ARM",
                    "F CON - BUL/SC"
                ]
            },
            "messages": [
                "RUSSIA: I screwed you. What can I do to help you? Anything?",
                "TURKEY: asked way too late for me to get that. Also that should have been obvious",
                "RUSSIA: I made a bad gamble. I haven't played press in a while...\n\nIs there anything I can do to help?",
                "TURKEY: Probably not, Austria says they're going to push ION and maybe take some pressure off of me",
                "TURKEY: So really it's try to survive to see if that's the case",
                "TURKEY: I don't see any way of pushing without leaving something else open, but I'm open to ideas",
                "RUSSIA: He's going to cut everything... I don't know what you can do other than try to cut it back."
            ]
        },
        "S1904M": {
            "mentioned": [
                "ank",
                "bla"
            ],
            "start": {
                "RUSSIA": [
                    "A MOS H",
                    "A SEV H"
                ],
                "TURKEY": [
                    "F ANK - CON"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A MOS S A WAR",
                    "A SEV - UKR"
                ],
                "TURKEY": [
                    "F ANK - BLA"
                ]
            },
            "messages": [
                "RUSSIA: Care to move to Black?",
                "TURKEY: You want me to just sacrifice my last unit for you?",
                "RUSSIA: No. I think the Italian might be willing to work with you because of F Ion, F Aeg",
                "TURKEY: True true, yeah I amenable to moving to Black",
                "RUSSIA: Italy said he's taking Ank...",
                "TURKEY: Yeah he said the opposite to me",
                "TURKEY: He's a rat"
            ]
        },
        "F1904M": {
            "mentioned": [
                "germany"
            ],
            "start": {
                "RUSSIA": [
                    "A MOS S A WAR"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A MOS - STP"
                ]
            },
            "messages": [
                "TURKEY: Now here's the question, do I go for SEV or RUM, can you disrupt GAL for me?",
                "TURKEY: BUL or RUM*",
                "RUSSIA: With a rat sized brain to boot.",
                "RUSSIA: Sev is mine and I'll crumble if I lose it.\n\nBul is also an option...",
                "TURKEY: Well that's what I was going for. Yeah I'm not sure between BUL and RUM\n",
                "RUSSIA: Anything from Italy?",
                "TURKEY: They want me to go for RUM or BUL spouting off about letting me keep ANK",
                "TURKEY: I think I'm going to tell them I'm going BUL since they'll probably tell Austria\n",
                "RUSSIA: Rum would be nice because I trust you, but it's also on an island.",
                "RUSSIA: Italy said something similar to me about you and bul and rum.",
                "TURKEY: Italy is a rat, and has been since the beginning",
                "TURKEY: I'm going RUM because I think it's less likely that Austria defends that one, then I can deal with the island situation next turn",
                "RUSSIA: Wtf is that army doing in Pie?\n\nItaly is playing like an extension of Austria with no regard for his own existence / foresight.",
                "RUSSIA: Ok. I'll stay quiet, though I think Austria might cover it with gal.",
                "TURKEY: Well I suspect austria/italy are bots so maybe they're a hivemind",
                "RUSSIA: Is there more than one bot?\n\nI pegged Germany as a bot."
            ]
        }
    }
}