{
    "AUSTRIA-FRANCE": {
        "S1902M": {
            "mentioned": [
                "boh",
                "vie"
            ],
            "start": {
                "AUSTRIA": [
                    "A VIE - TYR"
                ]
            },
            "end": {
                "AUSTRIA": [
                    "A VIE - BOH"
                ]
            },
            "messages": [
                "AUSTRIA: Oh whoops just saw this. Yup, went for the bounce",
                "FRANCE: Makes sense, no worries. Pretty sure Germany is a bot so we're taking it out",
                "AUSTRIA: I'm thinking of moving Tri-tyr and Vie-boh. If you're uncomfortable with that, lmk and I can do something else. Just didn't want to scare you by moving right next to Munich",
                "FRANCE: Would you be willing to assist with Germany? If so not uncomfortable at all"
            ]
        },
        "S1903M": {
            "mentioned": [
                "tus",
                "spa"
            ],
            "start": {
                "FRANCE": [
                    "A BEL S A PIC - BUR",
                    "A PIC - BUR",
                    "F TYS - NAP"
                ]
            },
            "end": {
                "FRANCE": [
                    "A BEL - RUH",
                    "A PIC - PAR",
                    "F TYS S A SPA - TUS"
                ]
            },
            "messages": [
                "AUSTRIA: Thanks for retreating into Prussia instead of Bohemia!",
                "AUSTRIA: Is there anything you want me to do to help?",
                "FRANCE: No problem! Would you support my Spain army into Tus?",
                "AUSTRIA: I would be happy to support you into Rome in the fall if you're down to work together. This turn I want to hold Ven, but next turn I'd be happy to support you"
            ]
        },
        "F1904M": {
            "mentioned": [
                "italy"
            ],
            "start": {
                "AUSTRIA": [
                    "A BUD S A GAL",
                    "A GAL H",
                    "A SER S F GRE",
                    "A VEN S A TUS - ROM"
                ]
            },
            "end": {
                "AUSTRIA": [
                    "A BUD S A GAL - RUM",
                    "A GAL - RUM",
                    "A SER S A GAL - RUM",
                    "A VEN S A ROM"
                ]
            },
            "messages": [
                "AUSTRIA: What's your plan for this turn?",
                "AUSTRIA: I'm willing to work with you against Italy",
                "FRANCE: No you aren't you're literally supporting them"
            ]
        }
    },
    "AUSTRIA-RUSSIA": {
        "S1905M": {
            "mentioned": [
                "turkey"
            ],
            "start": {
                "AUSTRIA": [
                    "A SER S F GRE",
                    "F ALB - ION",
                    "F GRE S F ALB - ION"
                ]
            },
            "end": {
                "AUSTRIA": [
                    "A SER S F GRE - BUL",
                    "F ALB - GRE",
                    "F GRE - BUL/SC"
                ]
            },
            "messages": [
                "AUSTRIA: Are you willing to work together against Turkey yet?",
                "AUSTRIA: I would much prefer to work with you than Turkey"
            ]
        },
        "S1906M": {
            "mentioned": [
                "germany",
                "swe"
            ],
            "start": {
                "RUSSIA": [
                    "A NWY S F FIN - SWE",
                    "F FIN - SWE"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A NWY - SWE",
                    "F FIN S A NWY - SWE"
                ]
            },
            "messages": [
                "AUSTRIA: I'm still willing to work with you to take down Turkey if you are. If you work with Turkey, you'll be left completely vulnerable to Germany. You should be working with me to help you take down Turkey",
                "AUSTRIA: After this turn, if you move to Black Sea and Armenia, you should be able to take Ankara from Turkey",
                "RUSSIA: sure, can you support me into BLA?",
                "AUSTRIA: You should also be able to take back Sweden this turn. Germany doesn't have enough units to defend it",
                "AUSTRIA: If you're interested in working with me, I can let you take Rumania back"
            ]
        },
        "F1906M": {
            "mentioned": [
                "rum",
                "war"
            ],
            "start": {
                "AUSTRIA": [
                    "A TRI - BUD"
                ],
                "RUSSIA": [
                    "A RUM H",
                    "A UKR S A RUM",
                    "A WAR - GAL"
                ]
            },
            "end": {
                "AUSTRIA": [
                    "A TRI - VIE"
                ],
                "RUSSIA": [
                    "A RUM - GAL",
                    "A UKR S A RUM - GAL",
                    "A WAR S A RUM - GAL"
                ]
            },
            "messages": [
                "AUSTRIA: You're not going to be able to hold Sweden, and Germany is going to take St. Petersburg. You really should stop working with Turkey and start working with me, or else you'll get completely destroyed by Germany and me",
                "RUSSIA: nyet, i'll never work with you lederhosen-wearing infidels!",
                "AUSTRIA: Once Germany takes St. Petersburg and Sweden from you, they'll be able to easily move against Moscow and Warsaw, and then they'll be able to take Sevastopol.",
                "AUSTRIA: You can't expect me to work with you when you continue to work against me",
                "AUSTRIA: You've already lost St. Petersburg and will likely lose Sweden this turn. If you continue to fight me, you'll be completely unable to defend yourself from Germany",
                "RUSSIA: I literally can't move into the Black Sea without a fleet",
                "AUSTRIA: If you work with me, I'll give you back Rumania"
            ]
        }
    },
    "AUSTRIA-TURKEY": {
        "S1904M": {
            "mentioned": [
                "rum",
                "gre"
            ],
            "start": {
                "TURKEY": [
                    "A BUL - SER",
                    "A CON - APU VIA",
                    "F AEG C A CON - APU",
                    "F ION C A CON - APU"
                ]
            },
            "end": {
                "TURKEY": [
                    "A BUL S A UKR - RUM",
                    "A CON S A BUL",
                    "F AEG S F ION - GRE",
                    "F ION - GRE"
                ]
            },
            "messages": [
                "AUSTRIA: Is there any way we can work together?",
                "TURKEY: Are you ok supporting me to Rumania?",
                "AUSTRIA: I'm not willing to support you into Rumania this turn, but I'd be happy to next turn if you show you're willing to work together",
                "TURKEY: Ok, let me know when. That is what I need. Otherwise I don't see how I can help",
                "AUSTRIA: Are you willing to not attack Greece?"
            ]
        },
        "F1904M": {
            "mentioned": [
                "russia",
                "rum",
                "italy"
            ],
            "start": {
                "AUSTRIA": [
                    "A BUD S A GAL",
                    "A GAL H",
                    "A SER S F GRE",
                    "A VEN S A TUS - ROM"
                ],
                "TURKEY": [
                    "F AEG S F ION - GRE",
                    "F ION - GRE"
                ]
            },
            "end": {
                "AUSTRIA": [
                    "A BUD S A GAL - RUM",
                    "A GAL - RUM",
                    "A SER S A GAL - RUM",
                    "A VEN S A ROM"
                ],
                "TURKEY": [
                    "F AEG - ION",
                    "F ION - NAP"
                ]
            },
            "messages": [
                "AUSTRIA: You should watch out for Russia. They can easily take one of your home supply centers this turn if they want to",
                "AUSTRIA: If you want to work together lmk. Otherwise I'll continue to defend myself",
                "TURKEY: I will not attack greece this turn. Please support Bulgaria to Rumania",
                "AUSTRIA: At the very least, I'd appreciate you not attacking Greece this turn",
                "AUSTRIA: If you don't want to work together, at least could you stop attacking me? I think we could both work together to take down Italy and Russia"
            ]
        },
        "S1905M": {
            "mentioned": [
                "bul"
            ],
            "start": {
                "AUSTRIA": [
                    "A SER S F GRE",
                    "F ALB - ION",
                    "F GRE S F ALB - ION"
                ]
            },
            "end": {
                "AUSTRIA": [
                    "A SER S F GRE - BUL",
                    "F ALB - GRE",
                    "F GRE - BUL/SC"
                ]
            },
            "messages": [
                "AUSTRIA: Are you willing to work together against Russia yet?",
                "AUSTRIA: I'm worried that if you continue to work with Russia, they will become too strong and eventually turn against you to fight back",
                "TURKEY: Agreed with you 100%. But the time was last turn. i needed you to support me to Rumania. I had Russia on side too. How do you propose we proceed?",
                "AUSTRIA: If you let me take Bulgaria, I'll support you into Rumania",
                "TURKEY: Sorry, no can do.",
                "TURKEY: Bulgaria is more important to me than Rumania. Sorry!",
                "AUSTRIA: I'd much rather you work with me against Russia than the other way around. If you work with Russia, they will just use you to get more territory and will eventually turn against you"
            ]
        },
        "F1906M": {
            "mentioned": [
                "tri"
            ],
            "start": {
                "AUSTRIA": [
                    "A TRI - BUD"
                ]
            },
            "end": {
                "AUSTRIA": [
                    "A TRI - VIE"
                ]
            },
            "messages": [
                "AUSTRIA: Are you willing to work with me yet? If you continue to work with Russia, Germany will easily defeat you later, once they're able to take out England and France",
                "AUSTRIA: You're a junior partner to Russia at this point, and Russia is in danger of being completely destroyed by Germany at this point.",
                "TURKEY: You need to let me destry your fleet in Bulgaria for us to work together. That fleet can only work against me",
                "AUSTRIA: If you help me retake Rumania, I'll disband my fleet next year",
                "AUSTRIA: I have no interest in continuing to fight you",
                "TURKEY: What do you want me to do?",
                "TURKEY: You can move Bul to Greece and Greece to Alb. You are leaving yourself open to an attack on Trieste",
                "TURKEY: Or just don't support Bulgaria. I will piff it this turn. But I can't help you without getting that build. "
            ]
        }
    },
    "ENGLAND-FRANCE": {
        "S1901M": {
            "mentioned": [
                "bre"
            ],
            "start": {
                "FRANCE": [
                    "F BRE - ENG"
                ]
            },
            "end": {
                "FRANCE": [
                    "F BRE - MAO"
                ]
            },
            "messages": [
                "ENGLAND: Hey France! Would you be interested in working together to sweep the board?",
                "FRANCE: Sounds like a great plan to me! Did you have any thoughts on how we should get started?",
                "ENGLAND: I think DMZ in English Channel is a must. And ideally for us, no fleet builds in Brest or Liverpool.",
                "FRANCE: I like both of those. Would you be interested in bouncing in the ENG to start the first round or just making it a DMZ from the get go?",
                "FRANCE: Also has Germany messaged you?",
                "ENGLAND: What have you heard from Germany? They asked for a classic alliance against Russia.",
                "ENGLAND: Should we include them and then stab or exclude them?",
                "ENGLAND: We can also form a western triple with Germany.",
                "FRANCE: They want me to take on you with them. I can cut him off or play dumb up to you. I'd prefer you as an ally though.",
                "ENGLAND: What do you think?",
                "FRANCE: I'd prefer to exclude but I still need to talk to Italy. Hearing rumors that they are trying to push Turkey with Austria",
                "ENGLAND: What are your plans for your armies? I plan on opening to North and Norwegian.",
                "ENGLAND: France?",
                "FRANCE: I was thinking Bur and Spa but I need to talk to Italy"
            ]
        },
        "S1902M": {
            "mentioned": [
                "fin",
                "nwy"
            ],
            "start": {
                "ENGLAND": [
                    "A NWY - STP"
                ]
            },
            "end": {
                "ENGLAND": [
                    "A NWY - FIN"
                ]
            },
            "messages": [
                "ENGLAND: Nice work taking Munich.",
                "ENGLAND: We should definitely keep working together against Germany.",
                "FRANCE: Thanks, I wanted to talk to you about it but hadn't heard back from you. I agree we should take out Germany",
                "FRANCE: Is there anything we need to coordinate?",
                "ENGLAND: What are you planning to do with A Munich?",
                "FRANCE: I think its in trouble, I was just going to hold and expect a retreat",
                "FRANCE: Do you have any thoughts?",
                "ENGLAND: I'm thinking of moving A Norway-finland and F North Sea to Ska.",
                "FRANCE: Okay so moving on Russia as well"
            ]
        },
        "F1902M": {
            "mentioned": [
                "hol"
            ],
            "start": {
                "ENGLAND": [
                    "A NWY - STP",
                    "F BAR S A NWY - STP",
                    "F NTH - SKA"
                ]
            },
            "end": {
                "ENGLAND": [
                    "A NWY H",
                    "F BAR S A NWY",
                    "F NTH - HOL"
                ]
            },
            "messages": [
                "ENGLAND: I'm planning to move F North Sea-holland and F Edi-north Sea.",
                "FRANCE: Sounds good, are you going after Russia?",
                "ENGLAND: Are you going to move A Silesia to Munich or Warsaw?",
                "FRANCE: I was moving it to Munich why?"
            ]
        },
        "S1903M": {
            "mentioned": [
                "hel",
                "pic",
                "bel"
            ],
            "start": {
                "ENGLAND": [
                    "F NTH - SKA"
                ],
                "FRANCE": [
                    "A BEL S A PIC - BUR",
                    "A PIC - BUR",
                    "F TYS - NAP"
                ]
            },
            "end": {
                "ENGLAND": [
                    "F NTH - HEL"
                ],
                "FRANCE": [
                    "A BEL - RUH",
                    "A PIC - PAR",
                    "F TYS S A SPA - TUS"
                ]
            },
            "messages": [
                "ENGLAND: I'm going to try to move F North Sea to Ska.",
                "ENGLAND: What are you planning to do with A Prussia?",
                "FRANCE: Sounds good, I'm going to move to Berlin",
                "FRANCE: Can I support you into Holland?\n",
                "ENGLAND: Actually, I'm going to move F North Sea-hel.",
                "ENGLAND: Also, you should move A Pic-bur with support from A Bel."
            ]
        },
        "F1904M": {
            "mentioned": [
                "fin",
                "nwy",
                "nth",
                "bur",
                "germany",
                "par"
            ],
            "start": {
                "ENGLAND": [
                    "A FIN - STP",
                    "F BAR S A FIN - STP",
                    "F NTH - NWY"
                ],
                "FRANCE": [
                    "A PAR H"
                ]
            },
            "end": {
                "ENGLAND": [
                    "A FIN S F BAR - NWY",
                    "F BAR - NWY",
                    "F NTH S F BAR - NWY"
                ],
                "FRANCE": [
                    "A PAR - BUR"
                ]
            },
            "messages": [
                "FRANCE: You should support Finland into StP this turn with your fleet",
                "FRANCE: And you should move Nth into Den",
                "ENGLAND: I need to take back Norway.",
                "ENGLAND: I can't afford to lose a unit.",
                "FRANCE: You still have Norway",
                "ENGLAND: I think that you should move A Paris-burgundy to cut support from Burgundy so that Germany can't take Belgium.",
                "FRANCE: Den and StP would gain you two builds",
                "FRANCE: Yeah i agree",
                "FRANCE: Take Denmark and St Petersburg!\n"
            ]
        }
    },
    "ENGLAND-RUSSIA": {
        "S1902M": {
            "mentioned": [
                "stp"
            ],
            "start": {
                "ENGLAND": [
                    "A NWY - STP"
                ],
                "RUSSIA": [
                    "A MOS - LVN",
                    "A STP H"
                ]
            },
            "end": {
                "ENGLAND": [
                    "A NWY - FIN"
                ],
                "RUSSIA": [
                    "A MOS - STP",
                    "A STP - FIN"
                ]
            },
            "messages": [
                "ENGLAND: Russia, I'm not sure why you built an army in Stp.",
                "ENGLAND: It will make it more difficult for us to work together.",
                "RUSSIA: Sorry, I'm a little bad at the interface",
                "RUSSIA: what's your plans for germany?",
                "ENGLAND: What are you planning to do with A Stp?",
                "ENGLAND: Hello?"
            ]
        },
        "S1904M": {
            "mentioned": [
                "nwy"
            ],
            "start": {
                "ENGLAND": [
                    "F BAR - STP/NC"
                ]
            },
            "end": {
                "ENGLAND": [
                    "F BAR - NWY"
                ]
            },
            "messages": [
                "ENGLAND: I'm still going to support myself to hold in Norway.",
                "ENGLAND: You should give up on Norway and try to take some other supply center.",
                "RUSSIA: okay bot",
                "ENGLAND: I want to work with you but you are not communicating with me.",
                "ENGLAND: If you don't start communicating, I will just keep supporting myself to hold in Norway.",
                "ENGLAND: You should at least tell me that you are going to attack me so that I can stop wasting my time."
            ]
        },
        "F1904M": {
            "mentioned": [
                "nwy"
            ],
            "start": {
                "ENGLAND": [
                    "A FIN - STP",
                    "F BAR S A FIN - STP",
                    "F NTH - NWY"
                ]
            },
            "end": {
                "ENGLAND": [
                    "A FIN S F BAR - NWY",
                    "F BAR - NWY",
                    "F NTH S F BAR - NWY"
                ]
            },
            "messages": [
                "ENGLAND: You should move back to St Petersburg. I will take Norway.",
                "ENGLAND: You are just wasting your time by attacking me.",
                "ENGLAND: Are you going to move A Norway back to St. Petersburg?"
            ]
        },
        "F1905M": {
            "mentioned": [
                "germany",
                "swe"
            ],
            "start": {
                "ENGLAND": [
                    "A FIN - NWY",
                    "F NWG S A FIN - NWY"
                ]
            },
            "end": {
                "ENGLAND": [
                    "A FIN S A DEN - SWE",
                    "F NWG - EDI"
                ]
            },
            "messages": [
                "ENGLAND: I'm not going to be able to work with you if you aren't going to respond to my messages.",
                "ENGLAND: It's no fun to play with someone who doesn't talk.",
                "ENGLAND: I'm going to try to help Germany take Sweden."
            ]
        },
        "S1906M": {
            "mentioned": [
                "nwy",
                "germany",
                "swe"
            ],
            "start": {
                "RUSSIA": [
                    "A NWY S F FIN - SWE",
                    "F FIN - SWE"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A NWY - SWE",
                    "F FIN S A NWY - SWE"
                ]
            },
            "messages": [
                "ENGLAND: I would like to work with you against Germany.",
                "ENGLAND: He is going to become a much bigger threat if he defeats me and then goes after you.",
                "RUSSIA: sure, what's your idea?",
                "ENGLAND: You should take Sweden from Germany.",
                "RUSSIA: yes, thanks captain obvious\n",
                "ENGLAND: You should support your move with A Norway.",
                "RUSSIA: I don't have enough forces thanks to you",
                "ENGLAND: You should talk to Italy and Turkey about how to work together to stop Germany and Austria.",
                "RUSSIA: sure, can you tap north sea for me?"
            ]
        }
    },
    "ENGLAND-TURKEY": {
        "F1905M": {
            "mentioned": [
                "russia"
            ],
            "start": {
                "ENGLAND": [
                    "A FIN - NWY",
                    "F NWG S A FIN - NWY"
                ]
            },
            "end": {
                "ENGLAND": [
                    "A FIN S A DEN - SWE",
                    "F NWG - EDI"
                ]
            },
            "messages": [
                "ENGLAND: Are you working with Russia? It doesn't look like it.",
                "ENGLAND: You should take Naples.",
                "ENGLAND: Are you going to take Naples?"
            ]
        }
    },
    "FRANCE-GERMANY": {
        "F1904M": {
            "mentioned": [
                "bur",
                "par"
            ],
            "start": {
                "FRANCE": [
                    "A PAR H"
                ]
            },
            "end": {
                "FRANCE": [
                    "A PAR - BUR"
                ]
            },
            "messages": [
                "FRANCE: Are we good?",
                "GERMANY: You should move Paris to Gascony and then to Spain.",
                "FRANCE: I will when you leave Bur",
                "GERMANY: You should let me take Marseilles this turn in exchange for Belgium.",
                "FRANCE: Go back to Munich please",
                "FRANCE: No I need both of those"
            ]
        },
        "S1905M": {
            "mentioned": [
                "pic"
            ],
            "start": {
                "GERMANY": [
                    "A BEL S A MUN - BUR",
                    "A DEN H"
                ]
            },
            "end": {
                "GERMANY": [
                    "A BEL - PIC",
                    "A DEN - SWE"
                ]
            },
            "messages": [
                "GERMANY: Are you willing to work together now?",
                "GERMANY: If not, that's fine. We can continue to fight.",
                "FRANCE: I want to work together",
                "FRANCE: But I have to have Mar, you can't take my home center and then ask for an alliance",
                "GERMANY: If you are willing to work together, I recommend the following moves:\n\nBurgundy - Marseilles\nGulf of Lyons support Burgundy - Marseilles\nPicardy - Burgundy\nPiedmont support Burgundy - Marseilles",
                "FRANCE: What are you doing with Mar then"
            ]
        },
        "F1905M": {
            "mentioned": [
                "pic",
                "england"
            ],
            "start": {
                "GERMANY": [
                    "A BEL - YOR VIA",
                    "F HOL - BEL",
                    "F NTH C A BEL - YOR"
                ]
            },
            "end": {
                "GERMANY": [
                    "A BEL - PIC",
                    "F HOL - NTH",
                    "F NTH - LON"
                ]
            },
            "messages": [
                "GERMANY: If you want to defend yourself against England, move Picardy to Brest.",
                "FRANCE: No you can have Brest, just move Gascony there",
                "GERMANY: You should also take Spain with Gulf of Lyons.",
                "GERMANY: Are you moving Picardy to Brest?",
                "FRANCE: No",
                "FRANCE: You can move there",
                "FRANCE: Because I want Mar",
                "FRANCE: But give me Par"
            ]
        }
    },
    "FRANCE-ITALY": {},
    "FRANCE-RUSSIA": {
        "F1902M": {
            "mentioned": [
                "turkey",
                "austria",
                "england"
            ],
            "start": {
                "RUSSIA": [
                    "A GAL H",
                    "A MOS H",
                    "A STP H",
                    "A UKR H",
                    "F RUM H",
                    "F SWE H"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A GAL - BUD",
                    "A MOS - STP",
                    "A STP - NWY",
                    "A UKR - WAR",
                    "F RUM S A CON - BUL",
                    "F SWE S A STP - NWY"
                ]
            },
            "messages": [
                "RUSSIA: Yeah, I see his attacks coming",
                "RUSSIA: What are your plans for this year?",
                "FRANCE: Well I don't want to be in Sil so trying to do something worthwhile with that. But mainly trying to clean up Germany",
                "RUSSIA: sounds good, I just need him enough to keep England at bay",
                "RUSSIA: we should probably think about how to prevent Austria and Italy from taking over Central Europe",
                "FRANCE: Yeah Turkey and I are moving on Italy. Can I help you with my Sil unit?"
            ]
        }
    },
    "FRANCE-TURKEY": {
        "F1904M": {
            "mentioned": [
                "germany"
            ],
            "start": {
                "FRANCE": [
                    "A PAR H"
                ]
            },
            "end": {
                "FRANCE": [
                    "A PAR - BUR"
                ]
            },
            "messages": [
                "FRANCE: Do you still think they're a bot?",
                "TURKEY: I do. They write back very quickly",
                "TURKEY: Austria",
                "FRANCE: I thought it was Eng, Ger, Italy",
                "FRANCE: Oh there are 4 nevermind"
            ]
        },
        "F1905M": {
            "mentioned": [
                "austria"
            ],
            "start": {
                "TURKEY": [
                    "A APU - VEN"
                ]
            },
            "end": {
                "TURKEY": [
                    "A APU S A ROM - VEN"
                ]
            },
            "messages": [
                "FRANCE: I can't this turn I need to make sure I keep Mar",
                "FRANCE: You can support yourself into Nap most likely",
                "TURKEY: Yes but I need Ion because Austria has two fleets on Aug",
                "TURKEY: Aegean",
                "FRANCE: Gotcha"
            ]
        }
    },
    "GERMANY-RUSSIA": {
        "S1902M": {
            "mentioned": [
                "fin",
                "stp",
                "mos"
            ],
            "start": {
                "RUSSIA": [
                    "A MOS - LVN",
                    "A STP H"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A MOS - STP",
                    "A STP - FIN"
                ]
            },
            "messages": [
                "GERMANY: I didn't bounce you in Sweden and would like to work with you against England.",
                "RUSSIA: Sounds good\n",
                "RUSSIA: What do you need from me?",
                "GERMANY: You should move Stp to Fin and Mos to Stp if you're planning to fight England.",
                "GERMANY: Russia?",
                "RUSSIA: sounds good",
                "GERMANY: Are you moving Stp-fin and Mos-stp?",
                "RUSSIA: yes"
            ]
        },
        "F1902M": {
            "mentioned": [
                "war",
                "swe",
                "nwy",
                "stp",
                "mos"
            ],
            "start": {
                "GERMANY": [
                    "A BER S A MUN",
                    "A MUN S A BER"
                ],
                "RUSSIA": [
                    "A GAL H",
                    "A MOS S A STP",
                    "A STP H",
                    "A UKR H",
                    "F RUM H",
                    "F SWE H"
                ]
            },
            "end": {
                "GERMANY": [
                    "A BER - SIL",
                    "A MUN S A BER - SIL"
                ],
                "RUSSIA": [
                    "A GAL - BUD",
                    "A MOS - STP",
                    "A STP - NWY",
                    "A UKR - WAR",
                    "F RUM S A CON - BUL",
                    "F SWE S A STP - NWY"
                ]
            },
            "messages": [
                "GERMANY: What are you thinking for this turn?",
                "RUSSIA: I'm at war in the north, and need to keep Eastern Europe ",
                "RUSSIA: helped you out in ska",
                "RUSSIA: what do you need from me this turn?",
                "GERMANY: Are you going to try to take Norway?",
                "GERMANY: If you move Stp-nwy, Swe S Stp-nwy and Mos-stp, you have a good shot at taking it.",
                "RUSSIA: yeah I'll do that"
            ]
        },
        "S1904M": {
            "mentioned": [
                "england"
            ],
            "start": {
                "GERMANY": [
                    "A BUR - PIC",
                    "F DEN - NTH",
                    "F HOL S A RUH - BEL"
                ]
            },
            "end": {
                "GERMANY": [
                    "A BUR - GAS",
                    "F DEN - HEL",
                    "F HOL S F DEN - HEL"
                ]
            },
            "messages": [
                "GERMANY: You should try to move St. Petersburg to Finland and Moscow to St. Petersburg.",
                "GERMANY: If you get into Finland and St. Petersburg, you will be in a much better position to take Norway.",
                "GERMANY: What are you planning to do?",
                "RUSSIA: can't spare my army in MOS with Aus breathing down my neck",
                "GERMANY: England is going to move Barents Sea to Norway and Norway to North Sea. If you move to Finland, and use Moscow to cover St. Petersburg, you will be in a much better position to take Norway in the fall.",
                "GERMANY: Does that make sense?",
                "RUSSIA: okay I'll try",
                "RUSSIA: sure"
            ]
        },
        "S1905M": {
            "mentioned": [
                "gal",
                "war"
            ],
            "start": {
                "GERMANY": [
                    "A BEL S A MUN - BUR",
                    "A DEN H"
                ],
                "RUSSIA": [
                    "A WAR H"
                ]
            },
            "end": {
                "GERMANY": [
                    "A BEL - PIC",
                    "A DEN - SWE"
                ],
                "RUSSIA": [
                    "A WAR - GAL"
                ]
            },
            "messages": [
                "GERMANY: You should support the hold in Norway again.",
                "GERMANY: Also, you should move Warsaw to Galicia and support Sevastopol to Rumania with the Black Sea.",
                "RUSSIA: sure thing",
                "RUSSIA: thanks for the assist last turn"
            ]
        },
        "F1905M": {
            "mentioned": [
                "ukr",
                "rum",
                "nwy"
            ],
            "start": {
                "GERMANY": [
                    "A BEL - YOR VIA",
                    "F HOL - BEL",
                    "F NTH C A BEL - YOR"
                ],
                "RUSSIA": [
                    "A NWY S A STP - FIN",
                    "A UKR - GAL",
                    "A WAR S A UKR - GAL",
                    "F SWE S A STP - FIN"
                ]
            },
            "end": {
                "GERMANY": [
                    "A BEL - PIC",
                    "F HOL - NTH",
                    "F NTH - LON"
                ],
                "RUSSIA": [
                    "A NWY S F SWE - FIN",
                    "A UKR S A RUM",
                    "A WAR - GAL",
                    "F SWE - FIN"
                ]
            },
            "messages": [
                "GERMANY: If you let Turkey take Bulgaria this turn with Constantinople, you will be able to take Ankara next year. You should let Turkey know you will support the move with the Black Sea.",
                "RUSSIA: okay",
                "GERMANY: Also, make sure to use Ukraine to support the hold in Rumania.",
                "GERMANY: Do you know what you are doing this turn?",
                "GERMANY: I recommend supporting the hold in Rumania with Ukraine. You should also support Constantinople to Bulgaria with the Black Sea.",
                "GERMANY: Are you supporting the hold in Norway?",
                "GERMANY: I recommend letting Turkey take Bulgaria so that you will be able to take Ankara next year."
            ]
        }
    },
    "GERMANY-TURKEY": {
        "S1905M": {
            "mentioned": [
                "russia"
            ],
            "start": {
                "GERMANY": [
                    "A BEL S A MUN - BUR",
                    "A DEN H"
                ]
            },
            "end": {
                "GERMANY": [
                    "A BEL - PIC",
                    "A DEN - SWE"
                ]
            },
            "messages": [
                "GERMANY: I recommend that you stop attacking Italy and that you try to work with Italy.",
                "GERMANY: You should try to work with Austria against Russia."
            ]
        }
    },
    "ITALY-RUSSIA": {
        "F1902M": {
            "mentioned": [
                "bud",
                "england"
            ],
            "start": {
                "RUSSIA": [
                    "A GAL H",
                    "A MOS S A STP",
                    "A STP H",
                    "A UKR H",
                    "F RUM H",
                    "F SWE H"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A GAL - BUD",
                    "A MOS - STP",
                    "A STP - NWY",
                    "A UKR - WAR",
                    "F RUM S A CON - BUL",
                    "F SWE S A STP - NWY"
                ]
            },
            "messages": [
                "ITALY: Nice job outguessing England in the north.",
                "RUSSIA: thanks",
                "ITALY: Are you going to try to take Budapest?"
            ]
        },
        "F1903M": {
            "mentioned": [
                "england",
                "swe",
                "nwy"
            ],
            "start": {
                "ITALY": [
                    "F NAP S A ROM"
                ],
                "RUSSIA": [
                    "A STP H",
                    "F SWE H"
                ]
            },
            "end": {
                "ITALY": [
                    "F NAP - TYS"
                ],
                "RUSSIA": [
                    "A STP - NWY",
                    "F SWE S A STP - NWY"
                ]
            },
            "messages": [
                "ITALY: Why didn't you support yourself to Norway with Sweden?",
                "RUSSIA: I did",
                "RUSSIA: England blocked me",
                "ITALY: You should probably take it with St. Petersburg.",
                "ITALY: Do you know what Turkey is going to do this turn?",
                "RUSSIA: yeah I tried"
            ]
        },
        "S1905M": {
            "mentioned": [
                "austria"
            ],
            "start": {
                "ITALY": [
                    "A ROM - NAP",
                    "F TYS - WES"
                ]
            },
            "end": {
                "ITALY": [
                    "A ROM - VEN",
                    "F TYS - TUN"
                ]
            },
            "messages": [
                "ITALY: I think you should ally with Turkey against Austria.",
                "ITALY: You are going to need his help to take Rumania."
            ]
        },
        "S1906M": {
            "mentioned": [
                "germany",
                "swe"
            ],
            "start": {
                "RUSSIA": [
                    "A NWY S F FIN - SWE",
                    "F FIN - SWE"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A NWY - SWE",
                    "F FIN S A NWY - SWE"
                ]
            },
            "messages": [
                "ITALY: Why didn't you defend Sweden?",
                "RUSSIA: didn't figure out the right move",
                "ITALY: Are you going to take back Rumania this turn?",
                "RUSSIA: yeah that's the plan",
                "ITALY: Also, I'm really glad to see that you disbanded St. Petersburg. Now, you can defend yourself from Germany.",
                "ITALY: Are you going to use Galicia, Ukraine, and Sevastopol to try to take back Rumania?"
            ]
        },
        "F1906M": {
            "mentioned": [
                "ukr",
                "rum",
                "gal",
                "war"
            ],
            "start": {
                "ITALY": [
                    "A VEN - PIE"
                ],
                "RUSSIA": [
                    "A RUM H",
                    "A UKR S A RUM",
                    "A WAR - GAL"
                ]
            },
            "end": {
                "ITALY": [
                    "A VEN - TRI"
                ],
                "RUSSIA": [
                    "A RUM - GAL",
                    "A UKR S A RUM - GAL",
                    "A WAR S A RUM - GAL"
                ]
            },
            "messages": [
                "ITALY: You should probably use Sweden to attack Norway, to cut support.",
                "ITALY: Also, you should move Warsaw to Galicia, to cut support.",
                "RUSSIA: thx",
                "ITALY: I think you should move Sweden to Norway, and Finland to St. Petersburg.",
                "RUSSIA: on it",
                "ITALY: Also, support Rumania to hold using Ukraine, and support Turkey to take Bulgaria."
            ]
        }
    },
    "ITALY-TURKEY": {
        "S1905M": {
            "mentioned": [
                "tun"
            ],
            "start": {
                "ITALY": [
                    "A ROM - NAP",
                    "F TYS - WES"
                ]
            },
            "end": {
                "ITALY": [
                    "A ROM - VEN",
                    "F TYS - TUN"
                ]
            },
            "messages": [
                "ITALY: You should move Ionian Sea to Tunis.",
                "ITALY: Actually, you should move Ionian Sea to Adriatic Sea.",
                "TURKEY: I don't want to move it. Sorry!"
            ]
        },
        "F1905M": {
            "mentioned": [
                "austria",
                "ven"
            ],
            "start": {
                "TURKEY": [
                    "A APU - VEN"
                ]
            },
            "end": {
                "TURKEY": [
                    "A APU S A ROM - VEN"
                ]
            },
            "messages": [
                "TURKEY: Can you support me to Venice? Or should I support you?",
                "TURKEY: I will not take Naples. I am terrified of Austria",
                "ITALY: You should support me to Venice.",
                "ITALY: Are you willing to do that?",
                "TURKEY: ordered",
                "TURKEY: yes I am"
            ]
        },
        "F1906M": {
            "mentioned": [
                "austria",
                "tri"
            ],
            "start": {
                "ITALY": [
                    "A VEN - PIE"
                ]
            },
            "end": {
                "ITALY": [
                    "A VEN - TRI"
                ]
            },
            "messages": [
                "ITALY: What do you want me to do with the fleet in the Ionian Sea?",
                "ITALY: Are you trying to take Bulgaria back?",
                "TURKEY: I am trying to take Bulgaria back. I want you to move to adriatic and put pressure on Trieste",
                "TURKEY: You will find me a loyal ally against Austria",
                "ITALY: I'm not going to do that this turn.",
                "ITALY: Try to coordinate with Russia to take Bulgaria."
            ]
        }
    },
    "RUSSIA-TURKEY": {
        "F1902M": {
            "mentioned": [
                "rum",
                "bul",
                "con"
            ],
            "start": {
                "RUSSIA": [
                    "A GAL H",
                    "A STP H",
                    "A UKR H",
                    "F RUM H",
                    "F SWE H"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A GAL - BUD",
                    "A STP - NWY",
                    "A UKR - WAR",
                    "F RUM S A CON - BUL",
                    "F SWE S A STP - NWY"
                ]
            },
            "messages": [
                "TURKEY: Please support Con -> Bulgaria",
                "TURKEY: Rum S Con - Bul",
                "RUSSIA: sure"
            ]
        },
        "S1903M": {
            "mentioned": [
                "ser",
                "rum",
                "bul",
                "con"
            ],
            "start": {
                "RUSSIA": [
                    "A MOS H",
                    "A STP H",
                    "A WAR H",
                    "F RUM H",
                    "F SWE H"
                ],
                "TURKEY": [
                    "A BUL - GRE"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A MOS - STP",
                    "A STP - NWY",
                    "A WAR S A GAL",
                    "F RUM S A CON - BUL",
                    "F SWE S A STP - NWY"
                ],
                "TURKEY": [
                    "A BUL - SER"
                ]
            },
            "messages": [
                "TURKEY: Please support Con - Bulg. I will tap Serbia with Bulg to cut support and bring my fleets out against greece",
                "TURKEY: Unless you think it better I support Bulg from Con",
                "RUSSIA: sounds good. rum S con- bul entered",
                "RUSSIA: either way is good\n",
                "TURKEY: We have to figure out a way for you to get an army in Rumania. With that fleet there we are kind of blocked.",
                "TURKEY: Have you reached out to France?",
                "RUSSIA: yeah, there's no time to set up a good strategy"
            ]
        },
        "F1903M": {
            "mentioned": [
                "england"
            ],
            "start": {
                "RUSSIA": [
                    "A STP H",
                    "F SWE H"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A STP - NWY",
                    "F SWE S A STP - NWY"
                ]
            },
            "messages": [
                "TURKEY: Jesus! Austria built a fleet! I hadn't noticed",
                "RUSSIA: Oooh, yeah the images are too small\n",
                "TURKEY: Do you hace space to bring Moscow to UKR? Im ok with you putting your fleet in Black eventually when you can slip an army in Rumania ",
                "TURKEY: or better to park it in Sev, still could support Rum",
                "RUSSIA: yeah just concerned about England invading from the north while I'm trying to maneuver in the south"
            ]
        },
        "S1904M": {
            "mentioned": [
                "rum",
                "austria"
            ],
            "start": {
                "TURKEY": [
                    "A BUL - SER",
                    "A CON - APU VIA",
                    "F AEG C A CON - APU",
                    "F ION C A CON - APU"
                ]
            },
            "end": {
                "TURKEY": [
                    "A BUL S A UKR - RUM",
                    "A CON S A BUL",
                    "F AEG S F ION - GRE",
                    "F ION - GRE"
                ]
            },
            "messages": [
                "RUSSIA: ooph, looks like Austria is forming a brick wall against us",
                "RUSSIA: can you support my army into Rumania?",
                "TURKEY: I'm going to ask Austria's support into Rumania. Better my army than your fleet. Ok? Maybe we can deceive him. Otherwise we will lose",
                "TURKEY: Austria says no. but says he will in the fall",
                "TURKEY: I will support your army into Rumania"
            ]
        },
        "F1904M": {
            "mentioned": [
                "ukr",
                "rum",
                "bla"
            ],
            "start": {
                "RUSSIA": [
                    "A UKR - RUM",
                    "A WAR H",
                    "F BLA S A UKR - RUM"
                ],
                "TURKEY": [
                    "F AEG S F ION - GRE",
                    "F ION - GRE"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A UKR S A BUL - RUM",
                    "A WAR S A UKR",
                    "F BLA S A BUL - RUM"
                ],
                "TURKEY": [
                    "F AEG - ION",
                    "F ION - NAP"
                ]
            },
            "messages": [
                "TURKEY: Hello, you asked for my support but didn't follow through. Can you please support me to Rumania this turn from Black Sea and UKR?",
                "TURKEY: You can stab me by moving into Ank. But I think Austria will win then.",
                "RUSSIA: Yes so sorry about that",
                "TURKEY: What's up? Is this the stab?",
                "RUSSIA: No I was focused up north",
                "RUSSIA: I won't move my fleet",
                "RUSSIA: we can bounce in Rum",
                "RUSSIA: and then next year we can come out in full force against Austria ",
                "RUSSIA: how does that sound?",
                "TURKEY: Goal is to get an army in Rum. Not a bounce. ",
                "TURKEY: Cannot move against Austria without an army in Rum",
                "TURKEY: Please support me to Rum",
                "RUSSIA: fair enough",
                "TURKEY: You can pull your fleet in Black if you have to pull",
                "RUSSIA: what does that mean?",
                "RUSSIA: oh true",
                "RUSSIA: okay",
                "TURKEY: I mean if you loose a supply center because I am in Rum you can pull fleet in Black. It will not be good for our long term alliance if russian fleet in black. ",
                "TURKEY: i will build fleets or armies against austria",
                "TURKEY: he is leader and he is bot",
                "TURKEY: Will give Rum back once we make progress against Austria"
            ]
        },
        "S1905M": {
            "mentioned": [
                "gal",
                "austria",
                "war"
            ],
            "start": {
                "RUSSIA": [
                    "A NWY S A STP - FIN",
                    "A STP - FIN",
                    "A WAR H",
                    "F SWE S A STP - FIN"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A NWY H",
                    "A STP S A NWY",
                    "A WAR - GAL",
                    "F SWE S A NWY"
                ]
            },
            "messages": [
                "RUSSIA: okay that was good anticipation by Austria ",
                "RUSSIA: I'll move my army into Rumania ",
                "RUSSIA: can probably help you take Greece this fall by tapping SER",
                "TURKEY: That is the plan. i will tap Ser now",
                "TURKEY: The bots are good",
                "RUSSIA: thx",
                "RUSSIA: yeah they are",
                "TURKEY: Don't forget to tap Galicia from Warsaw, no?",
                "RUSSIA: oh yeah, thanks for the reminder",
                "TURKEY: How are things between you and England? Do you want to move against him or Germany?",
                "RUSSIA: yeah I'm hoping we can work something out"
            ]
        },
        "F1905M": {
            "mentioned": [
                "austria",
                "ven",
                "italy"
            ],
            "start": {
                "RUSSIA": [
                    "A NWY S A STP - FIN",
                    "F SWE S A STP - FIN"
                ],
                "TURKEY": [
                    "A APU - VEN",
                    "F ION S F AEG"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A NWY S F SWE - FIN",
                    "F SWE - FIN"
                ],
                "TURKEY": [
                    "A APU S A ROM - VEN",
                    "F ION - GRE"
                ]
            },
            "messages": [
                "TURKEY: Please support F Black S Con - Bulgaria",
                "TURKEY: Oh never mind, you have to support Rum. We are losing 2 vs 1 against the bot",
                "RUSSIA: yeah I gonna support Rum",
                "RUSSIA: sorry :(",
                "RUSSIA: we'll get them next year",
                "TURKEY: I am supporting Italy to Venice. If he gets in I will have successfully opened a 2nd front against Austria. Or I will have awakened an Italian monster",
                "RUSSIA: haha"
            ]
        },
        "S1906M": {
            "mentioned": [
                "fin",
                "germany",
                "swe"
            ],
            "start": {
                "RUSSIA": [
                    "A NWY S F FIN - SWE",
                    "F FIN - SWE"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A NWY - SWE",
                    "F FIN S A NWY - SWE"
                ]
            },
            "messages": [
                "RUSSIA: ooph, so my bad—didn't realize rum actually had to hold in order to be effective",
                "TURKEY: Ugh this is not going well for either of us.\n",
                "RUSSIA: and totally saw the stab in Swe coming, but didn't make the right move against it",
                "RUSSIA: yeah...",
                "TURKEY: Easy mistake to make. You could have support-held Sweden too but not when you moved it",
                "RUSSIA: yeah tried to go for Finland but change mind at the last moment",
                "RUSSIA: well Austria's gonna steamroll us",
                "RUSSIA: probably with Germany's help",
                "TURKEY: Realistically, if we don't make more mistakes we should be able to hold him. You will lose Galicia but should be able to hold at Warsaw. If germany helps though we are screwed"
            ]
        },
        "F1906M": {
            "mentioned": [
                "rum",
                "gal"
            ],
            "start": {
                "RUSSIA": [
                    "A RUM H",
                    "A UKR S A RUM",
                    "A WAR S A UKR"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A RUM - GAL",
                    "A UKR S A RUM - GAL",
                    "A WAR S A RUM - GAL"
                ]
            },
            "messages": [
                "RUSSIA: yeah that's unfortunate...",
                "RUSSIA: ooph these bots are bumrushing us",
                "RUSSIA: testing",
                "RUSSIA: having you heard anything from the bots?",
                "RUSSIA: wondering if they reconnected",
                "RUSSIA: okay that's a yes",
                "RUSSIA: I think I can guard Rumania?",
                "RUSSIA: b/c BULsc can't get into RUM",
                "TURKEY: He moves in from Gal, supported by Bud and Serbia",
                "TURKEY: You get Gal back but lose Rum",
                "RUSSIA: oh yeah you're right\n",
                "RUSSIA: RIP",
                "RUSSIA: what if I move into gal?",
                "RUSSIA: do we bounce?",
                "TURKEY: Oh, you have an order set. Move Rum - Gal supported by the others. Then its a bounce",
                "RUSSIA: okay will try that",
                "TURKEY: It is a 3 v 3 bounce and you keep Rum"
            ]
        }
    }
}