{
    "AUSTRIA-ENGLAND": {
        "S1903M": {
            "mentioned": [
                "russia",
                "rum",
                "gal"
            ],
            "start": {
                "AUSTRIA": [
                    "A BUD - RUM",
                    "A GAL S A BUD - RUM",
                    "A SER S A BUD - RUM"
                ]
            },
            "end": {
                "AUSTRIA": [
                    "A BUD S A SER - RUM",
                    "A GAL S A SER - RUM",
                    "A SER - RUM"
                ]
            },
            "messages": [
                "ENGLAND: Nice job taking Gal. You should be able to take Rum this turn",
                "AUSTRIA: I hope so. If Turkey plays ball",
                "AUSTRIA: Thank you for pressuring Russia",
                "ENGLAND: No problem. I'm hoping you two can work together"
            ]
        }
    },
    "AUSTRIA-FRANCE": {
        "F1905M": {
            "mentioned": [
                "rom",
                "italy"
            ],
            "start": {
                "FRANCE": [
                    "F TYS S F NAP"
                ]
            },
            "end": {
                "FRANCE": [
                    "F TYS - ROM"
                ]
            },
            "messages": [
                "AUSTRIA: can we help each other this turn?",
                "FRANCE: What did you have in mind?",
                "AUSTRIA: Help Turkey against Italy? Or one of us go Trieste?",
                "AUSTRIA: Albania is moving to Trieste.",
                "FRANCE: Ok. I'm going for Rome."
            ]
        },
        "S1907M": {
            "mentioned": [
                "rom"
            ],
            "start": {
                "FRANCE": [
                    "A GAS S F SPA/SC",
                    "F ROM H",
                    "F SPA/SC H"
                ]
            },
            "end": {
                "FRANCE": [
                    "A GAS - SPA",
                    "F ROM - TYS",
                    "F SPA/SC - POR"
                ]
            },
            "messages": [
                "FRANCE: I think you're done for.",
                "FRANCE: Maybe you should work with Russia.",
                "AUSTRIA: Please cover Marseilles",
                "FRANCE: I will.",
                "FRANCE: Please support hold Rome."
            ]
        }
    },
    "AUSTRIA-GERMANY": {
        "S1902M": {
            "mentioned": [
                "bel",
                "hol",
                "italy"
            ],
            "start": {
                "AUSTRIA": [
                    "A VIE - TRI",
                    "F TRI - ADR"
                ],
                "GERMANY": [
                    "A BUR - GAS"
                ]
            },
            "end": {
                "AUSTRIA": [
                    "A VIE - GAL",
                    "F TRI - VEN"
                ],
                "GERMANY": [
                    "A BUR S A HOL - BEL"
                ]
            },
            "messages": [
                "GERMANY: I will. Can you support Hol to Bel? Maybe this turn it fails but next I'll be able to move there",
                "AUSTRIA: Wrong recippient lol. But please contain Russia in Sweden!",
                "GERMANY: Oh yeah. Nevermind. I am working with England and that is already obvious. Russia should not had that build but Italy dissappointed me",
                "AUSTRIA: I don't mind you working with England. Just please work with me too! lol.",
                "GERMANY: No problem at all. But how good are you with Russia. If you are working with him that somewhat limits my help to you. But we can make deal always. We are natural allies",
                "AUSTRIA: He's a bot and frustrating, I think",
                "GERMANY: Hmm, aren't bots quite good at tactics. He had Tun 100% and he risked with GRE"
            ]
        },
        "F1902M": {
            "mentioned": [
                "mun"
            ],
            "start": {
                "GERMANY": [
                    "A MUN - BUR"
                ]
            },
            "end": {
                "GERMANY": [
                    "A MUN - SIL"
                ]
            },
            "messages": [
                "AUSTRIA: I've done that myself in games before but not when Austria tells me no and I told him no",
                "AUSTRIA: Any chance youd send a tank to Tyr and help with Ven? Humans against machines!",
                "GERMANY: Maybe next year? I really need Mun to defend now against Russia. Next year we shall discuss about Italy",
                "AUSTRIA: Fair!"
            ]
        },
        "S1903M": {
            "mentioned": [
                "rum",
                "gal"
            ],
            "start": {
                "AUSTRIA": [
                    "A BUD - RUM",
                    "A GAL S A BUD - RUM",
                    "A SER S A BUD - RUM"
                ],
                "GERMANY": [
                    "F DEN H"
                ]
            },
            "end": {
                "AUSTRIA": [
                    "A BUD S A SER - RUM",
                    "A GAL S A SER - RUM",
                    "A SER - RUM"
                ],
                "GERMANY": [
                    "F DEN - BAL"
                ]
            },
            "messages": [
                "GERMANY: This is great for you now",
                "AUSTRIA: I hope so. Take Warsaw this move? I need Gal for Rum. But you could move Berlin to Prussia.",
                "GERMANY: I will go for WAR. But I'd be happy if you attack GAL -> RUM and support with other units. Also that moves your armies closer to Turkey in case of stabbing.",
                "AUSTRIA: Sounds good; thank you for pressuring him. \n\nI hope Turkey doesnt stab; i have few friends lol. If he doesnt ill be OK. if He does, probably toast.",
                "GERMANY: So you go for RUM this turn? Do you want MOS or SEV? We should talk about that as well now"
            ]
        }
    },
    "AUSTRIA-ITALY": {
        "F1901M": {
            "mentioned": [
                "gre"
            ],
            "start": {
                "AUSTRIA": [
                    "A SER - RUM"
                ]
            },
            "end": {
                "AUSTRIA": [
                    "A SER - GRE"
                ]
            },
            "messages": [
                "ITALY: Right? Lol, I half expect you might be one.",
                "ITALY: Anyways, I'll be convoying Naples into Greece this turn, if you'd like to support me in.",
                "AUSTRIA: Ooo, honestly, I was hoping to have that eventually. Would you mind taking Tunis? ",
                "ITALY: Well, you'd not be getting it this turn either way. Better one of us there than leaving it empty, and it means in the spring we can shove you into Bulgaria.",
                "ITALY: Then afterward I can convoy with a standard sort of Lapanto pattern from Greece into Syria",
                "AUSTRIA: That's true. As long as there's some path for me to get past four I am flexible. Is it necessary to bounce in Ven/Tri again? Just lemme know your preference.",
                "ITALY: We don't necessarily need to bounce anymore, but at the same time I don't have a lot for VEN to do. Could wander down to Apulia I suppose.",
                "AUSTRIA: I'm fine either way. I can have the boat stand this turn. At some point, it would be better destroyed and made a tank if we are to have an alliance against Turkey.",
                "ITALY: For sure, not a lot for you to do with a fleet, especially after Turkey's down.",
                "AUSTRIA: Has he said anything? He and Russia say they're not bouncing which makes me expect a juggernaut. In black sea.",
                "ITALY: Yeah I'm worried about an RT too. Turks are trying to talk me into letting them have Greece and I'm not sure I'll be able to spin well enough that they let me walk in."
            ]
        }
    },
    "AUSTRIA-RUSSIA": {
        "F1901M": {
            "mentioned": [
                "gre"
            ],
            "start": {
                "AUSTRIA": [
                    "A SER - RUM"
                ]
            },
            "end": {
                "AUSTRIA": [
                    "A SER - GRE"
                ]
            },
            "messages": [
                "RUSSIA: Well I thought I had more time. I was talking with Turkey a bit.",
                "AUSTRIA: I'd prefer you commit a bit more north, if you are willing? England is. No need for us to fight.",
                "RUSSIA: Well, I'm not going to commit too much north. I don't want to get attacked in the south. We can keep bouncing in GAL though.",
                "AUSTRIA: I guess thats fine but it kinda ties up a lot of my units to do that repeatedly so at some point I would like us to reach a more trusting accommodation. Just candid thoughts.",
                "RUSSIA: Absolutely, as soon as we're in a position to not have to bounce I'll probably move out.",
                "AUSTRIA: Sounds good. Appreciate you thinking of it :)",
                "RUSSIA: I think Italy might be going for GRE by the way. He hasn't given me details, but I think you might want to bounce him out.",
                "AUSTRIA: I guess we will see, I encouraged him to go to Tunis"
            ]
        },
        "S1902M": {
            "mentioned": [
                "italy",
                "gal",
                "stp"
            ],
            "start": {
                "AUSTRIA": [
                    "A VIE - TRI",
                    "F TRI - ADR"
                ],
                "RUSSIA": [
                    "A MOS - UKR",
                    "F BOT - STP/SC"
                ]
            },
            "end": {
                "AUSTRIA": [
                    "A VIE - GAL",
                    "F TRI - VEN"
                ],
                "RUSSIA": [
                    "A MOS - STP",
                    "F BOT - SWE"
                ]
            },
            "messages": [
                "RUSSIA: What are you thinking for this turn?",
                "AUSTRIA: I'm open minded. Woud you support me somewhere? I'd prefer to DMZ Gal now. I would cover STP from risk from England if I were you.",
                "RUSSIA: I'll probably cover STP. Do you think you could work with Italy to take GRE this turn?",
                "AUSTRIA: Italy is being very difficult; I'd be happy to ally with him against Turkey if he will be reasonable. Also happy to ally with you against Turkey.",
                "RUSSIA: Well, let's see if we can get something worked out then.",
                "AUSTRIA: Can we DMZ Galicia? Also, I think G/E are allied. And you might get pressure from both.",
                "RUSSIA: I'll be moving to GAL this turn but I'm willing to DMZ it from there.",
                "AUSTRIA: Can you please reconsider? its just unnecessary pressure on me.",
                "RUSSIA: I understand, but I need to be able to defend myself."
            ]
        },
        "S1903M": {
            "mentioned": [
                "rum",
                "gal"
            ],
            "start": {
                "AUSTRIA": [
                    "A BUD - RUM",
                    "A GAL S A BUD - RUM",
                    "A SER S A BUD - RUM"
                ],
                "RUSSIA": [
                    "F BOT - SWE"
                ]
            },
            "end": {
                "AUSTRIA": [
                    "A BUD S A SER - RUM",
                    "A GAL S A SER - RUM",
                    "A SER - RUM"
                ],
                "RUSSIA": [
                    "F BOT - BAL"
                ]
            },
            "messages": [
                "RUSSIA: If you wanted to work with me, you shouldn't have attacked RUM.",
                "RUSSIA: Not to mention GAL.",
                "AUSTRIA: Are you just complaining or do you have a proposal?",
                "RUSSIA: I'd suggest moving out of GAL so I don't have to keep defending myself, but I don't think you're interested in actually working with me.",
                "RUSSIA: I'd suggest moving out of GAL so I don't have to keep defending myself, but I don't think you're actually interested in working with me."
            ]
        }
    },
    "AUSTRIA-TURKEY": {
        "F1901M": {
            "mentioned": [
                "gre"
            ],
            "start": {
                "AUSTRIA": [
                    "A SER - RUM"
                ],
                "TURKEY": [
                    "F ANK - BLA"
                ]
            },
            "end": {
                "AUSTRIA": [
                    "A SER - GRE"
                ],
                "TURKEY": [
                    "F ANK - CON"
                ]
            },
            "messages": [
                "TURKEY: Do you want me to go for Greece, or would you be cool with me taking it so that I can help you into Rum next turn?",
                "TURKEY: This way we both get 2 builds and have a stronger front against Russia",
                "AUSTRIA: I'm fine with you moving to Greece. I think I will bounce Russia from Rum. Can you move to Black Sea? He cannot both get Rum and bounce you.",
                "TURKEY: I don't think he will try to go for both. He has told me that he wants to support himself into Rum. I'm not going to move to the Black Sea because I need to be able to build a fleet in Smyrna to cover a lepanto",
                "AUSTRIA: OK. But, at some point, can you make a move that shows we're buds and there's not a juggernaut? That's what I really need to see from you, fair friend.",
                "TURKEY: That makes sense, but it won't be this turn. Russia seems to trust me at the moment. I need to cover a Lepanto and work with you. Let me into Greece and you will see my next move"
            ]
        },
        "S1902M": {
            "mentioned": [
                "italy"
            ],
            "start": {
                "AUSTRIA": [
                    "A VIE - TRI",
                    "F TRI - ADR"
                ],
                "TURKEY": [
                    "F ANK - CON"
                ]
            },
            "end": {
                "AUSTRIA": [
                    "A VIE - GAL",
                    "F TRI - VEN"
                ],
                "TURKEY": [
                    "F ANK - BLA"
                ]
            },
            "messages": [
                "TURKEY: Wow, I really didn't think you would go for Greece. This is a shame, we could have worked well together!",
                "AUSTRIA: We still can? I would like to. I was trying to keep Italy out.",
                "TURKEY: How do you propose we do that?",
                "AUSTRIA: My proposal is one of us gets Greece and the other gets Rumania. I would sort of prefer Greece but open minded. What say you?",
                "AUSTRIA: I tell you what. I know you want Greece. Take it. Can I have support to Rum? As long as I build armies and you build boats, a friendship can last as long as this game will go.",
                "TURKEY: That is what I would prefer, but how do you propose we do that?",
                "AUSTRIA: Can you support Bud to Rum? And in fall I will support Bulgaria or Aegean, your choice, to Greece?",
                "TURKEY: Sure, so I will take Greece this turn? I don't need support in, but I can support you into Rum in the fall if that is what you prefer",
                "AUSTRIA: I was hoping for your support to Rum but I am leaving Gre open for you"
            ]
        },
        "S1903M": {
            "mentioned": [
                "ser",
                "rum",
                "gal",
                "bud"
            ],
            "start": {
                "AUSTRIA": [
                    "A BUD - RUM",
                    "A GAL S A BUD - RUM",
                    "A SER S A BUD - RUM"
                ]
            },
            "end": {
                "AUSTRIA": [
                    "A BUD S A SER - RUM",
                    "A GAL S A SER - RUM",
                    "A SER - RUM"
                ]
            },
            "messages": [
                "TURKEY: That was a shame, I thought for sure that you would be able to get Rum this turn",
                "TURKEY: Are you planning to support yourself into Rum this turn?",
                "AUSTRIA: I knew he would support from Sev; its OK. Thanks for building the fleet!\n\nCan you move Black sea to Sev to cut his support?\n\nI will support you to SEV on the next move as payment. And I will help you against Italy. I know you need to grow and are like, \"what can Austria do that is better than me attackign him,\" but like Tyrion lannister and Bronn, I always pay double.",
                "TURKEY: I think that you will be able to get Rum this turn without my support, so I'm going to use my fleet to support hold Bul",
                "AUSTRIA: That's fine. Can Bul support in? He could still block me. if he moves Warsaw. Possibly. Its a dice throw depending on moves.",
                "AUSTRIA: What is your ambition for this year?",
                "TURKEY: Where are you moving in from? If you use Gal and Bud to support Ser-rum, you should be guaranteed to get it",
                "AUSTRIA: in that case, he can do sev sup rum while war cut gal\n\nso there's no guarantee. Right now i have Gal moving",
                "AUSTRIA: Happy to support you to sev btw after this"
            ]
        },
        "F1904M": {
            "mentioned": [
                "ion",
                "italy"
            ],
            "start": {
                "TURKEY": [
                    "A BUL S F AEG - GRE",
                    "A SER S A RUM - BUD",
                    "F AEG - GRE",
                    "F EAS - ION"
                ]
            },
            "end": {
                "TURKEY": [
                    "A BUL - GRE",
                    "A SER S A BUL - GRE",
                    "F AEG - ION",
                    "F EAS S F AEG - ION"
                ]
            },
            "messages": [
                "TURKEY: Are you planning to use Adr to support Tri or to attack Ion?",
                "TURKEY: And would you be willing to let me move Rum-bud to keep Italy from taking Bud?"
            ]
        },
        "F1907M": {
            "mentioned": [
                "russia"
            ],
            "start": {
                "TURKEY": [
                    "A RUM S A BUD"
                ]
            },
            "end": {
                "TURKEY": [
                    "A RUM - GAL"
                ]
            },
            "messages": [
                "TURKEY: sorry I didnt see, I can help you get vienna back?",
                "AUSTRIA: I am moving to Vienna.",
                "TURKEY: nice",
                "TURKEY: I will finish russia, then I will win, the choice is to help me now or just die"
            ]
        }
    },
    "ENGLAND-GERMANY": {
        "S1902M": {
            "mentioned": [
                "bel"
            ],
            "start": {
                "GERMANY": [
                    "A BUR - GAS"
                ]
            },
            "end": {
                "GERMANY": [
                    "A BUR S A HOL - BEL"
                ]
            },
            "messages": [
                "ENGLAND: Would you be willing to support Norway to Sweden?",
                "ENGLAND: I can force the channel this phase and support you to Belgium next phase",
                "GERMANY: I will support you there",
                "ENGLAND: Great. I'll be able to take ENG this phase. What should we do with the Russian fleet? I'm worried about it getting into the Baltic and taking Den",
                "GERMANY: Yeah I will offer him Sweden now so he moves there and loses time to attack me",
                "ENGLAND: Sounds good. He can't get into the Baltic without moving out of Gulf of Bothnia",
                "GERMANY: Exactly",
                "ENGLAND: Great. I appreciate the support"
            ]
        },
        "F1903M": {
            "mentioned": [
                "nwy",
                "swe"
            ],
            "start": {
                "ENGLAND": [
                    "F ENG - MAO",
                    "F NTH - NWY",
                    "F SPA/SC S F ENG - MAO",
                    "F SWE S A NWY - FIN"
                ],
                "GERMANY": [
                    "F DEN - BAL"
                ]
            },
            "end": {
                "ENGLAND": [
                    "F ENG - IRI",
                    "F NTH - ENG",
                    "F SPA/SC H",
                    "F SWE - NWY"
                ],
                "GERMANY": [
                    "F DEN H"
                ]
            },
            "messages": [
                "ENGLAND: What are you thinking for this turn?",
                "GERMANY: Maybe we don't get builds this year at all. But that's fine if we prepare for the next year right. You can shuffle your units in Scandinavia in order to have a supported attack on STP next turn. I will try to get WAR and Russia needs to protect STP so he will move his fleet back to STP. You can take Finland with army and move Sweden to Norway.",
                "ENGLAND: That's what I was planning on",
                "ENGLAND: What do you plan on doing with your armies? Are you going to cover Mun?",
                "GERMANY: I have to cover Mun. And unsure about my fleet",
                "ENGLAND: Alright. Sounds good to me"
            ]
        },
        "S1904M": {
            "mentioned": [
                "france"
            ],
            "start": {
                "ENGLAND": [
                    "A FIN - STP",
                    "F NWY S A FIN - STP"
                ],
                "GERMANY": [
                    "A BEL - RUH",
                    "A MUN - SIL",
                    "A PRU - LVN",
                    "A SIL - PRU",
                    "F DEN - BAL"
                ]
            },
            "end": {
                "ENGLAND": [
                    "A FIN - SWE",
                    "F NWY - SKA"
                ],
                "GERMANY": [
                    "A BEL - PIC",
                    "A MUN H",
                    "A PRU - SIL",
                    "A SIL - GAL",
                    "F DEN H"
                ]
            },
            "messages": [
                "ENGLAND: I'm leaving Russia alone so Turkey doesn't grow out of control",
                "GERMANY: It does have a reasoning behind. ",
                "ENGLAND: We have to attack France and you need to make sure he can't slip into the back. Italy isn't going to help against Turkey because of your moves against Russia",
                "GERMANY: I am going to leave Russia alone for now as well.",
                "ENGLAND: Sounds good. France and Russia are both panicking right now",
                "GERMANY: France is not panicking. But I am unsure how to fight him"
            ]
        },
        "F1904M": {
            "mentioned": [
                "france"
            ],
            "start": {
                "ENGLAND": [
                    "F NTH S F SKA - DEN"
                ],
                "GERMANY": [
                    "A PRU - BER",
                    "A SIL - BOH"
                ]
            },
            "end": {
                "ENGLAND": [
                    "F NTH S A PIC - BEL"
                ],
                "GERMANY": [
                    "A PRU S A SIL - WAR",
                    "A SIL - WAR"
                ]
            },
            "messages": [
                "ENGLAND: Sorry, but this seemed like the better plan for me. I don't see myself making gains against France. If you want, we can still work together to make sure he doesn't grow",
                "GERMANY: I will defend myself to the end. So do as you like. ",
                "ENGLAND: Alright. Thanks for being so honest. Maybe in a different game we can work together. I'm looking for a long term ally not a short term SC"
            ]
        },
        "S1905M": {
            "mentioned": [
                "hol"
            ],
            "start": {
                "ENGLAND": [
                    "F NAO H",
                    "F NTH S F DEN - HEL"
                ]
            },
            "end": {
                "ENGLAND": [
                    "F NAO - IRI",
                    "F NTH C A LON - HOL"
                ]
            },
            "messages": [
                "GERMANY: Can you support me in Bel. At least I get something and you seriously slow down France?",
                "GERMANY: I'm moving Hol to Bel",
                "GERMANY: You'll have those centers later anyway. Better for you to get some brake to French conquest and to take some money for yourself",
                "ENGLAND: Sorry, but this is my best option right now. I don't see a way I can make progress against France",
                "ENGLAND: Russia is going for Berlin, just so you know",
                "GERMANY: I am offering you to help me retake BEL and slow down France. Later you will have BEL and HOL. France gets MUN and Russia gets BER this turn. So they will probably get KIE before you",
                "ENGLAND: I don't think Russia is getting Berlin this turn. And I do need France's help in the Med right now"
            ]
        },
        "F1905M": {
            "mentioned": [
                "france",
                "bel"
            ],
            "start": {
                "ENGLAND": [
                    "A HOL S A DEN - KIE",
                    "F ENG S F IRI - MAO",
                    "F NTH S A HOL"
                ]
            },
            "end": {
                "ENGLAND": [
                    "A HOL S F NTH - BEL",
                    "F ENG - BRE",
                    "F NTH - BEL"
                ]
            },
            "messages": [
                "ENGLAND: Well, you called that well. Good move",
                "GERMANY: You can take BEL",
                "ENGLAND: Can you cut support in Burgundy?",
                "GERMANY: I can",
                "ENGLAND: Thanks",
                "GERMANY: But you have enough units. At least be a gentleman and take BEL without asking me to help you just so that you can extra profit on me.",
                "ENGLAND: I'm sorry. I hope there are no hard feelings",
                "ENGLAND: And I'll be a gentleman, if it helps me stab France"
            ]
        }
    },
    "ENGLAND-ITALY": {
        "F1905M": {
            "mentioned": [
                "france"
            ],
            "start": {
                "ENGLAND": [
                    "A HOL S A DEN - KIE",
                    "F ENG S F IRI - MAO",
                    "F NTH S A HOL"
                ]
            },
            "end": {
                "ENGLAND": [
                    "A HOL S F NTH - BEL",
                    "F ENG - BRE",
                    "F NTH - BEL"
                ]
            },
            "messages": [
                "ENGLAND: France said he would help you. Has he told you the same?",
                "ITALY: Well he isn't helping.",
                "ITALY: He's explicitly doing the opposite of what I want.",
                "ENGLAND: He never told me what he was doing"
            ]
        },
        "S1907M": {
            "mentioned": [
                "france"
            ],
            "start": {
                "ENGLAND": [
                    "A BEL - PIC",
                    "A KIE S A RUH - MUN",
                    "A RUH - MUN",
                    "F DEN S F SKA - SWE",
                    "F ENG S A BEL - PIC",
                    "F NTH - NWY",
                    "F SKA - SWE"
                ]
            },
            "end": {
                "ENGLAND": [
                    "A BEL - BUR",
                    "A KIE S F DEN",
                    "A RUH S A KIE",
                    "F DEN S A KIE",
                    "F ENG - NTH",
                    "F NTH - NWG",
                    "F SKA S F SWE"
                ]
            },
            "messages": [
                "ENGLAND: Ok, I'm moving Portugal to MAO. If you can take Marseilles, you can keep it. I don't want France growing anymore",
                "ENGLAND: Well?"
            ]
        }
    },
    "FRANCE-GERMANY": {
        "S1901M": {
            "mentioned": [
                "bur"
            ],
            "start": {},
            "end": {
                "FRANCE": [
                    "A MAR S A PAR - BUR",
                    "A PAR - BUR",
                    "F BRE - ENG"
                ]
            },
            "messages": [
                "GERMANY: Hello there. Can we agree on Bur DMZ?",
                "FRANCE: Hi Germany, looking forward to playing together!\n",
                "FRANCE: What are your plans for Mun?\n",
                "GERMANY: Can we agree not to move to BUR?"
            ]
        },
        "F1901M": {
            "mentioned": [
                "bur",
                "eng"
            ],
            "start": {},
            "end": {
                "FRANCE": [
                    "A BUR - BEL",
                    "A MAR - SPA",
                    "F ENG S A BUR - BEL"
                ]
            },
            "messages": [
                "GERMANY: Wow. Both ENG and BUR. That is a no no",
                "GERMANY: Why did you move to BUR if I asked you not to",
                "GERMANY: No replies?",
                "FRANCE: Sorry, you didn't reply when I asked your plans for Mun",
                "GERMANY: Wow. I asked you not to move in BUR and I honored that DMZ. While you moved there. Why? Can you get out of there so we can start working together"
            ]
        },
        "F1902M": {
            "mentioned": [
                "mar"
            ],
            "start": {
                "FRANCE": [
                    "A GAS S A BEL - BUR"
                ],
                "GERMANY": [
                    "A MUN - BUR"
                ]
            },
            "end": {
                "FRANCE": [
                    "A GAS - MAR"
                ],
                "GERMANY": [
                    "A MUN - SIL"
                ]
            },
            "messages": [
                "GERMANY: That is your problem. You didn't trust me nor England and made enemies. How about you change some trust and make friends?",
                "GERMANY: BRE and MAR are open...",
                "FRANCE: Mar is going to be covered. I'd be willing to negotiate belgium, but it's getting harder and harder to see how you'll ever want to work with me. I can't count on you doing anything but stab me.",
                "GERMANY: I am taking BEL anyways. If you make some friendly moves we can talk. I have enemies on the east as well. I bounced Russia out of SWE and I want him to trust me now"
            ]
        },
        "F1903M": {
            "mentioned": [
                "bur"
            ],
            "start": {
                "FRANCE": [
                    "A BUR H"
                ],
                "GERMANY": [
                    "F DEN - BAL"
                ]
            },
            "end": {
                "FRANCE": [
                    "A BUR - GAS"
                ],
                "GERMANY": [
                    "F DEN H"
                ]
            },
            "messages": [
                "FRANCE: Are we at peace yet?",
                "FRANCE: I'm willing to negotiate.",
                "GERMANY: If you move in the right direction... I wasn't attackng you this turn. Just covering my Mun. I will negotiate now. What do you want or need",
                "FRANCE: I will move out of Burgundy this turn.",
                "GERMANY: Okay. That helps. How do we go after this?"
            ]
        },
        "S1904M": {
            "mentioned": [
                "bur"
            ],
            "start": {
                "FRANCE": [
                    "A GAS S A MAR - BUR",
                    "A MAR - BUR",
                    "A PIC S A MAR - BUR"
                ],
                "GERMANY": [
                    "A BEL - RUH",
                    "A MUN - SIL",
                    "A PRU - LVN",
                    "A SIL - PRU",
                    "F DEN - BAL"
                ]
            },
            "end": {
                "FRANCE": [
                    "A GAS - BUR",
                    "A MAR - PIE",
                    "A PIC S A GAS - BUR"
                ],
                "GERMANY": [
                    "A BEL - PIC",
                    "A MUN H",
                    "A PRU - SIL",
                    "A SIL - GAL",
                    "F DEN H"
                ]
            },
            "messages": [
                "FRANCE: Well, I think I should take Burgundy for defensive purposes. As long as you don't move in, we're fine.",
                "GERMANY: I don't like that at all",
                "FRANCE: Turkey is getting dangerous real fast. They could be at nine centres by the end of the year.",
                "FRANCE: I understand. That's why I'm going to be moving an army into Burgundy.",
                "GERMANY: I don't like your army in Bur as it borders two my centers. We should keep DMZ in BUR. That way no one is threatening the other",
                "FRANCE: I understand that you don't like it, but I can't risk you sneaking into Burgundy.",
                "FRANCE: I don't need it to attack you.",
                "GERMANY: You have problems. And all those problems are made by you. I am asking you not to move there as I have elsewhere to fight and so do you",
                "GERMANY: Moving to Bur is a declaration of war",
                "FRANCE: It isn't a declaration of war. It's a defensive measure."
            ]
        },
        "F1904M": {
            "mentioned": [
                "war"
            ],
            "start": {
                "GERMANY": [
                    "A PRU - BER",
                    "A SIL - BOH"
                ]
            },
            "end": {
                "GERMANY": [
                    "A PRU S A SIL - WAR",
                    "A SIL - WAR"
                ]
            },
            "messages": [
                "FRANCE: And now you're attacking me again?",
                "GERMANY: I told you that moving to Bur was a declaration of war",
                "FRANCE: I can just take Belgium.",
                "FRANCE: If I wanted war with you, I would have moved into Ruhr. I just wanted a little bit of protection."
            ]
        }
    },
    "FRANCE-ITALY": {
        "S1901M": {
            "mentioned": [
                "mar"
            ],
            "start": {
                "ITALY": [
                    "A ROM - VEN"
                ]
            },
            "end": {
                "FRANCE": [
                    "A MAR S A PAR - BUR",
                    "A PAR - BUR",
                    "F BRE - ENG"
                ],
                "ITALY": [
                    "A ROM - NAP"
                ]
            },
            "messages": [
                "ITALY: Howdy France. Standard arrangement?",
                "FRANCE: Sure, what's the arrangement? ",
                "ITALY: We both stay out of PIE, you don't build a fleet in MAR, and I keep my fleets out of the Western Med."
            ]
        },
        "F1903M": {
            "mentioned": [
                "ion"
            ],
            "start": {
                "FRANCE": [
                    "A BUR H"
                ],
                "ITALY": [
                    "F APU - ION",
                    "F ION - EAS"
                ]
            },
            "end": {
                "FRANCE": [
                    "A BUR - GAS"
                ],
                "ITALY": [
                    "F APU S F ION",
                    "F ION S A ALB"
                ]
            },
            "messages": [
                "FRANCE: I'd be careful of Turkey. They could easily take Ionian.",
                "ITALY: Yeah, I'm not a big fan.",
                "FRANCE: Once I retake Spain, my army is at your disposal if you want it.",
                "ITALY: Dope!"
            ]
        },
        "S1905M": {
            "mentioned": [
                "adr",
                "ven"
            ],
            "start": {
                "ITALY": [
                    "A TRI S A VIE - BUD"
                ]
            },
            "end": {
                "ITALY": [
                    "A TRI S F ADR - VEN"
                ]
            },
            "messages": [
                "ITALY: So why did you?",
                "ITALY: Whatever. Support ADR to VEN please.",
                "FRANCE: I'd prefer to send Tyrolia into Munich.",
                "ITALY: Oh so you were just straight up lying about wanting to help.",
                "ITALY: Yeah, I'm not surprised.",
                "FRANCE: Would you rather have me in Tyrrhenian or Gulf of Lyon?",
                "ITALY: I'd rather you in Spain.",
                "FRANCE: I'm moving to Tyrrhenian. If you don't want that, let me know.",
                "ITALY: I don't want that.",
                "ITALY: Do not do that.",
                "ITALY: If you do that I will take that as hostile and I will throw to the Turks.",
                "FRANCE: I'm not attacking you. I want to help you out.",
                "ITALY: Then back off.",
                "FRANCE: I'm not hostile. I'm trying to help you out.",
                "ITALY: Then put your fleet back in Spain.",
                "ITALY: And support ADR to Venice.",
                "FRANCE: I'm not helping the Turks.",
                "ITALY: At this point, anything else will be read as hostile.",
                "FRANCE: I'll help you out, but I'm going to Tyrrhenian."
            ]
        },
        "F1905M": {
            "mentioned": [
                "rom"
            ],
            "start": {
                "FRANCE": [
                    "F TYS S F NAP"
                ]
            },
            "end": {
                "FRANCE": [
                    "F TYS - ROM"
                ]
            },
            "messages": [
                "FRANCE: What do you want my fleet to do?",
                "ITALY: I'm attacking you now.",
                "ITALY: Take your \"help\" and shove it.",
                "FRANCE: That's very mature.",
                "ITALY: You can't see it but I'm rolling my eyes.",
                "FRANCE: That's pretty funny. I think you're pretty much done for. Do you want me to support hold Naples?",
                "ITALY: Naples isn't holding.",
                "ITALY: Move to Rome.",
                "FRANCE: Ok."
            ]
        },
        "F1906M": {
            "mentioned": [
                "tys",
                "turkey"
            ],
            "start": {
                "FRANCE": [
                    "A BRE S A PAR - PIC",
                    "A PAR - PIC",
                    "F ROM - TYS"
                ]
            },
            "end": {
                "FRANCE": [
                    "A BRE H",
                    "A PAR - BUR",
                    "F ROM S F ION - TYS"
                ]
            },
            "messages": [
                "FRANCE: I don't want you in Spain.",
                "ITALY: Gosh, isn't that too bad.",
                "FRANCE: You're funny.",
                "ITALY: Thanks.",
                "FRANCE: I'm supporting Turkey to Tyrrhenian.",
                "ITALY: Ok!",
                "FRANCE: I'd rather Turkey have it than you.",
                "ITALY: Ok!",
                "FRANCE: That's it. You said you'd rather me support Turkey in than you.",
                "ITALY: Ok!",
                "FRANCE: You're a bit childish."
            ]
        }
    },
    "GERMANY-ITALY": {
        "S1904M": {
            "mentioned": [
                "france"
            ],
            "start": {
                "GERMANY": [
                    "A BEL - RUH",
                    "A MUN - SIL",
                    "A PRU - LVN",
                    "A SIL - PRU",
                    "F DEN - BAL"
                ],
                "ITALY": [
                    "A TRI - VIE",
                    "A VEN - TYR"
                ]
            },
            "end": {
                "GERMANY": [
                    "A BEL - PIC",
                    "A MUN H",
                    "A PRU - SIL",
                    "A SIL - GAL",
                    "F DEN H"
                ],
                "ITALY": [
                    "A TRI - SER",
                    "A VEN - TRI"
                ]
            },
            "messages": [
                "ITALY: Damn, the spite play from the Austrians tho.",
                "GERMANY: I hoped he will remain to help me out but I guess he hates you the most",
                "ITALY: Well, you mind sparing an army to help me into VIE? Bohemia's open, not that I expect you to be terribly eager to do that when I've been so tepid on the France issue."
            ]
        }
    },
    "GERMANY-RUSSIA": {
        "S1902M": {
            "mentioned": [
                "swe"
            ],
            "start": {
                "RUSSIA": [
                    "A MOS - UKR",
                    "F BOT - STP/SC"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A MOS - STP",
                    "F BOT - SWE"
                ]
            },
            "messages": [
                "RUSSIA: Sorry, I didn't have time to tell you I wasn't working with Turkey.",
                "GERMANY: Sorry for that SWE. I am going to support you there now if you like. Things changed",
                "RUSSIA: Sure, that'd be great.",
                "GERMANY: Okay"
            ]
        },
        "F1902M": {
            "mentioned": [
                "nwy",
                "england"
            ],
            "start": {
                "GERMANY": [
                    "A MUN - BUR"
                ],
                "RUSSIA": [
                    "A STP - MOS"
                ]
            },
            "end": {
                "GERMANY": [
                    "A MUN - SIL"
                ],
                "RUSSIA": [
                    "A STP - NWY"
                ]
            },
            "messages": [
                "RUSSIA: You really want England to get stronger?",
                "GERMANY: I needed to protect myself and England was listening to me. He stops there this year. He can't convoy to Norway if you don't let that happen. It is up to you now",
                "RUSSIA: How do I know you won't just help England again?",
                "GERMANY: How can I help him now? I can't support him anywhere else",
                "RUSSIA: I don't think you'll be able to take BEL this turn. Are you sure you want to continue going against France?",
                "RUSSIA: True. So, will you support me to SWE this turn?",
                "GERMANY: Why stop against France now? I haven't take any centers so far. I need to make something out of this",
                "RUSSIA: Yeah, just take BEL",
                "GERMANY: Okay you have support to SWE. But can I at least get some info about the east",
                "GERMANY: Who is with who, what do you think who is a bot?",
                "RUSSIA: I think people are just doing what they think is best."
            ]
        }
    },
    "GERMANY-TURKEY": {
        "S1902M": {
            "mentioned": [
                "france"
            ],
            "start": {
                "GERMANY": [
                    "A BUR - GAS"
                ],
                "TURKEY": [
                    "F ANK - CON"
                ]
            },
            "end": {
                "GERMANY": [
                    "A BUR S A HOL - BEL"
                ],
                "TURKEY": [
                    "F ANK - BLA"
                ]
            },
            "messages": [
                "TURKEY: Wow you really screwed France over! Well played",
                "GERMANY: He did that to himself",
                "TURKEY: True, that is a shame. I hope that this doesn't mean that you are focusing solely on him!",
                "GERMANY: Russia seems to work with Austria",
                "TURKEY: That's unfortunate, but I hope that it won't last",
                "GERMANY: You have to pressure Italy to do something then"
            ]
        },
        "S1904M": {
            "mentioned": [
                "france",
                "italy"
            ],
            "start": {
                "GERMANY": [
                    "A BEL - RUH",
                    "A MUN - SIL",
                    "A PRU - LVN",
                    "A SIL - PRU",
                    "F DEN - BAL"
                ],
                "TURKEY": [
                    "A SER S A RUM",
                    "F AEG S F GRE",
                    "F GRE S F AEG"
                ]
            },
            "end": {
                "GERMANY": [
                    "A BEL - PIC",
                    "A MUN H",
                    "A PRU - SIL",
                    "A SIL - GAL",
                    "F DEN H"
                ],
                "TURKEY": [
                    "A SER S F GRE - ALB",
                    "F AEG - GRE",
                    "F GRE - ALB"
                ]
            },
            "messages": [
                "TURKEY: Will you be able to take War this turn?",
                "TURKEY: It looks like England might be able to get Stp, so Russia will be pretty much finished",
                "GERMANY: I don't think people here are interested in fighting Russia anymore seeing you profit the most",
                "TURKEY: I would hope that we would still be able to work together after I did what I did. If you can take France and England, I can go after Russia and Italy. And I think that we would make strong allies",
                "GERMANY: I can't fight England AND France alone",
                "TURKEY: France is barely even a threat. England has three fleets to your one",
                "GERMANY: Exactly. How can I fight both of them?"
            ]
        },
        "F1907M": {
            "mentioned": [
                "russia"
            ],
            "start": {
                "TURKEY": [
                    "A RUM S A BUD"
                ]
            },
            "end": {
                "TURKEY": [
                    "A RUM - GAL"
                ]
            },
            "messages": [
                "TURKEY: nice, russia will soon be dead :)",
                "TURKEY: just dont move, you might live this turn"
            ]
        }
    },
    "ITALY-RUSSIA": {
        "S1902M": {
            "mentioned": [
                "tun"
            ],
            "start": {
                "ITALY": [
                    "A NAP - GRE VIA",
                    "F ION C A NAP - GRE"
                ],
                "RUSSIA": [
                    "A MOS - UKR",
                    "F BOT - STP/SC"
                ]
            },
            "end": {
                "ITALY": [
                    "A NAP - TUN VIA",
                    "F ION C A NAP - TUN"
                ],
                "RUSSIA": [
                    "A MOS - STP",
                    "F BOT - SWE"
                ]
            },
            "messages": [
                "RUSSIA: Well, looks like you could have gotten TUN.",
                "ITALY: Well yeah, I always can pick up Tunis.",
                "RUSSIA: True. What are you thinking about for this turn? Are you and Austria able to work out a deal over GRE?",
                "ITALY: Not Austria and I, but the Turks and I have.",
                "RUSSIA: Interesting.",
                "ITALY: Or, apparently not. The Turks are replicants, alas."
            ]
        }
    },
    "ITALY-TURKEY": {
        "S1902M": {
            "mentioned": [
                "nap"
            ],
            "start": {
                "ITALY": [
                    "A NAP - ALB VIA",
                    "F ION C A NAP - ALB"
                ],
                "TURKEY": [
                    "F ANK - CON"
                ]
            },
            "end": {
                "ITALY": [
                    "A NAP - TUN VIA",
                    "F ION C A NAP - TUN"
                ],
                "TURKEY": [
                    "F ANK - BLA"
                ]
            },
            "messages": [
                "TURKEY: Sorry I didn't get that message in time, it is all yours this turn, would you want support into Greece or can I tap Serbia?",
                "ITALY: I'd like your support.",
                "TURKEY: Okay, I will tap Serbia then",
                "ITALY: No, I'd like you to support me into Greece.",
                "ITALY: Support Naples to Greece, please.",
                "TURKEY: I'm sorry, I need to use my army to tap Serbia, otherwise I can't make sure that you get it this turn",
                "ITALY: That doesn't make any sense.",
                "TURKEY: How so? It means that I can tap Serbia this turn and take it next turn so that you can get it for sure. If I support you in now, you might not get it this turn, whereas if I tap Serbia, you will for sure get it",
                "TURKEY: Does that not make sense to you?",
                "ITALY: That's not even remotely how that works. If you support me this turn, it's a guaranteed in.",
                "ITALY: Literally guaranteed."
            ]
        },
        "S1904M": {
            "mentioned": [
                "alb",
                "gre"
            ],
            "start": {
                "TURKEY": [
                    "A SER S A RUM",
                    "F AEG S F GRE",
                    "F GRE S F AEG"
                ]
            },
            "end": {
                "TURKEY": [
                    "A SER S F GRE - ALB",
                    "F AEG - GRE",
                    "F GRE - ALB"
                ]
            },
            "messages": [
                "TURKEY: Will you be able to take Vie this year? Also, would you mind if I moved Gre-alb to get my fleet out of Gre?",
                "ITALY: I'm not sure if I'll be able to get VIE, but you can definitely do the Gre-alb play.",
                "ITALY: Albania's moving out and it's a guaranteed move.",
                "TURKEY: Great! I would suggest you also support yourself into Adr to disband that Austrian fleet",
                "ITALY: Yeah, I'm thinking that wouldn't be a bad idea."
            ]
        }
    }
}