{
    "AUSTRIA-FRANCE": {
        "F1903M": {
            "mentioned": [
                "italy"
            ],
            "start": {
                "AUSTRIA": [
                    "A TRI - VEN",
                    "F ADR S A TRI - VEN"
                ],
                "FRANCE": [
                    "A BEL S A BUR",
                    "A MAR S A BUR"
                ]
            },
            "end": {
                "AUSTRIA": [
                    "A TRI S F ADR - VEN",
                    "F ADR - VEN"
                ],
                "FRANCE": [
                    "A BEL S A HOL",
                    "A MAR - SPA"
                ]
            },
            "messages": [
                "FRANCE: Sorry, I just commited against England But I apreciate the offer!",
                "AUSTRIA: France, this offer was for last turn.",
                "FRANCE: My bad, sorry! Only saw it later.",
                "AUSTRIA: Are you willing to help me against Italy in the future?",
                "FRANCE: Generally, yes"
            ]
        },
        "S1904M": {
            "mentioned": [
                "germany"
            ],
            "start": {
                "AUSTRIA": [
                    "A SER S A TRI - ALB",
                    "A TRI - ALB",
                    "A TYR - VEN",
                    "A VIE - TRI",
                    "F VEN - APU"
                ],
                "FRANCE": [
                    "A BEL - RUH",
                    "A BUR - MUN"
                ]
            },
            "end": {
                "AUSTRIA": [
                    "A SER S A VIE - BUD",
                    "A TRI S F VEN",
                    "A TYR - PIE",
                    "A VIE - BUD",
                    "F VEN H"
                ],
                "FRANCE": [
                    "A BEL - HOL",
                    "A BUR - RUH"
                ]
            },
            "messages": [
                "AUSTRIA: France, is there anything I can do to convince you to send an army towards Italy?",
                "AUSTRIA: I will guarantee you Tunis and Rome if you help me.",
                "FRANCE: How about a three way allience with you and Russia? We could work on Italy and germany together."
            ]
        },
        "F1904M": {
            "mentioned": [
                "mar"
            ],
            "start": {
                "FRANCE": [
                    "A MAR - BUR",
                    "A WAL - YOR",
                    "F IRI - ENG"
                ]
            },
            "end": {
                "FRANCE": [
                    "A MAR H",
                    "A WAL - LON",
                    "F IRI - NAO"
                ]
            },
            "messages": [
                "FRANCE: Hey, what are your plans now?",
                "AUSTRIA: My plans are to keep attacking Italy.",
                "FRANCE: Great. How are you getting along with Russia?",
                "AUSTRIA: What is your plan with the army in Marseilles?",
                "FRANCE: No plans just yet"
            ]
        },
        "S1906M": {
            "mentioned": [
                "germany"
            ],
            "start": {
                "FRANCE": [
                    "A BEL S A RUH",
                    "A PIC S A BEL",
                    "A RUH S A BEL"
                ]
            },
            "end": {
                "FRANCE": [
                    "A BEL - HOL",
                    "A PIC - BEL",
                    "A RUH S A BEL - HOL"
                ]
            },
            "messages": [
                "AUSTRIA: Why did you build in Marseilles?",
                "FRANCE: England might go to MAO and threaten Iberia.",
                "AUSTRIA: If you want me to help you with Germany, I will need you to help me against Italy.",
                "FRANCE: Okay sure, I'll come to your aid then"
            ]
        }
    },
    "AUSTRIA-RUSSIA": {
        "S1902M": {
            "mentioned": [
                "bul",
                "gal",
                "ser",
                "turkey",
                "rum"
            ],
            "start": {
                "AUSTRIA": [
                    "A SER - GRE",
                    "F GRE - AEG"
                ],
                "RUSSIA": [
                    "A GAL H"
                ]
            },
            "end": {
                "AUSTRIA": [
                    "A SER - BUL",
                    "F GRE S A SER - BUL"
                ],
                "RUSSIA": [
                    "A GAL S F RUM"
                ]
            },
            "messages": [
                "AUSTRIA: I don't know why you moved to Galicia last phase. Can we please work together?",
                "AUSTRIA: Your army can be used in Rumania and your fleet can be used in the Black Sea.",
                "RUSSIA: i ran out of time to change my orders; i  know you may not buy that excuse but i hope youll let me correct it this turn. Can I support you to Bul? And ill withdraw from Gal.",
                "AUSTRIA: I am going to take Bulgaria with Serbia this phase, and please withdraw Galicia.",
                "AUSTRIA: Hello?",
                "AUSTRIA: Russia, this isn't going to work if you don't communicate.",
                "RUSSIA: That works for me. Should I force Bla? Let me know what's best. Has turkey made an offer?"
            ]
        },
        "F1902M": {
            "mentioned": [
                "con",
                "bla",
                "turkey"
            ],
            "start": {
                "AUSTRIA": [
                    "A BUL - CON",
                    "F GRE H"
                ],
                "RUSSIA": [
                    "A STP - NWY"
                ]
            },
            "end": {
                "AUSTRIA": [
                    "A BUL S F BLA - CON",
                    "F GRE S A BUL"
                ],
                "RUSSIA": [
                    "A STP H"
                ]
            },
            "messages": [
                "AUSTRIA: What do you want to do this phase?",
                "AUSTRIA: I am happy to cut Constantinople this phase.",
                "RUSSIA: I stayed in gal because i was worried you'd force me out. But i am moving out this turn to save SEV. I am also going to move bla to Con. If you want to support I'd be grateful. It looks like Italy and Turkey cut a deal against us and I hope we can react. I am grateful for any help.",
                "RUSSIA: Turkey is very very mad at me lol"
            ]
        },
        "F1903M": {
            "mentioned": [
                "italy"
            ],
            "start": {
                "AUSTRIA": [
                    "A TRI - VEN",
                    "F ADR S A TRI - VEN"
                ]
            },
            "end": {
                "AUSTRIA": [
                    "A TRI S F ADR - VEN",
                    "F ADR - VEN"
                ]
            },
            "messages": [
                "AUSTRIA: Russia, what is your plan? I think you should move Galicia to Warsaw with support from Moscow.",
                "AUSTRIA: If I were you, I would order Livonia supports St. Petersburg to hold, Moscow supports Galicia to Warsaw, Sevastopol to Rumania.",
                "RUSSIA: Is there any way you can bounce me in rum? Just to cover it. But understand if busy with italy. Im in a guessing game with Turkey's fleet."
            ]
        },
        "F1904M": {
            "mentioned": [
                "ber",
                "war"
            ],
            "start": {
                "RUSSIA": [
                    "A MOS S A SIL - WAR",
                    "A PRU - BER",
                    "A SIL - WAR",
                    "F LVN - BAL"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A MOS - WAR",
                    "A PRU S A SIL - BER",
                    "A SIL - BER",
                    "F LVN - STP/SC"
                ]
            },
            "messages": [
                "AUSTRIA: Great moves! You should be able to take Berlin.",
                "AUSTRIA: But be careful because Warsaw might be able to retreat to Galicia.",
                "RUSSIA: Unfortunately i may not if Munich covers and War makes the right  move. Can you please keep me as your buddy in the east? You'r e doing graet and I know Rum is tempting. I would appreciate it if you didnt take it; eventually I'll support you into Bul.",
                "AUSTRIA: Do you want me to cover Rumania by bouncing it with Budapest?",
                "AUSTRIA: Also, you could support yourself into Berlin and support yourself into St. Petersburg.",
                "RUSSIA: Bouncing sounds sick. Thank you.",
                "AUSTRIA: What do you think?",
                "RUSSIA: I kinda want berlin for funsies lmao"
            ]
        }
    },
    "AUSTRIA-TURKEY": {
        "S1902M": {
            "mentioned": [
                "russia",
                "rum"
            ],
            "start": {
                "AUSTRIA": [
                    "A SER - GRE",
                    "F GRE - AEG"
                ],
                "TURKEY": [
                    "A BUL - RUM",
                    "F BLA S A BUL - RUM"
                ]
            },
            "end": {
                "AUSTRIA": [
                    "A SER - BUL",
                    "F GRE S A SER - BUL"
                ],
                "TURKEY": [
                    "A BUL S F RUM",
                    "F BLA S A BUL"
                ]
            },
            "messages": [
                "AUSTRIA: Turkey, I am really concerned about your silence.",
                "AUSTRIA: If you don't respond, I will have to bounce you out of the Aegean Sea, but I would prefer not to do that.",
                "TURKEY: I'm not being silent. You are either gaslighting me or not receiving my messages via this platform. I'm concerned you supported R into Rum and have an AR going. Can we descalate? We're in a good spot to do an AT.",
                "AUSTRIA: I supported Russia because I am really concerned about their Northern opening.",
                "TURKEY: So you are getting my messages? Why are you concerned about a R northern opening? That's good for you."
            ]
        },
        "F1902M": {
            "mentioned": [
                "con",
                "bla",
                "bul"
            ],
            "start": {
                "AUSTRIA": [
                    "A BUL - CON",
                    "F GRE H"
                ]
            },
            "end": {
                "AUSTRIA": [
                    "A BUL S F BLA - CON",
                    "F GRE S A BUL"
                ]
            },
            "messages": [
                "AUSTRIA: Turkey, I am sorry. I took Bulgaria because you stopped sending me press.",
                "TURKEY: You're lying. You got my messages. You're just making excuses.",
                "AUSTRIA: Let's figure out how to fix this.",
                "AUSTRIA: I am going to support Bulgaria to hold. Please use Constantinople to cut the Black Sea.",
                "TURKEY: You still have not responded about whether you're getting my messages. You only seem to not get my messages when its convenient for you. If you get my messages please confirm you're getting my messages."
            ]
        },
        "F1903M": {
            "mentioned": [
                "bul"
            ],
            "start": {
                "AUSTRIA": [
                    "A TRI - VEN",
                    "F ADR S A TRI - VEN"
                ],
                "TURKEY": [
                    "F BLA S F CON - BUL/SC"
                ]
            },
            "end": {
                "AUSTRIA": [
                    "A TRI S F ADR - VEN",
                    "F ADR - VEN"
                ],
                "TURKEY": [
                    "F BLA S F CON - BUL"
                ]
            },
            "messages": [
                "AUSTRIA: Turkey, I will move Bulgaria to Greece.",
                "AUSTRIA: I hope you see this in time.",
                "TURKEY: okay sounds good"
            ]
        },
        "S1906M": {
            "mentioned": [
                "con",
                "bla",
                "bul",
                "ank"
            ],
            "start": {
                "TURKEY": [
                    "A BUL - CON",
                    "F ANK S A BUL - CON",
                    "F BLA S A BUL - CON"
                ]
            },
            "end": {
                "TURKEY": [
                    "A BUL S F BLA - CON",
                    "F ANK S F BLA - CON",
                    "F BLA - CON"
                ]
            },
            "messages": [
                "AUSTRIA: Turkey, why didn't you take Constantinople?",
                "AUSTRIA: Turkey, you should move Black Sea to Constantinople.",
                "TURKEY: I took Ank Instead. If I take Con now they can then move to Gre in fall.",
                "AUSTRIA: To guarantee that you take Constantinople, you need to support Black Sea to Constantinople with Ankara and Bulgaria."
            ]
        }
    },
    "ENGLAND-FRANCE": {
        "S1901M": {
            "mentioned": [
                "yor"
            ],
            "start": {
                "ENGLAND": [
                    "A LVP - EDI"
                ]
            },
            "end": {
                "ENGLAND": [
                    "A LVP - YOR"
                ]
            },
            "messages": [
                "ENGLAND: Hey France! I really do think the f/e alliance is really strong, if we work together to knock Germany down quickly then we can go our separate ways without having to worry too much about a stab",
                "FRANCE: Hey, I love the EF-alliance as well. Would really be in favor of working with you.",
                "FRANCE: Would you like to start by keeping the Channel open?",
                "ENGLAND: Keeping the channel open is good by me",
                "ENGLAND: I'll open to Yor and North, and we can try to decide what to do with Belgium in the fall",
                "ENGLAND: Does that sound good?",
                "FRANCE: Sounds terrific! Let's have a good game together!\n",
                "ENGLAND: Have you heard anything from Germany yet? They sent me a very short message asking about Belgium",
                "FRANCE: Yeah, they seem to ask a lot. I would prefer working with you.\n",
                "ENGLAND: Also, how would you feel about me taking Belgium? I think the best way for me to effectively fight Germany is with an army on the mainland",
                "FRANCE: I'm fine with giving it to you. I can still can take two in Iberia."
            ]
        },
        "S1902M": {
            "mentioned": [
                "germany",
                "bre",
                "russia"
            ],
            "start": {
                "ENGLAND": [
                    "A NWY S F SWE",
                    "F EDI - NTH"
                ],
                "FRANCE": [
                    "A BEL S A MAR - BUR",
                    "F BRE - MAO",
                    "F POR - SPA/SC"
                ]
            },
            "end": {
                "ENGLAND": [
                    "A NWY S A DEN - SWE",
                    "F EDI - CLY"
                ],
                "FRANCE": [
                    "A BEL - BUR",
                    "F BRE - ENG",
                    "F POR - MAO"
                ]
            },
            "messages": [
                "ENGLAND: Looks like you've decided to move against me, unfortunately. What do you expect to get out of this? Do you think that Germany will let you have all of my centers while they try to fight Russia?",
                "FRANCE: Sorry, I'm confused. Did you get my message during Winter? I got spooked since you didn't answer and built F Bre. I'm still all in on working with you if you're still up or it.",
                "ENGLAND: I'm afraid I'm going to have to defend against you, and that's going to tie up my units. Hopefully you'll change your mind and we can work together. I'd be happy to work with you against Germany instead of the other way around",
                "FRANCE: If you want to that's alright. I'd prefer dropping into Helgoland and Ruhr this turn though if you'd be up for it."
            ]
        },
        "F1902M": {
            "mentioned": [
                "bur"
            ],
            "start": {
                "FRANCE": [
                    "A BEL H"
                ]
            },
            "end": {
                "FRANCE": [
                    "A BEL S A GAS - BUR"
                ]
            },
            "messages": [
                "FRANCE: Look, we have not gotten of to the best start, but I still think working together would best for both of us. Germany is completely exposed. Let's move on them together! What are you gonna get out of working ",
                "ENGLAND: I agree. I'm not convinced you plan to work with me, but you're right that attacking Germany is better for both of us",
                "ENGLAND: Unfortunately, I'm going to need to move to defend myself against you, but we can coordinate after you show that you're not still attacking me",
                "ENGLAND: I can't do much against Germany this turn, but I should be able to next turn",
                "FRANCE: Would moving to Bur be a good start? I can't let you have the chanel but I'm not going any further North",
                "ENGLAND: If you're really not planning to attack me, would you consider moving one of your fleets south? There's no point in us both wasting units in a stalemate",
                "FRANCE: Are you going to NAO this turn? if not, I can do that."
            ]
        },
        "F1903M": {
            "mentioned": [
                "germany",
                "hol"
            ],
            "start": {
                "ENGLAND": [
                    "A NWY S A SWE",
                    "F LON S F NTH"
                ],
                "FRANCE": [
                    "A BEL S A BUR",
                    "A MAR S A BUR"
                ]
            },
            "end": {
                "ENGLAND": [
                    "A NWY H",
                    "F LON H"
                ],
                "FRANCE": [
                    "A BEL S A HOL",
                    "A MAR - SPA"
                ]
            },
            "messages": [
                "ENGLAND: I'm going to make sure that you get none of my centers. I'm not going to let you convoy into England",
                "ENGLAND: I'll make sure you can't make any progress unless you move against Germany or Italy",
                "ENGLAND: Also, attacking me will take forever. Why not move against Italy while they're weak?",
                "FRANCE: We'll see how it goes... Let's keep the diplomatic channel open and see if we can work something out in the future.",
                "ENGLAND: I still think our borders would be much cleaner if you had moved ENG-MAO, MAO-WES",
                "ENGLAND: Would you be willing to fight Germany if I support you into Holland next year?",
                "FRANCE: Yes, we can absolutely talk about that."
            ]
        },
        "S1904M": {
            "mentioned": [
                "germany",
                "hol"
            ],
            "start": {
                "FRANCE": [
                    "A BEL - RUH",
                    "A BUR - MUN"
                ]
            },
            "end": {
                "FRANCE": [
                    "A BEL - HOL",
                    "A BUR - RUH"
                ]
            },
            "messages": [
                "ENGLAND: Would you be willing to negotiate? I think we would both benefit from working together. I'd let you keep Liverpool if you work with me.",
                "ENGLAND: Your number one threat right now is Germany, not me. I'm no threat to you, and I can help you against Germany. If you continue to attack me, you won't get any centers, but Germany will",
                "FRANCE: Yes, okay. How about I put NTH into Hol? I'm happy to keep you around. you are right about Germany.",
                "FRANCE: Let me know what you think!",
                "ENGLAND: Once Germany gets my centers, they're going to attack you. You don't have enough units to attack Germany, so they will come for you next."
            ]
        },
        "F1905M": {
            "mentioned": [
                "bel"
            ],
            "start": {
                "FRANCE": [
                    "A BUR - MAR"
                ]
            },
            "end": {
                "FRANCE": [
                    "A BUR S A BEL"
                ]
            },
            "messages": [
                "FRANCE: Let's be frank: I'll guarantee Edi this turn anyway. But do you want to take Holland? I'd rather see you have it than Germany.",
                "ENGLAND: I'm not sure if I can trust you",
                "ENGLAND: I don't think I'm going to be able to take Holland anyway. You can guarantee that you'll take it by supporting Ruhr into Holland with Belgium",
                "ENGLAND: Germany won't be able to defend both Holland and Munich",
                "FRANCE: good point, I'll do that then"
            ]
        },
        "S1906M": {
            "mentioned": [
                "germany"
            ],
            "start": {
                "FRANCE": [
                    "A BUR S A RUH - MUN",
                    "A RUH - MUN"
                ]
            },
            "end": {
                "FRANCE": [
                    "A BUR S A RUH",
                    "A RUH S A BEL - HOL"
                ]
            },
            "messages": [
                "ENGLAND: Can you leave London alone? I'll let you keep Edinburgh",
                "ENGLAND: If I let you take London, will you let me move ENG to MAO?",
                "ENGLAND: Germany is going to take North Sea this turn, so you should move Edinburgh there to bounce them",
                "ENGLAND: If you let me take Portugal, I'll leave you alone",
                "FRANCE: Ok, deal"
            ]
        }
    },
    "ENGLAND-RUSSIA": {
        "S1902M": {
            "mentioned": [
                "nwy"
            ],
            "start": {
                "ENGLAND": [
                    "A NWY S F SWE",
                    "F EDI - NTH"
                ],
                "RUSSIA": [
                    "A GAL H"
                ]
            },
            "end": {
                "ENGLAND": [
                    "A NWY S A DEN - SWE",
                    "F EDI - CLY"
                ],
                "RUSSIA": [
                    "A GAL S F RUM"
                ]
            },
            "messages": [
                "ENGLAND: Are you open to communicating now?",
                "RUSSIA: Yes; how can we fix this? The army move to norway is a huge problem for me. Please let me know if there's a way out. ",
                "ENGLAND: Hello?",
                "RUSSIA: I will hold this turn. And support you to Skag if you want me to. How's that?"
            ]
        },
        "F1903M": {
            "mentioned": [
                "nwy"
            ],
            "start": {
                "ENGLAND": [
                    "A NWY S A SWE",
                    "F LON S F NTH"
                ],
                "RUSSIA": [
                    "A STP H",
                    "F SEV H"
                ]
            },
            "end": {
                "ENGLAND": [
                    "A NWY H",
                    "F LON H"
                ],
                "RUSSIA": [
                    "A STP S A NWY",
                    "F SEV - RUM"
                ]
            },
            "messages": [
                "ENGLAND: It looks like things are looking up for you. You should be able to retake Warsaw this turn. Do you think you'll be able to support hold Norway?",
                "ENGLAND: If not, I'll be forced to keep working with Germany, which I don't think either of us want",
                "RUSSIA: I will support hold norway if you'll lay off me. Deal? I dont have options and so you're my best.",
                "ENGLAND: I'm trying to convince Germany to work with me, but I don't know if they will. If they don't, we can work together",
                "ENGLAND: Can you support hold me in Norway?",
                "RUSSIA: Can you commit to me? I will support you in Nor. Germany wont lay off you after im dead. and ill be dead soon without your help."
            ]
        },
        "F1904M": {
            "mentioned": [
                "germany",
                "stp",
                "ber"
            ],
            "start": {
                "ENGLAND": [
                    "F ENG - LON"
                ],
                "RUSSIA": [
                    "A MOS S A SIL - WAR",
                    "A PRU - BER",
                    "A SIL - WAR",
                    "F LVN - BAL"
                ]
            },
            "end": {
                "ENGLAND": [
                    "F ENG - BEL"
                ],
                "RUSSIA": [
                    "A MOS - WAR",
                    "A PRU S A SIL - BER",
                    "A SIL - BER",
                    "F LVN - STP/SC"
                ]
            },
            "messages": [
                "RUSSIA: I dont like the retreat to STP but i understand it. Please dont help Germany.",
                "ENGLAND: Sorry. It was the only way to get Germany to work with me",
                "RUSSIA: Can you please take no hostile action this turn? And please tell me what Berlin is doing?",
                "ENGLAND: I don't know what Germany is planning to do",
                "RUSSIA: Can you try to recover norway from STP? If it doesnt work its fine."
            ]
        },
        "S1905M": {
            "mentioned": [
                "stp"
            ],
            "start": {
                "ENGLAND": [
                    "A STP - MOS",
                    "F ENG - MAO"
                ]
            },
            "end": {
                "ENGLAND": [
                    "A STP H",
                    "F ENG - LON"
                ]
            },
            "messages": [
                "RUSSIA: Can we please just hold our positions this turn? We are both weak. I got stabbed by AUS, you are under pressure by F and G will turn on you if he thinks he has more to gain that way.",
                "ENGLAND: I'm holding in Stp this turn",
                "ENGLAND: We're both in very weak positions right now. We need to work together if we want to survive",
                "RUSSIA: OK. I may bounce Mos but i wont move against you.",
                "RUSSIA: Yes, i agree. We are in terrible shape. But I think we can survive to the end."
            ]
        }
    },
    "ENGLAND-TURKEY": {
        "S1902M": {
            "mentioned": [
                "bla",
                "russia",
                "germany",
                "rum"
            ],
            "start": {
                "ENGLAND": [
                    "A NWY S F SWE",
                    "F EDI - NTH"
                ],
                "TURKEY": [
                    "A BUL - RUM",
                    "F BLA S A BUL - RUM"
                ]
            },
            "end": {
                "ENGLAND": [
                    "A NWY S A DEN - SWE",
                    "F EDI - CLY"
                ],
                "TURKEY": [
                    "A BUL S F RUM",
                    "F BLA S A BUL"
                ]
            },
            "messages": [
                "ENGLAND: I'm happy to see you take Black Sea. I'd appreciate it if you could continue to work against Russia. They're getting pretty strong.\n\nAny information you can share about Russia, France, and Germany's plans would be greatly appreciated",
                "TURKEY: My main goal now is to survive this AR so yes I'm working with you.",
                "ENGLAND: You might even be able to get Austria to support you to Rum, depending on how they plan to use their armies"
            ]
        }
    },
    "FRANCE-GERMANY": {
        "F1901M": {
            "mentioned": [
                "ruh"
            ],
            "start": {
                "GERMANY": [
                    "A KIE - HOL",
                    "A RUH - MUN",
                    "F DEN - SWE"
                ]
            },
            "end": {
                "GERMANY": [
                    "A KIE - DEN",
                    "A RUH - HOL",
                    "F DEN - SKA"
                ]
            },
            "messages": [
                "GERMANY: France... you there?",
                "GERMANY: You can still turn back.",
                "FRANCE: Absolutely. I was just covering myself for now. I'm perfectly fine to work with you. How do yout think about Belgium?",
                "FRANCE: If you prefer not to tell me what Ruhr is doing that's understandable. But believe me: Bur is just there to be safe, not to do anything agressive.",
                "GERMANY: I'm gonna have to cover Munich to be safe, but I'm not gonna be trying to contest Belgium.",
                "FRANCE: That's perfectly fine. As I said: I understand if you are a bit worried but I'm not gonna run into you - don't worry!"
            ]
        },
        "S1902M": {
            "mentioned": [
                "eng",
                "bel",
                "mao",
                "bur"
            ],
            "start": {
                "FRANCE": [
                    "A BEL S A MAR - BUR",
                    "F BRE - MAO",
                    "F POR - SPA/SC"
                ],
                "GERMANY": [
                    "A HOL - RUH",
                    "A MUN - RUH",
                    "F KIE - HEL"
                ]
            },
            "end": {
                "FRANCE": [
                    "A BEL - BUR",
                    "F BRE - ENG",
                    "F POR - MAO"
                ],
                "GERMANY": [
                    "A HOL S A BEL",
                    "A MUN - KIE",
                    "F KIE - BAL"
                ]
            },
            "messages": [
                "FRANCE: Hey, I think we are on the same page now. Shall we move north on England together?",
                "GERMANY: Yes, let's do it. England has committed to fighting Russia so you should be able to get into the Channel and MAO.",
                "GERMANY: Do you want support for Belgium?",
                "FRANCE: Support for Bel shouldn't be needed this turn but I'm happy to move my fleets north. Let's do this! We can have a great game together I think!",
                "GERMANY: Also, can we keep Burgundy clear?",
                "FRANCE: Yes, we can do that. Are you moving to Helgoland?",
                "FRANCE: That's the kind of commitment I would want to see in return for moving all out on England myself and keeping Bur free.",
                "GERMANY: France?",
                "GERMANY: France? Please respond.",
                "FRANCE: Yes, I'm going North. Are you going to Helgoland?"
            ]
        },
        "F1903M": {
            "mentioned": [
                "mar",
                "bel",
                "spa"
            ],
            "start": {
                "FRANCE": [
                    "A BEL S A BUR",
                    "A MAR S A BUR"
                ],
                "GERMANY": [
                    "A HOL - RUH"
                ]
            },
            "end": {
                "FRANCE": [
                    "A BEL S A HOL",
                    "A MAR - SPA"
                ],
                "GERMANY": [
                    "A HOL S A MUN - RUH"
                ]
            },
            "messages": [
                "GERMANY: This worked out great!",
                "GERMANY: Can we please talk about our moves a bit? It's very hard to coordinate with silence.",
                "FRANCE: Absolutely! I'm all ears! What do you want to do now!",
                "FRANCE: Any designs on Norway? I think you could get it this turn. I'm gonna go against England, as you see. Let's work together on England.",
                "FRANCE: Come on mate, let's do better this turn and coordinate! What are your plans? I'm with you.",
                "FRANCE: Alright, let's use the additional time! What do we do?",
                "GERMANY: I'm moving Sweden to Norway.",
                "GERMANY: Can we also start Dmzing our border?",
                "FRANCE: Nice, with support from Hel that should work out.",
                "FRANCE: I'm not gonna move out of Belgium but I'll certainly not move any further either. I'm in against England. Can't fight both of you that's for sure.",
                "GERMANY: You should probably move Marseilles -> Spain.",
                "FRANCE: Oh because England might bring a fleet down? Good thought. Thank you!"
            ]
        },
        "S1904M": {
            "mentioned": [
                "nwy",
                "ruh"
            ],
            "start": {
                "FRANCE": [
                    "A BEL - RUH",
                    "A BUR - MUN"
                ],
                "GERMANY": [
                    "A SWE S F SKA - NWY",
                    "A UKR - SEV",
                    "F SKA - NWY"
                ]
            },
            "end": {
                "FRANCE": [
                    "A BEL - HOL",
                    "A BUR - RUH"
                ],
                "GERMANY": [
                    "A SWE - NWY",
                    "A UKR - WAR",
                    "F SKA S A SWE - NWY"
                ]
            },
            "messages": [
                "GERMANY: I'm sorry for moving to Ruhr. I got scared that you would try to move into Ruhr and Munich. I'm moving back South now.",
                "FRANCE: Totally get it. Don't worry!",
                "FRANCE: What do we do here? I suppose you try for Norway again?",
                "GERMANY: I'm moving Ruhr -> Munich, Baltic -> Denmark, and I'll take Norway. Can you move Spain -> Marseilles to help Italy against Austria?",
                "FRANCE: Sounds great. Yes, that's my plan to move East",
                "GERMANY: I'll also move Ruhr back to Munich.",
                "FRANCE: Ok, that works for me.",
                "GERMANY: Does this sound good?",
                "FRANCE: It does thanks"
            ]
        },
        "F1904M": {
            "mentioned": [
                "mar",
                "russia",
                "england"
            ],
            "start": {
                "FRANCE": [
                    "A MAR - BUR",
                    "F IRI - ENG"
                ],
                "GERMANY": [
                    "A WAR - MOS"
                ]
            },
            "end": {
                "FRANCE": [
                    "A MAR H",
                    "F IRI - NAO"
                ],
                "GERMANY": [
                    "A WAR - SIL"
                ]
            },
            "messages": [
                "FRANCE: I really did screw up here, sorry! England talked me into some shit that you were going to stab me. How can I make up for this?",
                "GERMANY: Move back to Burgundy. You also need to move Marseilles -> Piedmont, because Austria is working with Russia.",
                "GERMANY: Actually, can you move Ruhr to Burgundy and Marseilles to Piedmont? That would make it up to me.",
                "FRANCE: Okay, yeah, I'll do that.",
                "FRANCE: Can you support hold me in Belgium then?",
                "GERMANY: Can you confirm that you're moving Ruhr back?",
                "FRANCE: Yes, I'm doing that if you support hold me in Belgium"
            ]
        },
        "S1906M": {
            "mentioned": [
                "ruh"
            ],
            "start": {
                "FRANCE": [
                    "A BEL S A RUH",
                    "A PIC S A BEL",
                    "A RUH S A BEL"
                ]
            },
            "end": {
                "FRANCE": [
                    "A BEL - HOL",
                    "A PIC - BEL",
                    "A RUH S A BEL - HOL"
                ]
            },
            "messages": [
                "GERMANY: You're not going to make any progress against me. Are you willing to make a deal?",
                "FRANCE: Yes! What do you have in mind?",
                "GERMANY: For example, you could leave Ruhr and not attack me for one turn, so I could take back Ruhr.",
                "FRANCE: Okay"
            ]
        }
    },
    "FRANCE-ITALY": {
        "S1903M": {
            "mentioned": [
                "mar",
                "bur"
            ],
            "start": {
                "FRANCE": [
                    "A BEL - WAL VIA",
                    "A MAR - SPA"
                ],
                "ITALY": [
                    "A ALB - TRI",
                    "A VEN S A ALB - TRI",
                    "F AEG - GRE",
                    "F ION - ADR"
                ]
            },
            "end": {
                "FRANCE": [
                    "A BEL S A BUR",
                    "A MAR S A BUR"
                ],
                "ITALY": [
                    "A ALB - GRE",
                    "A VEN - TYR",
                    "F AEG S A ALB - GRE",
                    "F ION S A ALB - GRE"
                ]
            },
            "messages": [
                "ITALY: Nice work getting into Bur! You should be able to convoy Pic-wal now, which will really put you in a good position.",
                "FRANCE: Agreed! What's new in the East? Any promises out of Turkey or Russia?",
                "ITALY: I really hope that we can keep our DMZ of Pie, Gol, and West Med.",
                "FRANCE: It stands yes. I'm not coming for you!",
                "ITALY: What are you planning to do with your army in Marseilles?",
                "FRANCE: Support Bur to hold.",
                "ITALY: ?"
            ]
        },
        "F1903M": {
            "mentioned": [
                "germany",
                "mar"
            ],
            "start": {
                "FRANCE": [
                    "A BEL S A BUR",
                    "A MAR S A BUR"
                ]
            },
            "end": {
                "FRANCE": [
                    "A BEL S A HOL",
                    "A MAR - SPA"
                ]
            },
            "messages": [
                "ITALY: I'd really appreciate if you could move out of Marseilles, we should have a pretty stable DMZ.",
                "FRANCE: Okay, let's do that!",
                "ITALY: Nice work getting into Wal!",
                "FRANCE: Thanks!",
                "FRANCE: You seem to be in trouble with Austria",
                "ITALY: What are you planning to do once you finish off England? I would suggest that you try to take some of Germany's centers before they get too big, because otherwise they'll be able to secure a solo victory.",
                "FRANCE: Yeah, I agree. Just hedging my bets, waiting for the right moment."
            ]
        }
    },
    "FRANCE-RUSSIA": {
        "S1904M": {
            "mentioned": [
                "germany",
                "bur"
            ],
            "start": {
                "FRANCE": [
                    "A BEL - RUH",
                    "A BUR - MUN"
                ]
            },
            "end": {
                "FRANCE": [
                    "A BEL - HOL",
                    "A BUR - RUH"
                ]
            },
            "messages": [
                "FRANCE: Hey, what are your connections in the East? I feel like we have always been friendly and I want it to stay like that. We are natural allies. How do we take this from here? I think I can move on Germany soon.",
                "FRANCE: How about a three way allience between you, Austria and myself?",
                "RUSSIA: I would love anything that lets me survive. But I kinda need support against Germany. Please at least do not withdraw from Bur? You could get Munich for free, he probably wont cover it.",
                "FRANCE: No, I will keep the pressure up on Germany. I'm on your side!"
            ]
        }
    },
    "FRANCE-TURKEY": {
        "S1906M": {
            "mentioned": [
                "italy"
            ],
            "start": {
                "FRANCE": [
                    "A BEL S A RUH",
                    "A PIC S A BEL",
                    "A RUH S A BEL"
                ],
                "TURKEY": [
                    "A BUL - CON",
                    "F ANK S A BUL - CON",
                    "F BLA S A BUL - CON"
                ]
            },
            "end": {
                "FRANCE": [
                    "A BEL - HOL",
                    "A PIC - BEL",
                    "A RUH S A BEL - HOL"
                ],
                "TURKEY": [
                    "A BUL S F BLA - CON",
                    "F ANK S F BLA - CON",
                    "F BLA - CON"
                ]
            },
            "messages": [
                "FRANCE: Can you work something out with italy? I think Austria is your common enemy here.",
                "TURKEY: I've tried, Italy keeps attacking me",
                "FRANCE: Italy is willing to work with you - you should talk to them!",
                "TURKEY: They want me to abandon my home centers and attack Austria. I don't trust them and why should I want to hurt Austria when Italy is the one that stabbed me",
                "FRANCE: They are being genuine. I think you can grow this way."
            ]
        }
    },
    "GERMANY-RUSSIA": {
        "F1902M": {
            "mentioned": [
                "stp"
            ],
            "start": {
                "GERMANY": [
                    "A HOL S A BEL"
                ],
                "RUSSIA": [
                    "A STP - NWY"
                ]
            },
            "end": {
                "GERMANY": [
                    "A HOL - RUH"
                ],
                "RUSSIA": [
                    "A STP H"
                ]
            },
            "messages": [
                "GERMANY: Russia, please respond.",
                "GERMANY: Russia???",
                "RUSSIA: I thought I did? Look i am not upset about sweden i knew it was happening. But i would still like to work with you. England will stab you when he's finished with me and he has an advantage being in north sea and at edge of board. Any way you'd support STP to Norway this turn? It lets me stay at parity and I will be your dutiful ally in the North for the duration of the match. No one solos, i just need afriend to keep centerrs. ",
                "RUSSIA: Please let me know Germany; I know you've got a good thing going with England but good things with England usually go poorly in the end. And I'm very reasonable and don't really ask for much out of the North; you'd be welcome to the bulk."
            ]
        },
        "S1903M": {
            "mentioned": [
                "lvn"
            ],
            "start": {
                "GERMANY": [
                    "A LVN - STP",
                    "A MUN - BUR",
                    "F BAL S A SWE",
                    "F SKA - NTH"
                ]
            },
            "end": {
                "GERMANY": [
                    "A LVN - WAR",
                    "A MUN - SIL",
                    "F BAL - BOT",
                    "F SKA S A SWE"
                ]
            },
            "messages": [
                "GERMANY: Okay, what do you propose? I'm willing to change my mind.",
                "RUSSIA: I'm willing to support you to Nor and against England generally if you were to pull out of Livonia. He cant resist you, isnt the best long term partner, and you have to guard against france anyway. What do you think? Look I know you have leverage here. But I think I'm a durable partner in the long run.",
                "RUSSIA: I take by your silence that you're staying the course! But ever willing to adjust if you chnage your mind.",
                "GERMANY: Are you there?",
                "RUSSIA: Yes."
            ]
        },
        "S1904M": {
            "mentioned": [
                "swe",
                "england",
                "ukr",
                "war"
            ],
            "start": {
                "GERMANY": [
                    "A SWE S F SKA - NWY",
                    "A UKR - SEV",
                    "F SKA - NWY"
                ]
            },
            "end": {
                "GERMANY": [
                    "A SWE - NWY",
                    "A UKR - WAR",
                    "F SKA S A SWE - NWY"
                ]
            },
            "messages": [
                "GERMANY: Why did you support England?",
                "RUSSIA: Because you expected to keep warsaw lol",
                "RUSSIA: Please move Ukr to Gal. If you do that, we can reset. You hvae taken both warsaw and swe from me and lied several times, it was not reasonable for you to expect any moves other than the ones i made. I am still willing to let it all be in the past if i dont have german panzers in my territory. I am 100% candid.",
                "GERMANY: You said that you would stop attacking me, and then you immediately attacked me again.",
                "RUSSIA: because you have been a cunt all game? Jesus dude. Get your shit out of my territory and we can be friends. Its not hard.",
                "GERMANY: Look, I'll move Ukraine back if you stop attacking me.",
                "GERMANY: France is about to win this game, and I can't stop him if you keep helping him.",
                "RUSSIA: If you move to Gal, we have a deal."
            ]
        },
        "F1904M": {
            "mentioned": [
                "war"
            ],
            "start": {
                "GERMANY": [
                    "A WAR - MOS"
                ],
                "RUSSIA": [
                    "A MOS S A SIL - WAR",
                    "A PRU - BER",
                    "A SIL - WAR",
                    "F LVN - BAL"
                ]
            },
            "end": {
                "GERMANY": [
                    "A WAR - SIL"
                ],
                "RUSSIA": [
                    "A MOS - WAR",
                    "A PRU S A SIL - BER",
                    "A SIL - BER",
                    "F LVN - STP/SC"
                ]
            },
            "messages": [
                "GERMANY: Is there any chance that you'll stop attacking me?",
                "GERMANY: I just want to know why you think that attacking me is a good idea. France is going to win this game if you keep attacking me.",
                "RUSSIA: I dont care if france wins. I want your goddamn tank out of my goddamn dirt. Move to Gal. Please.",
                "GERMANY: If you stop attacking me, I'll move Warsaw back. I don't want to stay there.",
                "RUSSIA: Okay. That works."
            ]
        },
        "F1905M": {
            "mentioned": [
                "england"
            ],
            "start": {
                "GERMANY": [
                    "A HOL - BEL"
                ]
            },
            "end": {
                "GERMANY": [
                    "A HOL S F ENG - BEL"
                ]
            },
            "messages": [
                "RUSSIA: I am taking STP back. And I pulled away from you. Please don't support England.",
                "GERMANY: You should probably move Livonia to Warsaw.",
                "GERMANY: I won't support it.",
                "RUSSIA: Yeah; looks bad. And thanks. ",
                "GERMANY: Are you taking St. Petersburg with your fleet or with your army?",
                "RUSSIA: I'll do it with the fleet if it furthers an alliance?",
                "RUSSIA: If you support the fleet that lets me spend the armies on warsaw."
            ]
        }
    },
    "GERMANY-TURKEY": {
        "S1902M": {
            "mentioned": [
                "bla",
                "russia",
                "bul",
                "rum"
            ],
            "start": {
                "GERMANY": [
                    "A HOL - RUH",
                    "A MUN - RUH",
                    "F KIE - HEL"
                ],
                "TURKEY": [
                    "A BUL - RUM",
                    "F BLA S A BUL - RUM"
                ]
            },
            "end": {
                "GERMANY": [
                    "A HOL S A BEL",
                    "A MUN - KIE",
                    "F KIE - BAL"
                ],
                "TURKEY": [
                    "A BUL S F RUM",
                    "F BLA S A BUL"
                ]
            },
            "messages": [
                "GERMANY: You might wanna move Smy -> Arm.",
                "GERMANY: Also supporting Bla -> Rum with Bul seems like a good move.",
                "TURKEY: Thanks. Are you working with Russia here?"
            ]
        },
        "S1903M": {
            "mentioned": [
                "austria"
            ],
            "start": {
                "GERMANY": [
                    "A LVN - STP",
                    "A MUN - BUR",
                    "F BAL S A SWE",
                    "F SKA - NTH"
                ],
                "TURKEY": [
                    "A ARM - SEV",
                    "F ANK S F CON - BLA",
                    "F CON - BLA"
                ]
            },
            "end": {
                "GERMANY": [
                    "A LVN - WAR",
                    "A MUN - SIL",
                    "F BAL - BOT",
                    "F SKA S A SWE"
                ],
                "TURKEY": [
                    "A ARM - SMY",
                    "F ANK - BLA",
                    "F CON - BUL/SC"
                ]
            },
            "messages": [
                "TURKEY: I have sent a lot of messages to Austria. They are either lying that they aren't getting them or there is something wrong with the app.",
                "GERMANY: What did Austria say?"
            ]
        },
        "S1904M": {
            "mentioned": [
                "ukr"
            ],
            "start": {
                "GERMANY": [
                    "A SWE S F SKA - NWY",
                    "A UKR - SEV",
                    "F SKA - NWY"
                ]
            },
            "end": {
                "GERMANY": [
                    "A SWE - NWY",
                    "A UKR - WAR",
                    "F SKA S A SWE - NWY"
                ]
            },
            "messages": [
                "GERMANY: Can you please support Ukraine -> Sevastopol?",
                "TURKEY: sorry not this turn",
                "GERMANY: If you support Ukraine -> Sevastopol, I'll support you into Rumania.",
                "TURKEY: I have to use BLA for something else this turn but I am open to it later"
            ]
        }
    },
    "ITALY-RUSSIA": {
        "S1902M": {
            "mentioned": [
                "austria"
            ],
            "start": {
                "ITALY": [
                    "A TUN H",
                    "A VEN H",
                    "F ION - AEG",
                    "F NAP - ION"
                ],
                "RUSSIA": [
                    "A GAL H"
                ]
            },
            "end": {
                "ITALY": [
                    "A TUN - ALB VIA",
                    "A VEN - TRI",
                    "F ION C A TUN - ALB",
                    "F NAP - APU"
                ],
                "RUSSIA": [
                    "A GAL S F RUM"
                ]
            },
            "messages": [
                "ITALY: Let me know what you're thinking!",
                "RUSSIA: Love the fleet build. Honestly, you drive: be as aggressive as possile and ill support you. ",
                "ITALY: Are you planning to force BLA?",
                "RUSSIA: Yes.",
                "ITALY: Also, do you think that there's a western triple happening?",
                "RUSSIA: Honestly owuld love to see some pressure on Austria though. with your armies. Re western triple, no, but possible EG. France built fleet in brest. "
            ]
        },
        "S1903M": {
            "mentioned": [
                "austria"
            ],
            "start": {
                "ITALY": [
                    "A ALB - TRI",
                    "A VEN S A ALB - TRI",
                    "F AEG - GRE",
                    "F ION - ADR"
                ]
            },
            "end": {
                "ITALY": [
                    "A ALB - GRE",
                    "A VEN - TYR",
                    "F AEG S A ALB - GRE",
                    "F ION S A ALB - GRE"
                ]
            },
            "messages": [
                "ITALY: We should really work together against Austria.",
                "ITALY: What are you planning to do with Gal?",
                "RUSSIA: I am debating moving it to Silesia as a suicide move against Germany. I feel like i need to stabilize for a turn but would continue to work with you if I survive. I am grateful for your moves last turn. I think you are quietly getting in the best position in the game!",
                "ITALY: What are you planning to do with your fleet in Rumania?",
                "ITALY: I think that you should be willing to let Turkey move into BLA this turn. If they move into Sev in the Fall, you should be able to defend it.",
                "RUSSIA: I am thinking i'll bounce SEV but open to ideas. I am also open to moving GAL to SIL or BOH if you want a chaos agent closer to middle of the board. I can only be useful to you by making unpredictable moves at this point; the standard play will have me die. "
            ]
        },
        "F1903M": {
            "mentioned": [
                "sev",
                "rum"
            ],
            "start": {
                "RUSSIA": [
                    "A STP H",
                    "F SEV H"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A STP S A NWY",
                    "F SEV - RUM"
                ]
            },
            "messages": [
                "ITALY: What are you planning to do with your fleet in Sev?",
                "RUSSIA: I will probably move to Rum. What can I do for you?",
                "ITALY: Are you planning to retake War?",
                "RUSSIA: Yes, I will.",
                "ITALY: What are you planning to do with your fleet in Sev?",
                "RUSSIA: I think i have to cover Rum. So that yo ucan take bul and it cant retreat. Otherwise it retreats there. I assume you'll take bul?"
            ]
        },
        "S1904M": {
            "mentioned": [
                "turkey"
            ],
            "start": {
                "ITALY": [
                    "A GRE - SER",
                    "F ADR - APU",
                    "F AEG - ION"
                ]
            },
            "end": {
                "ITALY": [
                    "A GRE - SMY VIA",
                    "F ADR S A ROM - APU",
                    "F AEG C A GRE - SMY"
                ]
            },
            "messages": [
                "ITALY: Do you think that Turkey is planning to betray you?",
                "ITALY: I would really appreciate it if you could negotiate a ceasefire with Germany, so that they could go and attack France.",
                "RUSSIA: I offered them one. If they move to Gal while I move out of gal. I need that contained tank gone. But idk if theyll take it. I agree france will consume us if we dont make a deal. Please let me know what turkeys planning? I have no idea.",
                "ITALY: What are you planning to do with your fleet in Rum?",
                "RUSSIA: Im in a coinflip; do you know what bla is doing?",
                "ITALY: I don't have any information about what Turkey is planning."
            ]
        }
    },
    "ITALY-TURKEY": {
        "S1902M": {
            "mentioned": [
                "tri",
                "austria",
                "russia",
                "alb",
                "rum"
            ],
            "start": {
                "ITALY": [
                    "A TUN H",
                    "A VEN H",
                    "F ION - AEG",
                    "F NAP - ION"
                ],
                "TURKEY": [
                    "A BUL - RUM",
                    "F BLA S A BUL - RUM"
                ]
            },
            "end": {
                "ITALY": [
                    "A TUN - ALB VIA",
                    "A VEN - TRI",
                    "F ION C A TUN - ALB",
                    "F NAP - APU"
                ],
                "TURKEY": [
                    "A BUL S F RUM",
                    "F BLA S A BUL"
                ]
            },
            "messages": [
                "ITALY: Let me know what you're thinking and if you would be interested in working together against Austria and Russia!",
                "TURKEY: Yes I would definately appreciate your help against this AR! I think if you convoy into Alb you'll have a good shot at Gre or Tri in the fall.",
                "ITALY: Also, I'm worried about a western triple so I might be willing to send my fleets West in the Fall. Let me know if there's anything else I can do to help you.",
                "TURKEY: Yes I need you to convoy to Alb and attack Gre or Tri. Can you do that? ",
                "ITALY: Are you planning to force Rumania?",
                "TURKEY: can you answer my question about the convoy?"
            ]
        },
        "S1903M": {
            "mentioned": [
                "alb",
                "aeg",
                "gre",
                "smy"
            ],
            "start": {
                "ITALY": [
                    "A ALB - TRI",
                    "A VEN S A ALB - TRI",
                    "F AEG - GRE",
                    "F ION - ADR"
                ],
                "TURKEY": [
                    "A ARM - SEV"
                ]
            },
            "end": {
                "ITALY": [
                    "A ALB - GRE",
                    "A VEN - TYR",
                    "F AEG S A ALB - GRE",
                    "F ION S A ALB - GRE"
                ],
                "TURKEY": [
                    "A ARM - SMY"
                ]
            },
            "messages": [
                "ITALY: What do you want me to do?",
                "TURKEY: You can take Gre here. I will cut Bul for you. Please take it with AEG. Use Alb to cut Ser and support AEG-Gre.",
                "ITALY: You should probably move Con-bul and Ank-bla.",
                "ITALY: I'm not going to take Gre this turn, I need to reposition my units so that I can take it in the Fall.",
                "TURKEY: Isn't that the whole reason you moved to AEG. That makes no sense. take it now and pop the fleet. If you're planning on convoying to Smy it won't work.",
                "ITALY: Are you ok with those moves?",
                "TURKEY: What moves, you haven't proposed any moves."
            ]
        },
        "F1903M": {
            "mentioned": [
                "con",
                "bla",
                "bul"
            ],
            "start": {
                "TURKEY": [
                    "F BLA S F CON - BUL/SC"
                ]
            },
            "end": {
                "TURKEY": [
                    "F BLA S F CON - BUL"
                ]
            },
            "messages": [
                "ITALY: Why did you move back into Smyrna?",
                "ITALY: Anyway, I think that we should be able to take Bulgaria back this turn, I'll support Con-bul.",
                "TURKEY: I'm trying to get Russia to back off and they said they would if I moved out of Arm so we can focus on Bul.\nOkay, should Con go to Bul sc?",
                "ITALY: I think that Con-bul sc would be good, yes.",
                "ITALY: You should probably use BLA to support as well, because I need to use AEG to support Gre.",
                "TURKEY: Cant you use ION to support Gre and support Con-Bul with AEG?"
            ]
        },
        "S1904M": {
            "mentioned": [
                "apu",
                "aeg",
                "gre"
            ],
            "start": {
                "ITALY": [
                    "A GRE - SER",
                    "F ADR - APU",
                    "F AEG - ION"
                ]
            },
            "end": {
                "ITALY": [
                    "A GRE - SMY VIA",
                    "F ADR S A ROM - APU",
                    "F AEG C A GRE - SMY"
                ]
            },
            "messages": [
                "ITALY: How do you want to proceed from here?",
                "ITALY: I'm not sure how well we're going to be able to hold off Austria, but let's give it a try.",
                "TURKEY: I think you need to pull AEG to ION to help support yourself. I'll get my army in Bul and we can push Ser from the south while you hold the boot",
                "ITALY: I'm thinking that I might be able to convoy Gre back to Apu, since I should be able to hold that.",
                "ITALY: Do you have any other ideas?"
            ]
        },
        "S1906M": {
            "mentioned": [
                "bul",
                "ank"
            ],
            "start": {
                "TURKEY": [
                    "A BUL - CON",
                    "F ANK S A BUL - CON",
                    "F BLA S A BUL - CON"
                ]
            },
            "end": {
                "TURKEY": [
                    "A BUL S F BLA - CON",
                    "F ANK S F BLA - CON",
                    "F BLA - CON"
                ]
            },
            "messages": [
                "ITALY: Are you willing to work with me against Austria now?",
                "ITALY: If you take Rum and let me take Ank, I'll be willing to leave Bul and Gre alone.",
                "TURKEY: No, I want my home centers back. You an have Gre.",
                "ITALY: I'm willing to help you take Bul back from Austria next turn if you let me take Ank now."
            ]
        }
    },
    "RUSSIA-TURKEY": {
        "S1902M": {
            "mentioned": [
                "bla",
                "bul",
                "rum"
            ],
            "start": {
                "RUSSIA": [
                    "A GAL H"
                ],
                "TURKEY": [
                    "A BUL - RUM",
                    "F BLA S A BUL - RUM"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A GAL S F RUM"
                ],
                "TURKEY": [
                    "A BUL S F RUM",
                    "F BLA S A BUL"
                ]
            },
            "messages": [
                "TURKEY: Well that's not what we talked about. Why the shift to working with Austria?",
                "RUSSIA: I was surpriesd that you moved to black sea. Like, I had to move my fleet to rum, there was no other option. I would love to fix this if you'll DMZ black sea. Is that possible? We can support each other in Bul and Rum for now. I hope youll notice italy's fleet build.",
                "TURKEY: You built a second fleet. How are we supposed to descalate now? You have almost no capability to attack Austria.",
                "RUSSIA: I mean, I'll probably have to delete it after losing Swe; does that work? ",
                "TURKEY: sure"
            ]
        },
        "S1906M": {
            "mentioned": [
                "italy"
            ],
            "start": {
                "TURKEY": [
                    "A BUL - CON",
                    "F ANK S A BUL - CON",
                    "F BLA S A BUL - CON"
                ]
            },
            "end": {
                "TURKEY": [
                    "A BUL S F BLA - CON",
                    "F ANK S F BLA - CON",
                    "F BLA - CON"
                ]
            },
            "messages": [
                "RUSSIA: I think its curtains for me; lmk if you want anything!",
                "TURKEY: Not sure I can do much here myself with Italy continuing to attack"
            ]
        }
    }
}