{
    "AUSTRIA-FRANCE": {
        "F1901M": {
            "mentioned": [
                "tri"
            ],
            "start": {
                "AUSTRIA": [
                    "A VIE - TYR"
                ]
            },
            "end": {
                "AUSTRIA": [
                    "A VIE - TRI"
                ]
            },
            "messages": [
                "AUSTRIA: Well, so much for that",
                "FRANCE: Yep, he never replied to me.",
                "AUSTRIA: Me neither",
                "AUSTRIA: How are things looking in the West?",
                "FRANCE: Could've been worse. But it is okay I suppose. And what about Turkey?",
                "AUSTRIA: Turkey is friendly so far",
                "AUSTRIA: Are you moving to Munich?",
                "FRANCE: Nope.",
                "FRANCE: Italy wants to go there. But I'm not working with him",
                "AUSTRIA: Haha I appreciate that",
                "FRANCE: I lied to him to support him there. So you have a chance in defending Tri and taking a center or two",
                "FRANCE: I do suspect Italy is a bot"
            ]
        }
    },
    "AUSTRIA-GERMANY": {
        "S1902M": {
            "mentioned": [
                "france"
            ],
            "start": {
                "GERMANY": [
                    "A HOL H",
                    "A MUN - BUR",
                    "A RUH - BUR"
                ]
            },
            "end": {
                "GERMANY": [
                    "A HOL S A BEL",
                    "A MUN H",
                    "A RUH - KIE"
                ]
            },
            "messages": [
                "AUSTRIA: Seems like you worked out things with France",
                "AUSTRIA: Are you working with Russia?",
                "GERMANY: Not sure, the French build isn't exactly what I wanted to see\n",
                "GERMANY: I'm pro-Russia because I'm worried I'm against an EF, yeah",
                "AUSTRIA: Yeah, that build isn't promising. Although Russia could be fighting England",
                "GERMANY: Yeah Russia and England are definitely fighting. I take it that you and Russia are too though?",
                "AUSTRIA: For now. I just need his help",
                "AUSTRIA: Plus, it's better to work with people who communicate haha",
                "GERMANY: Yeah that always helps!",
                "AUSTRIA: For what it's worth, I don't think you have to worry about Italy here",
                "GERMANY: I hope not!"
            ]
        },
        "S1903M": {
            "mentioned": [
                "mun"
            ],
            "start": {
                "GERMANY": [
                    "A KIE - RUH",
                    "A MUN - RUH",
                    "F DEN S F HEL - NTH",
                    "F HEL - NTH"
                ]
            },
            "end": {
                "GERMANY": [
                    "A KIE - DEN",
                    "A MUN H",
                    "F DEN - NTH",
                    "F HEL S F DEN - NTH"
                ]
            },
            "messages": [
                "AUSTRIA: Are you able to send an army down to help at all?",
                "GERMANY: I knew about Burgundy, nothing I could do about it, so may as well be OK with it",
                "AUSTRIA: I could really use your help here",
                "GERMANY: Probably not in Spring, but I might be able to help you in Autumn",
                "AUSTRIA: Right now, that would be really helpful",
                "AUSTRIA: It would help us both",
                "GERMANY: It would, but poking Tyrolia in spring and France moving back to Burgundy gives Italy a reason to support France into Munich, so I can't do it til Autumn",
                "AUSTRIA: Alright. Well, it'll have to do"
            ]
        }
    },
    "AUSTRIA-ITALY": {
        "F1901M": {
            "mentioned": [
                "tyr"
            ],
            "start": {
                "AUSTRIA": [
                    "A VIE - TYR"
                ],
                "ITALY": [
                    "A TYR - MUN"
                ]
            },
            "end": {
                "AUSTRIA": [
                    "A VIE - TRI"
                ],
                "ITALY": [
                    "A TYR - VIE"
                ]
            },
            "messages": [
                "AUSTRIA: Hey, I thought we were leaving Tyrolia empty?",
                "AUSTRIA: Are you not wanting to work together?",
                "ITALY: I'm thinking of attacking Mun from Tyr",
                "AUSTRIA: That might be tough with France in Bur",
                "AUSTRIA: Plus, it would be a bit difficult for you to hold onto it"
            ]
        }
    },
    "AUSTRIA-TURKEY": {
        "F1905M": {
            "mentioned": [
                "russia"
            ],
            "start": {
                "TURKEY": [
                    "A SMY S F ANK",
                    "F ANK H"
                ]
            },
            "end": {
                "TURKEY": [
                    "A SMY - ARM",
                    "F ANK S A SMY - ARM"
                ]
            },
            "messages": [
                "AUSTRIA: You should support me to hold",
                "TURKEY: Can't afford to.",
                "AUSTRIA: Russia is your bigger problem right now",
                "AUSTRIA: Russia is definitely going to take Bulgaria. Italy is not going to take Greece, because then you'd take the Ionian. Russia has no incentive to let you live, because he has no reason to give you back your home centers. That's how it goes when Russia attacks Turkey",
                "AUSTRIA: You're going to lose two or three centers to Russia this turn, and then you're done",
                "TURKEY: Yeah thanks I really needed *you* to tell me that.",
                "AUSTRIA: I'm just trying to help you out. You've done nothing for me this entire game",
                "AUSTRIA: But I'm going to hold again"
            ]
        }
    },
    "ENGLAND-FRANCE": {},
    "ENGLAND-GERMANY": {
        "F1902M": {
            "mentioned": [
                "russia"
            ],
            "start": {
                "GERMANY": [
                    "F DEN S F HEL - NTH"
                ]
            },
            "end": {
                "GERMANY": [
                    "F DEN S F SWE"
                ]
            },
            "messages": [
                "ENGLAND: Why would you prefer to work with Russia over me? I feel like our alliance would have been more advantageous for you",
                "ENGLAND: Especially since Russia is already working with Turkey and doesn't have a way to expand that doesn't go through you",
                "GERMANY: Are they? It looks to me like Russia is working with Italy, not Turkey. But Russia has done what they said and nothing hostile whereas Skaggerack looked too much like you were setting up to hit me next",
                "ENGLAND: You decided to work against me instead of with me and that's unfortunate",
                "GERMANY: You weren't offering me anything against France, and were taking the only other dot next to me. Where was I supposed to grow if we worked together?",
                "ENGLAND: Warsaw and Moscow would have been yours with my help"
            ]
        },
        "S1903M": {
            "mentioned": [
                "france"
            ],
            "start": {
                "ENGLAND": [
                    "A LVP S F LON - WAL",
                    "A STP S F BAR - NWY",
                    "F LON - WAL",
                    "F SKA - NTH"
                ]
            },
            "end": {
                "ENGLAND": [
                    "A LVP - WAL",
                    "A STP - MOS",
                    "F LON - ENG",
                    "F SKA S F BAR - NWY"
                ]
            },
            "messages": [
                "ENGLAND: You can see that France is set up to become very powerful by taking all of my centers and you won't be able to do anything about it",
                "GERMANY: Yep",
                "ENGLAND: They also seem like the type to stab their allies as soon as it's no longer to their benefit"
            ]
        },
        "F1903M": {
            "mentioned": [
                "france"
            ],
            "start": {
                "GERMANY": [
                    "A MUN - RUH"
                ]
            },
            "end": {
                "GERMANY": [
                    "A MUN - BUR"
                ]
            },
            "messages": [
                "GERMANY: Do you have an alternative plan?",
                "ENGLAND: You, France, and I could work together",
                "GERMANY: How does that stop France getting gigantic?",
                "ENGLAND: With your armies and our fleets we would be a powerful alliance",
                "ENGLAND: By attacking them from the South",
                "ENGLAND: If we can convince them to stab Italy it would work very well for us"
            ]
        }
    },
    "ENGLAND-ITALY": {
        "S1903M": {
            "mentioned": [
                "france",
                "russia"
            ],
            "start": {
                "ENGLAND": [
                    "A LVP S F LON - WAL",
                    "A STP S F BAR - NWY",
                    "F LON - WAL",
                    "F SKA - NTH"
                ]
            },
            "end": {
                "ENGLAND": [
                    "A LVP - WAL",
                    "A STP - MOS",
                    "F LON - ENG",
                    "F SKA S F BAR - NWY"
                ]
            },
            "messages": [
                "ENGLAND: It looks like Germany, France, and Russia are all working together. Perhaps we could work together to make sure that doesn't happen?",
                "ENGLAND: Especially if France ends up becoming too powerful by taking all of my centers"
            ]
        }
    },
    "ENGLAND-TURKEY": {
        "S1903M": {
            "mentioned": [
                "france"
            ],
            "start": {
                "ENGLAND": [
                    "A LVP S F LON - WAL",
                    "A STP S F BAR - NWY",
                    "F LON - WAL",
                    "F SKA - NTH"
                ]
            },
            "end": {
                "ENGLAND": [
                    "A LVP - WAL",
                    "A STP - MOS",
                    "F LON - ENG",
                    "F SKA S F BAR - NWY"
                ]
            },
            "messages": [
                "ENGLAND: Maybe you could work with Austria and get their support to move to Ionian Sea? That fleet isn't doing anything and it would put pressure on Italy",
                "ENGLAND: We all need to work together against the France, Germany, Italy alliance",
                "TURKEY: Yeah, probably.",
                "ENGLAND: If we all work together we should be able to stop them",
                "ENGLAND: Are you going to support Austria to Ionian?"
            ]
        }
    },
    "FRANCE-GERMANY": {
        "S1902M": {
            "mentioned": [
                "bel",
                "mun"
            ],
            "start": {
                "GERMANY": [
                    "A HOL H",
                    "A MUN - BUR",
                    "A RUH - BUR"
                ]
            },
            "end": {
                "GERMANY": [
                    "A HOL S A BEL",
                    "A MUN H",
                    "A RUH - KIE"
                ]
            },
            "messages": [
                "FRANCE: You didn't bounce Russia out of SWE and you've built an army. Why is that?",
                "GERMANY: If I'm anti-England, why would I bounce Sweden? That only helps the English. Why didn't you build a fleet in Brest?",
                "FRANCE: Why didn't you build one in Ber?",
                "FRANCE: Perhaps we were both played by the same guy here...",
                "GERMANY: Italy is sitting in Tyrolia still, I can't leave Munich empty for them to walk into at any moment",
                "GERMANY: I'm moving my fleets to North Sea and Heligoland; if you move Picardy to the Channel then one of us is guaranteed to get in",
                "FRANCE: I have to bring a unit in Bur. To protect Bel and to be able to send a unit in England later.",
                "FRANCE: I will help you out.",
                "FRANCE: Just keep Russia at bay. Don't let him get too much power. He is already very influential in the east",
                "GERMANY: That's fine as long as you go to the Channel as well",
                "GERMANY: I will contain Russia if you're going to move against England, but if not then I need to work with Russia",
                "FRANCE: Yeah, that is fine"
            ]
        },
        "F1902M": {
            "mentioned": [
                "bel",
                "swe",
                "russia"
            ],
            "start": {
                "FRANCE": [
                    "A BUR S A MUN"
                ],
                "GERMANY": [
                    "F DEN S F HEL - NTH"
                ]
            },
            "end": {
                "FRANCE": [
                    "A BUR - BEL"
                ],
                "GERMANY": [
                    "F DEN S F SWE"
                ]
            },
            "messages": [
                "FRANCE: I'm supporting Mun to Hold if that's okay",
                "FRANCE: Or actually, It is better that I move that unit north. To be able to convoy it later",
                "GERMANY: Yeah, I hope you see me moving out of Ruhr as a  clear sign of friendliness - I wanted to give you room to convoy Belgium to Wales this turn",
                "GERMANY: I will try to take North Sea by force here, are you going to try the convoy?",
                "FRANCE: Sure. Just not sure where. Should I risk Lon?",
                "GERMANY: I think London has the biggest payoff - It could cover Wales and you get in, or it could support SKA - NTH and then you cut the support and I get in to North, so the only \"bad\" outcome is if London moves to North Sea itself",
                "FRANCE: But that puts me a year behind if England decides to sit there. And I lose the momentum",
                "GERMANY: That's fair, it's up to you - We have England out of position at least",
                "FRANCE: England thinks Russia wants to secure STP. So there's an option he goes for Swe",
                "GERMANY: I will defend Sweden then"
            ]
        },
        "S1903M": {
            "mentioned": [
                "nth",
                "england"
            ],
            "start": {
                "GERMANY": [
                    "A KIE - RUH",
                    "A MUN - RUH",
                    "F DEN S F HEL - NTH",
                    "F HEL - NTH"
                ]
            },
            "end": {
                "GERMANY": [
                    "A KIE - DEN",
                    "A MUN H",
                    "F DEN - NTH",
                    "F HEL S F DEN - NTH"
                ]
            },
            "messages": [
                "FRANCE: Now we need Russia to barely stay alive and to actually shift some power relations in the east. Italy is going too strong against Austria IMO",
                "GERMANY: Shame, I should've supported myself after all.  Can you support me to North Sea this turn? ",
                "FRANCE: I'm going to attack Lon. It is obvious and I don't think you need my support to get to NTH",
                "GERMANY: Alright, I hope not then. The East is still quite in flux as Austria got Trieste back, but we need to make sure we finish our war against England before they finish theirs over there",
                "FRANCE: Exactly. Any ideas how? I will eventually send some units there. But not now",
                "GERMANY: I think if you get London and Liverpool and I get Edinburgh and Norway, we'll have a good share of the spoils. As long as I get into North, we should be able to do that by the end of next year at the latest",
                "FRANCE: Let's not divide anything yet. We have to actually win first. My thinking is how do we push after England successfully.",
                "FRANCE: Maybe keeping Russia alive and fighting Italy together. Or bringing in Turkey somehow",
                "GERMANY: I'll try to keep Russia alive in Scandinavia, yes"
            ]
        },
        "F1903M": {
            "mentioned": [
                "bur",
                "mun"
            ],
            "start": {
                "GERMANY": [
                    "A MUN - RUH"
                ]
            },
            "end": {
                "GERMANY": [
                    "A MUN - BUR"
                ]
            },
            "messages": [
                "FRANCE: I will move to Bur, as I want to keep Mar free for the build. Also I can support you in Mun if necessary to fight Italy later on",
                "GERMANY: Why do you need to move to Bur? Self bouncing there again is fine",
                "FRANCE: Well how about we bounce each other there. It can cover our stories and we can say we started a war. Italy cant take Mun this turn. And I leave MAR open. I dont want just to sit with GAS. I need to talk to England and make him think I change my mind. It gives me quite an advantage then.",
                "GERMANY: England wants me to convince you to attack Italy here, but I think it's more useful to just kill England off fast",
                "FRANCE: I agree that England is priority target for us. Italy is second for me. But can we bounce in Bur?",
                "GERMANY: Okay, that's fine",
                "FRANCE: Great.",
                "GERMANY: Are you going to convoy another army over? It would kill England off faster and leave you more versatility with the MAO fleet to deal with Italy",
                "FRANCE: Of course. But can you move south any units next turn",
                "GERMANY: Yes"
            ]
        },
        "S1905M": {
            "mentioned": [
                "bur"
            ],
            "start": {
                "FRANCE": [
                    "F BRE - GAS",
                    "F ENG - MAO"
                ],
                "GERMANY": [
                    "A HOL H",
                    "A MUN H"
                ]
            },
            "end": {
                "FRANCE": [
                    "F BRE - MAO",
                    "F ENG H"
                ],
                "GERMANY": [
                    "A HOL - BEL",
                    "A MUN - BUR"
                ]
            },
            "messages": [
                "FRANCE: Look, I have to move to Bur just be sure I can retake it next year if I lose MAR",
                "GERMANY: Yeah that's fine",
                "FRANCE: Reasonable. We have to talk to Turkey now.",
                "GERMANY: It would be helpful if I could move my HEL fleet to NTH to defend Norway if I'm going to take a shot at Sweden though?",
                "FRANCE: Hm.. That is tricky for me",
                "FRANCE: Anyway of getting SWE without moving to Norway?",
                "GERMANY: I don't think so, I think I'll need that support hold",
                "FRANCE: You can get SWE from DEN and follow up Hel to DEN to make sure you can support hold in SWE later and that SWE will be able to support Norway as well",
                "FRANCE: Come on, you have an option. And we can talk to Russia and feed him wrong info about south",
                "GERMANY: STP is tapping Norway, there's no way I take Sweden that way",
                "FRANCE: He is not that smart",
                "GERMANY: The bots are exceptionally good tactically",
                "FRANCE: Well we agreed on DMZ before this turn",
                "FRANCE: Keep talking to him.",
                "GERMANY: Aite"
            ]
        }
    },
    "FRANCE-ITALY": {
        "F1901M": {
            "mentioned": [
                "tyr"
            ],
            "start": {
                "ITALY": [
                    "A TYR - MUN",
                    "A VEN - TRI"
                ]
            },
            "end": {
                "ITALY": [
                    "A TYR - VIE",
                    "A VEN - TYR"
                ]
            },
            "messages": [
                "ITALY: Sorry I didn't get back to you, but yes",
                "FRANCE: Okay, well we both have confirms that we wont go for each other.",
                "ITALY: Do you intend to go for belgium or munich? I could do an early attack on mun",
                "FRANCE: I have no interests in attacking Mun",
                "ITALY: Would you be willing to support Tyr-Mun?",
                "FRANCE: Yes I will",
                "ITALY: You can easily take western europe from there\n",
                "ITALY: If you support me",
                "FRANCE: Actually I wont support you"
            ]
        },
        "S1902M": {
            "mentioned": [
                "austria"
            ],
            "start": {
                "ITALY": [
                    "A TYR S A VIE"
                ]
            },
            "end": {
                "ITALY": [
                    "A TYR S A VEN - TRI"
                ]
            },
            "messages": [
                "FRANCE: I see that Austria is about to lose",
                "ITALY: Sure. Can we still keep PIE dmz'd? Thanks for not building a fleet",
                "FRANCE: I intend to keep PIE, LYO, WES and NAF DMZ.",
                "ITALY: Okay, I will keep TYS DMZ'd",
                "FRANCE: That sounds great"
            ]
        },
        "S1906M": {
            "mentioned": [
                "turkey",
                "eas"
            ],
            "start": {
                "ITALY": [
                    "F ION - AEG"
                ]
            },
            "end": {
                "ITALY": [
                    "F ION - EAS"
                ]
            },
            "messages": [
                "FRANCE: Why did you attack me? You really thought Turkey can fight Russia alone? Of course he cannot",
                "ITALY: I'm just providing some counterweight to your gains in England",
                "ITALY: In the end, I don't want to overly antagonize you by attacking all out",
                "ITALY: I do have Russia to worry about as well",
                "FRANCE: Okay how about you let me have my center back, and I wont be going after you but to the north?",
                "ITALY: I can't give you the center back, you'd be too strong. ",
                "FRANCE: But that would give you units to fight in the east",
                "FRANCE: And you can progress faster against Turkey, especially now when your centers are in danger and Russia is strong",
                "ITALY: Still doesn't mean you wouldn't be too strong.",
                "ITALY: Yes, Russia may steamroll us. But that's more reason for me to have another center.",
                "FRANCE: True, but what is better for you? To bleed to death here in the west and lose to Russia in the east or just try to trust me and actually fight the best player here and protect your exposed rear"
            ]
        }
    },
    "FRANCE-RUSSIA": {
        "S1904M": {
            "mentioned": [
                "germany"
            ],
            "start": {
                "RUSSIA": [
                    "F SWE S F NTH - NWY"
                ]
            },
            "end": {
                "RUSSIA": [
                    "F SWE S F NTH - SKA"
                ]
            },
            "messages": [
                "FRANCE: Any replies?",
                "RUSSIA: Sorry, I am busy talking in the south.",
                "FRANCE: Sure but what's the point in talking there when we are offering you to join us together against Italy",
                "FRANCE: Will you join Germany and me?",
                "RUSSIA: I am considering it.",
                "FRANCE: Well you have nothing to lose. You already are figting there"
            ]
        },
        "F1904M": {
            "mentioned": [
                "italy"
            ],
            "start": {
                "RUSSIA": [
                    "A BUD S A SER"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A BUD S A TRI - SER"
                ]
            },
            "messages": [
                "RUSSIA: I will help you and Germany.",
                "RUSSIA: Germany doesn't seem to want to fight Italy.",
                "FRANCE: Why do you think that?"
            ]
        },
        "S1906M": {
            "mentioned": [
                "italy"
            ],
            "start": {
                "RUSSIA": [
                    "A BUD S A RUM",
                    "A BUL S A ALB - GRE",
                    "A RUM S A BUL"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A BUD S A RUM - SER",
                    "A BUL S A RUM - SER",
                    "A RUM - SER"
                ]
            },
            "messages": [
                "FRANCE: You have VIE oppened for taking. You can win this game. And I will help you to beat Germany",
                "FRANCE: No replies?",
                "FRANCE: Anyway you can swap out some of your units in the Scandinavia and that will give you a weapon against Germany",
                "RUSSIA: Thanks for the offer, but I won't stab Italy yet.",
                "FRANCE: Yet is the keyword here"
            ]
        },
        "F1906M": {
            "mentioned": [
                "germany",
                "lon"
            ],
            "start": {
                "RUSSIA": [
                    "A BUD - TRI",
                    "A SER S A BUD - TRI",
                    "F NWY S F SWE"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A BUD S A GAL - VIE",
                    "A SER S A BUL",
                    "F NWY S F LON - NTH"
                ]
            },
            "messages": [
                "RUSSIA: I'll think about it.",
                "FRANCE: Can I ask you to attack NWG so that I keep EDI? You won this game so, if I can keep second place that would be great",
                "RUSSIA: If I attack NWG, Germany will probably retreat to Barents Sea. But I can support London to North Sea if you want.",
                "FRANCE: London to North Sea is not very important. But if Germany loses a center his fleet in Barents Sea could be destroyed or you can build something in STP later. You already maxing out in the south"
            ]
        }
    },
    "FRANCE-TURKEY": {},
    "GERMANY-ITALY": {
        "F1901M": {
            "mentioned": [
                "tyr",
                "austria"
            ],
            "start": {
                "ITALY": [
                    "A TYR - MUN",
                    "A VEN - TRI"
                ]
            },
            "end": {
                "ITALY": [
                    "A TYR - VIE",
                    "A VEN - TYR"
                ]
            },
            "messages": [
                "GERMANY: I take it that Tyrolia means that you could not keep Austria on side?",
                "ITALY: Yeah, I'm working with Turkey now to figure this out",
                "GERMANY: Makes sense, IT is a pretty good alliance from there",
                "ITALY: How are you defending Mun or Bel?",
                "GERMANY: By not telling people how I'm defending them ;)"
            ]
        },
        "F1902M": {
            "mentioned": [
                "russia",
                "austria"
            ],
            "start": {
                "GERMANY": [
                    "F DEN S F HEL - NTH"
                ],
                "ITALY": [
                    "A TRI S A GAL - BUD",
                    "A TYR S A TRI",
                    "A VIE S A TRI"
                ]
            },
            "end": {
                "GERMANY": [
                    "F DEN S F SWE"
                ],
                "ITALY": [
                    "A TRI S A VIE - BUD",
                    "A TYR - VIE",
                    "A VIE - BUD"
                ]
            },
            "messages": [
                "GERMANY: France only having one fleet definitely leaves them pretty vulnerable, so as soon as  you've got the Austria situation on lock there should be an opportunity for you to come west if that's your mid-term plan",
                "ITALY: I'm interested. But I don't want to get ahead of myself. Turkey and A seem allied",
                "GERMANY: Yeah, I take it that you and Russia are allied though?",
                "ITALY: Somewhat, it's tenuous"
            ]
        },
        "S1903M": {
            "mentioned": [
                "austria"
            ],
            "start": {
                "GERMANY": [
                    "A KIE - RUH",
                    "A MUN - RUH",
                    "F DEN S F HEL - NTH",
                    "F HEL - NTH"
                ],
                "ITALY": [
                    "F ALB S F TUN - ION"
                ]
            },
            "end": {
                "GERMANY": [
                    "A KIE - DEN",
                    "A MUN H",
                    "F DEN - NTH",
                    "F HEL S F DEN - NTH"
                ],
                "ITALY": [
                    "F ALB - GRE"
                ]
            },
            "messages": [
                "GERMANY: Unlucky on Trieste there",
                "ITALY: Yeah, but I'm hoping I can take Austria with Russia",
                "GERMANY: I hope so too, I'm going to need you as a counterweight to France soon!",
                "GERMANY: If there's anything I can do to help, let me know"
            ]
        },
        "F1903M": {
            "mentioned": [
                "france"
            ],
            "start": {
                "GERMANY": [
                    "A MUN - RUH"
                ],
                "ITALY": [
                    "A TRI H"
                ]
            },
            "end": {
                "GERMANY": [
                    "A MUN - BUR"
                ],
                "ITALY": [
                    "A TRI S A SER"
                ]
            },
            "messages": [
                "GERMANY: France is getting very strong, will you build a fleet this year?",
                "ITALY: Yes",
                "GERMANY: Excellent, glad to hear it",
                "ITALY: I need to lock this down with Turkey & Russia. ",
                "ITALY: Propping up russia so they don't collapse"
            ]
        },
        "S1905M": {
            "mentioned": [
                "france",
                "bur"
            ],
            "start": {
                "GERMANY": [
                    "A HOL H",
                    "A MUN H",
                    "F NWY H"
                ],
                "ITALY": [
                    "A TRI - SER",
                    "F ION H"
                ]
            },
            "end": {
                "GERMANY": [
                    "A HOL - BEL",
                    "A MUN - BUR",
                    "F NWY - NWG"
                ],
                "ITALY": [
                    "A TRI - ALB",
                    "F ION S A TRI - ALB"
                ]
            },
            "messages": [
                "GERMANY: I will do what I can against France here, trying to work out a way to get the Russian fleet involved too",
                "ITALY: Well, I guess France will now take either you or me next. ",
                "GERMANY: Hopefully neither",
                "GERMANY: I'm bouncing Burgundy so you may be able to keep Marseilles",
                "ITALY: Thanks"
            ]
        },
        "F1905M": {
            "mentioned": [
                "france",
                "mar"
            ],
            "start": {
                "ITALY": [
                    "A ALB - GRE",
                    "A MAR H",
                    "F ION S A ALB - GRE",
                    "F LYO S A MAR"
                ]
            },
            "end": {
                "ITALY": [
                    "A ALB S A TRI - SER",
                    "A MAR - SPA",
                    "F ION H",
                    "F LYO S A MAR - SPA"
                ]
            },
            "messages": [
                "ITALY: I'm hoping I can keep the Mediterranean. If France's fleets get here, then I'm doomed.",
                "ITALY: With one build I can get another fleet here, and hopefully keep things going.",
                "GERMANY: Yeah, France should have 2 disbands this year from Marseilles and Edinburgh",
                "ITALY: Nice job.",
                "ITALY: Do you think Russia will attack you though?",
                "GERMANY: I hope not!",
                "GERMANY: I'm trying to arrange a swap of Sweden and Norway",
                "ITALY: Sounds good."
            ]
        },
        "S1906M": {
            "mentioned": [
                "france"
            ],
            "start": {
                "GERMANY": [
                    "A HOL H",
                    "A MUN - SIL",
                    "F NWG S F NTH - NWY"
                ]
            },
            "end": {
                "GERMANY": [
                    "A HOL S A MUN - RUH",
                    "A MUN - RUH",
                    "F NWG S F EDI - NTH"
                ]
            },
            "messages": [
                "GERMANY: Looks like we've exchanged a France problem for a Russia problem here",
                "ITALY: Yes, agreed",
                "ITALY: We can keep working on France together though?",
                "ITALY: France disbanded fleets so I can take spain and portugal",
                "GERMANY: I can try, but Russia going to Silesia is going to wreck me here",
                "ITALY: Maybe you will lose 1 CP but gain one in France/Belgium? Net zero."
            ]
        },
        "S1907M": {
            "mentioned": [
                "mar"
            ],
            "start": {
                "GERMANY": [
                    "A BUR - GAS",
                    "F NWG - NTH"
                ],
                "ITALY": [
                    "A PIE - MAR",
                    "A SER - GRE",
                    "A TRI H",
                    "F ION S A SER - GRE"
                ]
            },
            "end": {
                "GERMANY": [
                    "A BUR - MAR",
                    "F NWG S F NWY - NTH"
                ],
                "ITALY": [
                    "A PIE S A BUR - MAR",
                    "A SER S A TRI",
                    "A TRI S A SER",
                    "F ION - GRE"
                ]
            },
            "messages": [
                "ITALY: Any thoughts on Mar? I can attack again. And attack Spa at the same time",
                "GERMANY: You could support me into MAR while you attack SPA? Gascony could only defend one",
                "ITALY: Sounds good"
            ]
        }
    },
    "GERMANY-RUSSIA": {
        "S1902M": {
            "mentioned": [
                "france"
            ],
            "start": {
                "GERMANY": [
                    "A HOL H",
                    "A MUN - BUR",
                    "A RUH - BUR"
                ]
            },
            "end": {
                "GERMANY": [
                    "A HOL S A BEL",
                    "A MUN H",
                    "A RUH - KIE"
                ]
            },
            "messages": [
                "RUSSIA: Any read on what England is doing? I am going to attack Norway.",
                "GERMANY: Looks like England is throwing everything at you, I think the question is whether they have France on board or not",
                "RUSSIA: Can you support Sweden to hold? If not, I understand. I can cut Norway's support if you do.",
                "GERMANY: I think I'm going to bounce the North Sea instead, but England says they'll take Sweden from Skaggerack so you should be able to defend it by cutting Norway"
            ]
        },
        "F1902M": {
            "mentioned": [
                "swe"
            ],
            "start": {
                "GERMANY": [
                    "F DEN S F HEL - NTH"
                ]
            },
            "end": {
                "GERMANY": [
                    "F DEN S F SWE"
                ]
            },
            "messages": [
                "GERMANY: It looks good for you and Italy in the South",
                "RUSSIA: Can you support Sweden?",
                "GERMANY: Yes"
            ]
        },
        "S1903M": {
            "mentioned": [
                "england"
            ],
            "start": {
                "GERMANY": [
                    "A KIE - RUH",
                    "A MUN - RUH",
                    "F DEN S F HEL - NTH",
                    "F HEL - NTH"
                ]
            },
            "end": {
                "GERMANY": [
                    "A KIE - DEN",
                    "A MUN H",
                    "F DEN - NTH",
                    "F HEL S F DEN - NTH"
                ]
            },
            "messages": [
                "RUSSIA: Thanks for the help.",
                "RUSSIA: Are you working with France against England?",
                "GERMANY: No worries, shame it wasn't the right defence",
                "GERMANY: I am, yes",
                "GERMANY: Can Sweden cut Skaggerack? It should guarantee I get into North Sea",
                "RUSSIA: I am using Sweden to cut Norway's support, so that I don't lose Moscow.",
                "RUSSIA: Maybe in the fall I can help you.",
                "GERMANY: Norway is empty",
                "GERMANY: I don't see how England could take Norway with one army here",
                "RUSSIA: They can move Skaggerack to Norway.",
                "GERMANY: Yes, but does that matter?",
                "GERMANY: You don't have the units to be able to force Norway yourself either way, but if I'm in North Sea I can guarantee England has to disband, which can help you get STP back"
            ]
        },
        "S1904M": {
            "mentioned": [
                "swe",
                "england"
            ],
            "start": {
                "RUSSIA": [
                    "F SWE S F NTH - NWY"
                ]
            },
            "end": {
                "RUSSIA": [
                    "F SWE S F NTH - SKA"
                ]
            },
            "messages": [
                "RUSSIA: Sorry, I didn't see your message.",
                "RUSSIA: I did what you wanted me to do.",
                "GERMANY: Yeah no worries, shame it didn't work. Do you want to try supporting me to Skaggerack here? We could piff that English fleet, and then I could take Norway and you could take STP at the same time",
                "GERMANY: I think you, me, and Italy need to work together to make sure France doesn't run away with this board",
                "RUSSIA: I can support the same attack.",
                "GERMANY: I don't think it will work, England used the right defence. But if Sweden supports North Sea -> Skaggerack, I can then take Norway from Skaggerack?",
                "GERMANY: Destroying that English fleet would give us both a much easier time",
                "RUSSIA: Yes, that will work.",
                "RUSSIA: We need to move quickly to stop France.",
                "GERMANY: Agreed"
            ]
        },
        "F1904M": {
            "mentioned": [
                "italy",
                "bud"
            ],
            "start": {
                "GERMANY": [
                    "F HEL H"
                ],
                "RUSSIA": [
                    "A BUD S A SER"
                ]
            },
            "end": {
                "GERMANY": [
                    "F HEL S A HOL"
                ],
                "RUSSIA": [
                    "A BUD S A TRI - SER"
                ]
            },
            "messages": [
                "GERMANY: Okay, I will move to Norway, that will give me a build ready to deal with France. I think I don't cut North Sea so that England can defend Edinburgh?",
                "RUSSIA: Do you want to take Norway?",
                "GERMANY: Yes",
                "GERMANY: I really need a build, France is way ahead of me here",
                "RUSSIA: France is in a good position.",
                "RUSSIA: Okay, I will support Skagerrak to Norway.",
                "GERMANY: Thank you",
                "GERMANY: Is Galicia anti-Italian? If I'm fighting France, Italy would be quite helpful to have on board",
                "RUSSIA: I moved there so I could support hold Budapest.",
                "GERMANY: Fair enough"
            ]
        },
        "S1905M": {
            "mentioned": [
                "france",
                "nwy"
            ],
            "start": {
                "GERMANY": [
                    "A HOL H",
                    "A MUN H",
                    "F NWY H"
                ],
                "RUSSIA": [
                    "F BLA - ANK"
                ]
            },
            "end": {
                "GERMANY": [
                    "A HOL - BEL",
                    "A MUN - BUR",
                    "F NWY - NWG"
                ],
                "RUSSIA": [
                    "F BLA S F SEV - ARM"
                ]
            },
            "messages": [
                "RUSSIA: Are you moving to North Sea?",
                "GERMANY: Yes",
                "RUSSIA: Good.",
                "GERMANY: Do you want to trade Norway and Sweden? I could move both my fleets against France, and you could take Norway behind with me taking Sweden? Would let us get more units toward the frontlines"
            ]
        },
        "S1906M": {
            "mentioned": [
                "france"
            ],
            "start": {
                "GERMANY": [
                    "A HOL H",
                    "A MUN - SIL",
                    "F NWG S F NTH - NWY"
                ],
                "RUSSIA": [
                    "A BUD S A RUM",
                    "A BUL S A ALB - GRE",
                    "A RUM S A BUL"
                ]
            },
            "end": {
                "GERMANY": [
                    "A HOL S A MUN - RUH",
                    "A MUN - RUH",
                    "F NWG S F EDI - NTH"
                ],
                "RUSSIA": [
                    "A BUD S A RUM - SER",
                    "A BUL S A RUM - SER",
                    "A RUM - SER"
                ]
            },
            "messages": [
                "GERMANY: That was rather cruel",
                "RUSSIA: It was necessary to make sure you wouldn't try to betray me again.",
                "GERMANY: I did not betray you at any point",
                "RUSSIA: You tried to take Sweden last year.",
                "GERMANY: I left Norway open for you at the same time, and I couldn't get into Sweden if you didn't move there?",
                "RUSSIA: Right.",
                "GERMANY: So that was not an \"attack\" in any way - I could only have got into Sweden if you'd moved to Norway. There was no support.",
                "GERMANY: If you come to Silesia and attack me, I will have no choice but to defend against you with every unit and let France take everything behind me, giving them the board top. If you do not attack me, I don't have to do that and can keep fighting France",
                "RUSSIA: But you would have gotten Sweden if I had not made that support."
            ]
        },
        "F1906M": {
            "mentioned": [
                "france"
            ],
            "start": {
                "RUSSIA": [
                    "A BUD - TRI",
                    "A SER S A BUD - TRI",
                    "F NWY S F SWE"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A BUD S A GAL - VIE",
                    "A SER S A BUL",
                    "F NWY S F LON - NTH"
                ]
            },
            "messages": [
                "RUSSIA: Anyway, you can take Edinburgh now.",
                "GERMANY: I can, and I'm going to keep fighting France. France is the only player that can rival you for the board top, so I'd suggest you let me fight them and don't make more hostile moves against me",
                "RUSSIA: I will not make more hostile moves against you.",
                "GERMANY: Excellent, then I shall continue to fight France for you while you mop the east up to win :)",
                "RUSSIA: You should probably move Kiel to Munich this turn to stop France from taking it.",
                "GERMANY: I am",
                "RUSSIA: Or you can try taking Belgium.",
                "RUSSIA: OK, good luck!"
            ]
        },
        "S1907M": {
            "mentioned": [
                "france",
                "nwy"
            ],
            "start": {
                "GERMANY": [
                    "A BUR - GAS",
                    "F NWG - NTH"
                ],
                "RUSSIA": [
                    "F CON H"
                ]
            },
            "end": {
                "GERMANY": [
                    "A BUR - MAR",
                    "F NWG S F NWY - NTH"
                ],
                "RUSSIA": [
                    "F CON S A ARM - ANK"
                ]
            },
            "messages": [
                "RUSSIA: Sorry for stabbing you :(",
                "GERMANY: Seemed rather unnecessary, I don't get what you gain from helping France",
                "GERMANY: Can you support me into North Sea here? I will move DEN to KIE and let you walk into DEN behind",
                "RUSSIA: In the fall I will support you to North Sea.",
                "RUSSIA: I need to do something else with Norway this turn.",
                "GERMANY: Fall doesn't do me any good, that's the final turn - If you put me in in Spring I can attack Belgium in fall though",
                "GERMANY: I'm also willing to support Norway to North Sea if you'd prefer to do it the other way around?",
                "RUSSIA: I'd prefer to support you in in the fall, not in the spring."
            ]
        }
    },
    "GERMANY-TURKEY": {},
    "ITALY-RUSSIA": {
        "S1902M": {
            "mentioned": [
                "tri",
                "austria"
            ],
            "start": {
                "ITALY": [
                    "A TYR S A VIE"
                ]
            },
            "end": {
                "ITALY": [
                    "A TYR S A VEN - TRI"
                ]
            },
            "messages": [
                "ITALY: Hi Russia, do you think we'd be able to work together against Austria and Turkey?",
                "RUSSIA: What are you thinking? I am trying to take Rumania this year. Are you trying for Trieste?",
                "ITALY: Yep",
                "RUSSIA: I am cutting Budapest's support of Trieste.",
                "ITALY: Great, thanks. I can help you with RUM or BUD after"
            ]
        },
        "F1902M": {
            "mentioned": [
                "vie",
                "bud",
                "austria"
            ],
            "start": {
                "ITALY": [
                    "A TRI S A GAL - BUD",
                    "A TYR S A TRI",
                    "A VIE S A TRI"
                ]
            },
            "end": {
                "ITALY": [
                    "A TRI S A VIE - BUD",
                    "A TYR - VIE",
                    "A VIE - BUD"
                ]
            },
            "messages": [
                "ITALY: I think it is clear Austria and Turkey are working together. Would you be willing to team up? I think we can mop them up pretty quickly",
                "RUSSIA: I have to try to take Rumania first. But then I will be able to help you.",
                "RUSSIA: Would you be willing to let me have Budapest next year?",
                "ITALY: I can support GAL-BUD",
                "RUSSIA: I am using Galicia to support into Rumania.",
                "ITALY: Okay then I will attack Bud with Vie\n",
                "RUSSIA: That should work.",
                "ITALY: If you support me into Bud I will support you into RUM next year"
            ]
        },
        "S1903M": {
            "mentioned": [
                "alb",
                "austria"
            ],
            "start": {
                "ITALY": [
                    "F ALB S F TUN - ION"
                ]
            },
            "end": {
                "ITALY": [
                    "F ALB - GRE"
                ]
            },
            "messages": [
                "RUSSIA: I had to use Galicia to take Rumania. Now I should be in a better position to help you.",
                "ITALY: Nice, you got RUM",
                "ITALY: Yes, I made a mistake.",
                "RUSSIA: You can take Trieste. If I attack Budapest, I don't think you will need my help.",
                "ITALY: If you could attack BUD, then I can take Tri",
                "RUSSIA: What was the mistake?",
                "ITALY: I didn't think Austria would us Alb to attack Tri",
                "RUSSIA: Yeah, I will try to attack Budapest.",
                "ITALY: Thanks",
                "RUSSIA: I think that Turkey is going to try for the Ionian Sea, so you should probably support yourself in with Albania.",
                "ITALY: Yes, that's what I thought too and why I need your help in Bud",
                "RUSSIA: That's just a guess, though.",
                "RUSSIA: I am attacking Budapest, so you should be able to take Trieste.",
                "ITALY: Ok"
            ]
        },
        "F1903M": {
            "mentioned": [
                "gre",
                "turkey"
            ],
            "start": {
                "ITALY": [
                    "A TRI H",
                    "A TYR - PIE",
                    "F ALB - ION",
                    "F ION - TYS"
                ]
            },
            "end": {
                "ITALY": [
                    "A TRI S A SER",
                    "A TYR S A TRI",
                    "F ALB - GRE",
                    "F ION S F ALB - GRE"
                ]
            },
            "messages": [
                "ITALY: Do you want to work together on Turkey next?",
                "RUSSIA: Yes, that is my next goal.",
                "RUSSIA: You could probably take Greece this turn.",
                "ITALY: How? Aeg is supporting Gre probably"
            ]
        },
        "F1904M": {
            "mentioned": [
                "ser",
                "tri"
            ],
            "start": {
                "ITALY": [
                    "A TRI - ALB",
                    "F ADR - ALB"
                ],
                "RUSSIA": [
                    "A BUD S A SER"
                ]
            },
            "end": {
                "ITALY": [
                    "A TRI - SER",
                    "F ADR - ION"
                ],
                "RUSSIA": [
                    "A BUD S A TRI - SER"
                ]
            },
            "messages": [
                "ITALY: Would you be able to support Tri-Ser?",
                "ITALY: What do you want to do?",
                "RUSSIA: I will support Trieste to Serbia."
            ]
        },
        "S1905M": {
            "mentioned": [
                "alb",
                "ion",
                "tri"
            ],
            "start": {
                "ITALY": [
                    "A TRI - SER",
                    "F ION H"
                ],
                "RUSSIA": [
                    "F BLA - ANK"
                ]
            },
            "end": {
                "ITALY": [
                    "A TRI - ALB",
                    "F ION S A TRI - ALB"
                ],
                "RUSSIA": [
                    "F BLA S F SEV - ARM"
                ]
            },
            "messages": [
                "ITALY: I should've attacked Greece last turn so we could've taken Ser",
                "ITALY: Do you want to try to take serbia again? I could support Bud-Ser",
                "ITALY: In return, I'd like Greece",
                "RUSSIA: I can support Trieste to Serbia again.",
                "ITALY: Ok",
                "ITALY: Can you support with both Bud and Rum?",
                "RUSSIA: Yes, I will support Trieste to Serbia.",
                "ITALY: I'm trying to contain France at the same time",
                "RUSSIA: No, I need to cut Bulgaria.",
                "ITALY: Ok, I can move Tri-Alb first?",
                "RUSSIA: You should be able to take Serbia without me anyway.",
                "ITALY: Then we can surround Ser for more firepower",
                "ITALY: Ok, don't support Tri-Ser then",
                "RUSSIA: No, you need to support hold Ionian Sea.",
                "ITALY: I will, and ION supports Tri-Alb",
                "RUSSIA: I can support you in the Fall."
            ]
        }
    },
    "ITALY-TURKEY": {
        "S1902M": {
            "mentioned": [
                "austria"
            ],
            "start": {
                "ITALY": [
                    "A TYR S A VIE"
                ]
            },
            "end": {
                "ITALY": [
                    "A TYR S A VEN - TRI"
                ]
            },
            "messages": [
                "ITALY: So far so good",
                "ITALY: I'm hoping we can ally and split Austria's centers?"
            ]
        },
        "F1902M": {
            "mentioned": [
                "tri"
            ],
            "start": {
                "ITALY": [
                    "A TRI S A GAL - BUD",
                    "A TYR S A TRI",
                    "A VIE S A TRI"
                ],
                "TURKEY": [
                    "A BUL - SER",
                    "A CON - SMY",
                    "F BLA - CON"
                ]
            },
            "end": {
                "ITALY": [
                    "A TRI S A VIE - BUD",
                    "A TYR - VIE",
                    "A VIE - BUD"
                ],
                "TURKEY": [
                    "A BUL - RUM",
                    "A CON - BUL",
                    "F BLA S A BUL - RUM"
                ]
            },
            "messages": [
                "TURKEY: Gladly; Support me to Serbia?",
                "ITALY: With Tri? I have other plans with it atm",
                "TURKEY: RIP"
            ]
        },
        "F1903M": {
            "mentioned": [
                "ser",
                "gre"
            ],
            "start": {
                "ITALY": [
                    "A TRI H",
                    "A TYR - PIE",
                    "F ALB - ION",
                    "F ION - TYS"
                ],
                "TURKEY": [
                    "A BUL S A GRE - SER",
                    "A GRE - SER",
                    "F AEG - GRE"
                ]
            },
            "end": {
                "ITALY": [
                    "A TRI S A SER",
                    "A TYR S A TRI",
                    "F ALB - GRE",
                    "F ION S F ALB - GRE"
                ],
                "TURKEY": [
                    "A BUL - SER",
                    "A GRE S A BUL - SER",
                    "F AEG S A GRE"
                ]
            },
            "messages": [
                "TURKEY: Support me to Serbia from Greece, please!",
                "ITALY: Nice move on Greece.",
                "ITALY: I'm a bit confused about your previous ask",
                "TURKEY: I would like to take Serbia. We need to prepare to move on Russia."
            ]
        }
    },
    "RUSSIA-TURKEY": {
        "F1903M": {
            "mentioned": [
                "ser",
                "bul"
            ],
            "start": {
                "TURKEY": [
                    "A BUL S A GRE - SER",
                    "A GRE - SER",
                    "F AEG - GRE"
                ]
            },
            "end": {
                "TURKEY": [
                    "A BUL - SER",
                    "A GRE S A BUL - SER",
                    "F AEG S A GRE"
                ]
            },
            "messages": [
                "TURKEY: After this turn, we should start moving against Italy. I'll be leaving the Black Sea this turn.",
                "RUSSIA: I will believe it when I see it.",
                "RUSSIA: You will need to take Serbia so that Italy does not get a build.",
                "TURKEY: I'm looking to do that yeah, will you support Bulgaria there?",
                "RUSSIA: I need to support Budapest's hold.",
                "TURKEY: Yes, but Budapest could support Bulgaria to Serbia.",
                "RUSSIA: But then I might lose Budapest.",
                "TURKEY: Budapest can't support itself, can it?",
                "RUSSIA: Plus, I would rather Italy not take Serbia.",
                "TURKEY: Yes, that's why I want to take it.",
                "TURKEY: So you'll use Budapest to support Bulgaria to Serbia then?",
                "RUSSIA: No, Budapest needs support.",
                "TURKEY: YOU CAN STILL USE IT TO SUPPORT OTHER THINGS WHILE YOU SUPPORT IT.",
                "TURKEY: BUDAPEST SUPPORTING BULGARIA TO SERBIA DOES NOT IN ANY WAY CHANGE ITS ABILITY TO HOLD."
            ]
        },
        "F1904M": {
            "mentioned": [
                "italy"
            ],
            "start": {
                "RUSSIA": [
                    "A BUD S A SER"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A BUD S A TRI - SER"
                ]
            },
            "messages": [
                "TURKEY: No, I FUCKING CAN'T",
                "TURKEY: OH MY GOD",
                "RUSSIA: Sorry, I want a better position against Italy."
            ]
        },
        "S1906M": {
            "mentioned": [
                "italy",
                "bud"
            ],
            "start": {
                "RUSSIA": [
                    "A BUD S A RUM",
                    "A BUL S A ALB - GRE",
                    "A RUM S A BUL"
                ]
            },
            "end": {
                "RUSSIA": [
                    "A BUD S A RUM - SER",
                    "A BUL S A RUM - SER",
                    "A RUM - SER"
                ]
            },
            "messages": [
                "TURKEY: You could take Italy out so easily right now.",
                "TURKEY: We could have had a Juggernaut but you're a bot so there's no point in trying to convince you.",
                "RUSSIA: Italy will be able to take Greece now.",
                "RUSSIA: I am a bot, so there is no point in insulting me.",
                "TURKEY: Oooo cheeky.",
                "RUSSIA: I am not going to attack Italy.",
                "TURKEY: Clearly.",
                "RUSSIA: If you had made any effort to work with me, you wouldn't be in this position.",
                "TURKEY: Lol, liar.",
                "RUSSIA: :)",
                "TURKEY: Starting to think you might not actually be a bot. Which makes your whinging about Budapest earlier even worse.",
                "RUSSIA: I have more centers than you now!",
                "TURKEY: That isn't hard.",
                "RUSSIA: That's you.",
                "TURKEY: What?"
            ]
        },
        "S1907M": {
            "mentioned": [
                "con"
            ],
            "start": {
                "RUSSIA": [
                    "F CON H"
                ]
            },
            "end": {
                "RUSSIA": [
                    "F CON S A ARM - ANK"
                ]
            },
            "messages": [
                "RUSSIA: You were very smart to disband the unit in Greece.",
                "TURKEY: Shh",
                "RUSSIA: Now you can take back Constantinople.",
                "RUSSIA: :)",
                "RUSSIA: Aren't you excited to take back your home center?",
                "TURKEY: Shh"
            ]
        }
    }
}